pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// bl602_demo_at_text_0001.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 2301089C: void rxu_cntrl_monitor_pm(Register (ptr32 Eq_33088) a0)
// Called from:
//      txl_payload_handle_backup
void rxu_cntrl_monitor_pm(struct Eq_33088 * a0)
{
	if ((word32) g_b4202159F == 0x00)
	{
		g_t42021598 = (word16) (word32) a0->w0000;
		g_t4202159A = (word16) (word32) a0->w0002;
		g_t4202159C = (word16) (word32) a0->w0004;
		g_t4202159E.u1 = 0x0100;
	}
}

// 230108CC: Register word32 rxu_cntrl_get_pm()
// Called from:
//      txu_cntrl_cfm
//      me_sta_add_req_handler
word32 rxu_cntrl_get_pm()
{
	g_t4202159E.u1 = 0x00;
	return 0x42021530;
}

// 230108DE: void rxu_cntrl_evt(Register Eq_2 a4, Register ptr32 mstatus)
void rxu_cntrl_evt(Eq_2 a4, ptr32 mstatus)
{
	ke_evt_clear(0x00080000, a4, mstatus);
	if (g_dw42021570 == 0x00)
		return;
	word32 a5_27;
	ke_evt_set(0x20000000, a4, mstatus, out a5_27);
}

// 23010906: void rxu_swdesc_upload_evt(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register ptr32 s7, Register ptr32 s8, Register ptr32 s9, Register ptr32 s10, Register ptr32 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg58, Stack word32 dwArgB4, Stack word32 dwArgD4, Stack word32 dwArgF4, Stack word32 dwArg0114)
void rxu_swdesc_upload_evt(Eq_2 ra, Eq_2 s0, Eq_2 a4, ptr32 s7, ptr32 s8, ptr32 s9, ptr32 s10, ptr32 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg58, word32 dwArgB4, word32 dwArgD4, word32 dwArgF4, word32 dwArg0114)
{
	struct Eq_45531 * a5_207;
	Eq_2 s0_208 = co_list_pop_front(a4, ke_evt_clear(0x20000000, a4, mstatus), out a5_207);
	ptr32 s5_158 = fp + -56;
	word32 s4_157 = 0x01;
	Eq_45545 s6_159 = 847;
	Eq_2 s3_113 = 1107421720;
	while (s0_208 != 0x00)
	{
		Eq_45545 s1_221 = (word32) a5_207->w001C;
		struct Eq_45554 * a1_46;
		struct Eq_45555 * a5_50;
		word32 a4_384;
		word32 a0_382;
		word32 a2_383;
		word32 t1_381;
		Eq_45560 a3_104;
		Eq_2 ra_51 = memset(ra, fp + -72, 0x00, 40, out t1_381, out a0_382, out a1_46, out a2_383, out a3_104, out a4_384, out a5_50);
		struct Eq_45575 * s0_54 = a5_50->ptr0004;
		ptr32 a4_55 = fp + -72;
		struct Eq_45582 * a2_56 = fp + -72;
		struct Eq_45584 * a5_57 = a5_50->ptr0008;
		while (s1_221 != 0x00 && a4_55 != s5_158)
		{
			struct Eq_45707 * a3_63 = (word32) s0_54->b001D;
			s0_54->b001D = (byte) ((char *) &a3_63->ptr0000 + 1);
			a1_46->ptr0000 = a4_55;
			struct Eq_45721 * a5_69 = a3_63->ptr000D;
			Mem73[a2_56 + 32:word16] = SLICE(a3_63 + 0x02 - a1_46, word16, 0);
			a5_69->ptr002C = a4_55;
			a5_69->dw0014 = s4_157;
			a3_104 = &a5_69->dw0014 + 2;
			if (s6_159 < s1_221)
				s1_221 = (word32) s1_221.u0 - 848;
			else
				s1_221.u0 = 0x00;
			a5_57 = a5_69->ptr0004;
			a4_55 += 0x04;
			++a2_56;
		}
		Eq_2 a4_188;
		Eq_2 a5_186;
		a5_57->ptr0004->b001E = (byte) s4_157;
		a5_57->dw0060 = s4_157;
		word32 a0_143;
		Eq_2 a1_144;
		Eq_2 a3_146;
		Eq_2 a4_147;
		struct Eq_28009 * s0_151;
		ra = tcpip_stack_input(ra_51, (word32) *((char *) a2_56[2].ptr0004 + 24), (word32) *((word32) a3_104 + 84) + 28, a3_104, fp + -72, s3_113, s7, s8, s9, s10, s11, fflags, frm, dwLoc48, dwArg58, dwArgB4, dwArgD4, dwArgF4, dwArg0114, out s0_151, out a0_143, out a1_144, out a3_146, out a4_147, out s3_113, out s4_157, out s5_158, out s6_159, out s7, out s8, out s9, out s10, out s11, out fflags, out frm);
		if (a0_143 != 0x00)
		{
			word32 a3_387;
			word32 a1_386;
			rxl_mpdu_free(s0_151, a1_144, a3_146, a4_147, mstatus, dwLoc48, s0, out a1_386, out a3_387, out a4_188, out a5_186, out s8);
		}
		else
		{
			word32 a5_385;
			vTaskEnterCritical(a4_147, mstatus, out a5_385);
			*((word32) s3_113 + 20) = (word32) *((word32) s3_113 + 20) + (word32) s0_151->b001D;
			vTaskExitCritical(a3_146, mstatus, out a4_188, out a5_186);
		}
		s0_208 = co_list_pop_front(a4_188, a5_186, out a5_207);
	}
}

// 230109F4: void scanu_confirm(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      scanu_scan_next
//      scan_start_cfm_handler
void scanu_confirm(Eq_2 ra, Eq_2 a4, ptr32 mstatus)
{
	byte * a0_27;
	byte * s2_45;
	word32 s3_38;
	Eq_2 a1_16 = (word32) g_w42021714;
	if ((word32) g_t42021716 != 0x00)
	{
		Eq_2 a4_53;
		word32 s1_58;
		word32 s0_209;
		word32 a0_210;
		word32 a1_211;
		word32 a2_212;
		word32 a3_213;
		word32 a5_214;
		word32 a6_215;
		word32 s2_216;
		word32 s3_217;
		word32 s4_218;
		word32 s8_219;
		word32 s0_220;
		word32 s1_221;
		word32 a1_222;
		word32 a2_223;
		word32 a3_224;
		word32 a4_225;
		word32 a5_226;
		word32 a6_227;
		word32 s4_228;
		word32 s8_229;
		ke_msg_alloc(ke_msg_alloc(ra, 0x01000003, a1_16, 0x01, a4, mstatus, dwLoc08, out s0_209, out s1_58, out a0_210, out a1_211, out a2_212, out a3_213, out a4_53, out a5_214, out a6_215, out s2_216, out s3_217, out s4_218, out s8_219), s1_58 + 3, 0x0D, 0x01, a4_53, mstatus, dwLoc08, out s0_220, out s1_221, out a0_27, out a1_222, out a2_223, out a3_224, out a4_225, out a5_226, out a6_227, out s2_45, out s3_38, out s4_228, out s8_229);
	}
	else
	{
		word32 a2_201;
		word32 a3_202;
		word32 s0_198;
		word32 s1_199;
		word32 a1_200;
		word32 a4_203;
		word32 a5_204;
		word32 a6_205;
		word32 s2_206;
		word32 s4_207;
		word32 s8_208;
		ke_msg_alloc(ra, 0x01000001, a1_16, 0x01, a4, mstatus, dwLoc08, out s0_198, out s1_199, out a0_27, out a1_200, out a2_201, out a3_202, out a4_203, out a5_204, out a6_205, out s2_206, out s3_38, out s4_207, out s8_208);
		s2_45 = a0_27;
	}
	*s2_45 = (byte) s3_38;
	Eq_2 s2_105;
	word32 s1_241;
	word32 a3_242;
	word32 a4_243;
	word32 a5_244;
	word32 s4_245;
	*ke_msg_free(a0_27 + -0x0C, mstatus, out s1_241, out a3_242, out a4_243, out a5_244, out s2_105, out s4_245) = 0x00;
	Eq_2 s1_119;
	word32 s3_121;
	word32 a0_246;
	word32 a1_247;
	word32 a2_248;
	word32 a3_249;
	word32 a4_250;
	word32 a5_251;
	word32 s2_252;
	word32 s4_253;
	word32 s8_254;
	ke_msg_send(s2_105, mstatus, out s1_119, out a0_246, out a1_247, out a2_248, out a3_249, out a4_250, out a5_251, out s2_252, out s3_121, out s4_253, out s8_254);
	if (s1_119 != 0x00)
	{
		*s1_119 = (byte) s3_121;
		word32 s1_230;
		word32 a0_231;
		word32 a1_232;
		word32 a2_233;
		word32 a3_234;
		word32 a4_235;
		word32 a5_236;
		word32 s2_237;
		word32 s3_238;
		word32 s4_239;
		word32 s8_240;
		ke_msg_send(s1_119, mstatus, out s1_230, out a0_231, out a1_232, out a2_233, out a3_234, out a4_235, out a5_236, out s2_237, out s3_238, out s4_239, out s8_240);
	}
	word32 s1_255;
	word32 a0_256;
	word32 a1_257;
	word32 a4_258;
	word32 a5_259;
	word32 s2_260;
	word32 s3_261;
	word32 s4_262;
	ke_state_set(0x04, 0x00, mstatus, out s1_255, out a0_256, out a1_257, out a4_258, out a5_259, out s2_260, out s3_261, out s4_262);
}

// 23010A7C: Register Eq_2 scanu_raw_send_cfm(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      scanu_raw_send_req_handler
Eq_2 scanu_raw_send_cfm(Eq_2 ra, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_17;
	union Eq_2 * s0_25;
	word32 s1_60;
	word32 a1_61;
	word32 a2_62;
	word32 a3_63;
	word32 a4_64;
	word32 a5_65;
	word32 a6_66;
	word32 s2_67;
	word32 s3_68;
	word32 s4_69;
	word32 s8_70;
	Eq_2 ra_24 = ke_msg_alloc(ra, 0x01000006, a1, 0x04, a4, mstatus, dwArg08, out s0_25, out s1_60, out a0_17, out a1_61, out a2_62, out a3_63, out a4_64, out a5_65, out a6_66, out s2_67, out s3_68, out s4_69, out s8_70);
	*s0_25 = (union Eq_2 *) a0_17;
	ptr32 a4_42;
	ptr32 a5_43;
	word32 s1_71;
	word32 a0_72;
	word32 a1_73;
	word32 a2_74;
	word32 a3_75;
	word32 s2_76;
	word32 s3_77;
	word32 s4_78;
	word32 s8_79;
	ke_msg_send(a0_17, mstatus, out s1_71, out a0_72, out a1_73, out a2_74, out a3_75, out a4_42, out a5_43, out s2_76, out s3_77, out s4_78, out s8_79);
	a4Out = a4_42;
	a5Out = a5_43;
	return ra_24;
}

// 23010A9C: Register Eq_2 scanu_init(Register Eq_2 ra, Register ptr32 mstatus)
// Called from:
//      me_init
Eq_2 scanu_init(Eq_2 ra, ptr32 mstatus)
{
	word32 s1_54;
	word32 a0_55;
	word32 a1_56;
	word32 a4_57;
	word32 a5_58;
	word32 s2_59;
	word32 s3_60;
	word32 s4_61;
	ke_state_set(0x04, 0x00, mstatus, out s1_54, out a0_55, out a1_56, out a4_57, out a5_58, out s2_59, out s3_60, out s4_61);
	word32 t1_62;
	word32 a0_63;
	word32 a1_64;
	word32 a2_65;
	word32 a3_66;
	word32 a4_67;
	word32 a5_68;
	Eq_2 ra_34 = memset(ra, 0x420215AC, 0x00, 404, out t1_62, out a0_63, out a1_64, out a2_65, out a3_66, out a4_67, out a5_68);
	g_dw23011708 = 0x420215AC;
	g_dw420215BC = 0x00;
	g_t42045DD4.u1 = 0x420215AC;
	g_dw42045DE0 = 0x42045DCC;
	return ra_34;
}

// 23010AEA: Register (ptr32 Eq_46074) scanu_find_result(Register (ptr32 Eq_46074) a0, Register word32 a1, Register out Eq_2 a3Out, Register out (ptr32 Eq_46074) a5Out)
// Called from:
//      scanu_search_by_bssid
//      rxu_mgt_ind_handler
struct Eq_46074 * scanu_find_result(struct Eq_46074 * a0, word32 a1, union Eq_2 & a3Out, struct Eq_46074 & a5Out)
{
	struct Eq_46074 * a5_28 = &g_t420215C4;
	do
	{
		struct Eq_46074 * a0_12 = a5_28;
		if ((word32) a5_28->b0034 != 0x00)
		{
			if ((word32) a5_28->b0000 == (word32) a0->b0000 && ((word32) a5_28->b0001 == (word32) a0->b0001 && ((word32) a5_28->b0002 == (word32) a0->b0002 && ((word32) a5_28->b0003 == (word32) a0->b0003 && ((word32) a5_28->b0004 == (word32) a0->b0004 && (word32) a5_28->b0005 == (word32) a0->b0005)))))
			{
				a3Out.u0 = <invalid>;
				a5Out = a5_28;
				return a5_28;
			}
		}
		else if (a1 != 0x00)
			goto l23010B5A;
		++a5_28;
	} while (a5_28 != &g_w42021714);
	a0_12 = null;
l23010B5A:
	a3Out.u0 = <invalid>;
	a5Out = a5_28;
	return a0_12;
}

