pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23010B5C: void scanu_frame_handler(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s3, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg98)
// Called from:
//      rxu_mgt_ind_handler
void scanu_frame_handler(Eq_2 ra, Eq_2 a0, Eq_2 s3, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg98)
{
	struct Eq_46154 * s5_1014 = (word32) g_ptr420215AC->b014E;
	Eq_2 s6_1001 = (word32) a0 + 64;
	word32 a5_1690;
	Eq_2 a0_45 = mac_ie_find((word32) a0 + 64, (word32) (word16) ((word32) *a0 + -36), 0x00, out a5_1690);
	struct Eq_46179 * s4_1031 = &g_ptr420215AC;
	if (a0_45 != 0x00)
	{
		Eq_46183 a5_47 = (word32) *((word32) a0_45 + 1);
		if (a5_47 <= 32)
		{
			if (a5_47 == 0x00)
				goto l23010BDA;
		}
		else
			a5_47.u0 = 32;
		byte * a3_53 = (word32) a0_45 + 2;
		if ((word32) *((word32) a0_45 + 2) != 0x00)
		{
			byte bLoc64_1106 = (byte) a5_47;
			byte * a4_57 = fp + -100;
			while (true)
			{
				a5_47 = (word32) a5_47 - 1;
				++a4_57;
				if (a5_47 == ~0x00)
					break;
				*a4_57 = (byte) (word32) *a3_53;
				++a3_53;
			}
			((word32) bLoc64_1106 + (fp + -64))->b0FDD = 0x00;
		}
	}
l23010BDA:
	word32 a4_1692;
	word32 a0_77;
	word32 s2_1693;
	word32 a2_1691;
	ke_state_get(0x04, s6, out a0_77, out a2_1691, out a4_1692, out s2_1693);
	if (a0_77 != 0x01)
	{
l23011310:
		ke_msg_forward_and_change_id(a0, a1, a2, a3, mstatus);
		return;
	}
	word32 a5_1695;
	word32 a3_1694;
	struct Eq_46074 * a0_90 = scanu_find_result((word32) a0 + 44, 0x01, out a3_1694, out a5_1695);
	struct Eq_46074 * s8_1022 = a0_90;
	if (a0_90 == null)
		goto l23011310;
	ui32 a5_99 = (word32) g_t42021718;
	if ((a5_99 & 1) == 0x00 && ((word32) (*((word32) a0 + 44)) != a5_99 || ((word32) (*((word32) a0 + 45)) != (word32) g_b42021719 || ((word32) (*((word32) a0 + 46)) != (word32) g_b4202171A || ((word32) (*((word32) a0 + 47)) != (word32) g_b4202171B || ((word32) (*((word32) a0 + 48)) != (word32) g_t4202171C || (word32) (*((word32) a0 + 49)) != (word32) g_b4202171D))))))
		goto l23011310;
	a0_90->b0000 = (byte) (word16) (word32) *((word32) a0 + 44);
	a0_90->b0002 = (byte) (word16) (word32) *((word32) a0 + 46);
	a0_90->b0004 = (byte) (word16) (word32) *((word32) a0 + 48);
	a0_90->w0030 = (word16) ((word32) *((word32) a0 + 61) << 8 | (word32) (*((word32) a0 + 60)));
	ui32 a5_129 = (word32) *((word32) a0 + 63) << 8 | (word32) (*((word32) a0 + 62));
	a0_90->w0032 = (word16) a5_129;
	ui32 a5_131 = a5_129 & 0x01;
	if ((a5_129 & 0x01) == 0x00)
		a5_131 = 0x02;
	a0_90->w0028 = (word16) a5_131;
	uint32 s2_146 = (word32) *a0 + -36 << 16;
	byte * s2_147 = s2_146 >> 0x10;
	word32 a5_1696;
	Eq_2 a0_151 = mac_ie_find((word32) a0 + 64, s2_146 >> 0x10, 0x00, out a5_1696);
	if (a0_151 != 0x00)
	{
		Eq_46389 a5_153 = (word32) *((word32) a0_151 + 1);
		if (a5_153 <= 32)
		{
			if (a5_153 == 0x00)
				goto l23010CAE;
		}
		else
			a5_153.u0 = 32;
		byte * a4_159 = (word32) a0_151 + 2;
		if ((word32) *((word32) a0_151 + 2) != 0x00)
		{
			a0_90->b0006 = (byte) a5_153;
			struct Eq_47732 * a3_163 = &a0_90->b0006 + 1;
			while (true)
			{
				a5_153 = (word32) a5_153 - 1;
				if (a5_153 == ~0x00)
					break;
				++a3_163;
				a3_163[0x0FFF] = (struct Eq_47732) (byte) (word32) *a4_159;
				++a4_159;
			}
		}
	}
	else
		a0_90->b0006 = 0x00;
l23010CAE:
	a0_90->b0036 = (byte) (int32) *((word32) a0 + 26);
	struct Eq_46406 * a5_183 = (int32) *((word32) a0 + 25);
	a0_90->b0037 = (byte) a5_183;
	Eq_2 a5_1083 = (word32) a5_183->b0150;
	if (a5_1083 != 0x00)
	{
		Eq_2 s1_1078 = 0x00;
		struct Eq_46424 * s3_1080 = (word32) a5_1083 + 252;
		while (true)
		{
			a5_1083 = (word32) *((word32) a5_1083 + 336);
			if (s1_1078 >= a5_1083)
				break;
			a5_1083 = (word32) s3_1080->b0000;
			if (a5_1083 == 0x00)
				goto l23010D4C;
			Eq_2 a2_205 = (word32) a0_90->b0006;
			if (a2_205 == a5_1083)
			{
				word32 a3_1699;
				word32 a4_1700;
				word32 a1_1697;
				word32 a2_1698;
				if (memcmp(&s3_1080->b0000 + 1, &a0_90->b0006 + 1, a2_205, out a1_1697, out a2_1698, out a3_1699, out a4_1700, out a5_1083) == 0x00)
					break;
			}
			s1_1078 = (word32) s1_1078 + 1;
			++s3_1080;
		}
		if ((word32) *((word32) a5_1083 + 336) == s1_1078)
			goto l23011310;
	}
l23010D4C:
	int32 a5_254;
	word32 a5_1701;
	Eq_2 a0_238 = mac_ie_find((word32) a0 + 64, s2_146 >> 0x10, 0x03, out a5_1701);
	if (a0_238 == 0x00)
	{
		if ((int32) a0_90->b0035 >= (int32) (*((word32) a0 + 24)))
		{
l23010DA0:
			if ((word32) g_t42021716 == 0x00)
			{
l230112F2:
				struct Eq_47598 * a5_1030 = (word32) s8_1022->b0034;
				if (a5_1030 == null)
				{
					word32 a5_1038 = (word32) s4_1031->w0014;
					s4_1031->w0014 = (word16) (a5_1038 + 0x01);
					a5_1030 = a5_1038 + 0x01;
				}
				if ((word32) a5_1030->b0150 != 0x00)
					s8_1022->b0034 = 0x01;
				goto l23011310;
			}
			s5_1014->w420208F0 = (word16) (word32) a0_90->w0028;
			s5_1014->t420208C8 = a0_90->b0000;
			s5_1014->w420208CC = (word16) (word32) a0_90->b0004;
			s5_1014->w420208FE = (word16) (word32) a0_90->w0032;
			s5_1014->w420208FC = (word16) (word32) a0_90->w0030;
			word32 a1_1703;
			word32 a5_1707;
			word32 a4_1706;
			word32 a3_1705;
			word32 a6_1708;
			word32 a2_1704;
			word32 a7_1709;
			memcpy(&s5_1014->w420208CC + 1, &a0_90->b0006, 0x0022, out a1_1703, out a2_1704, out a3_1705, out a4_1706, out a5_1707, out a6_1708, out a7_1709);
			struct Eq_37238 * a5_368 = a0_90->ptr002C;
			s5_1014->dw42020930 = 0x00;
			s5_1014->ptr420208F4 = a5_368;
			s5_1014->b42020925 = (byte) (int32) a0_90->b0036;
			s5_1014->b42020926 = (byte) (int32) a0_90->b0037;
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg56 = <invalid>;
			me_extract_rate_set(a0, a1, a2, stackArg56);
			ptr32 s3_326 = (char *) s5_1014 + 0x05D8;
			int32 s1_1017 = 1107427192;
			if ((word32) a0_90->ptr002C->b0002 == 0x00)
			{
				ui32 a0_390;
				struct Eq_46638 * s7_403;
				word32 a4_1713;
				me_legacy_rate_bitfield_build(&s5_1014->w420208FE + 1, 0x01, dwArg98, out s1_1017, out a0_390, out a4_1713, out s2_147, out s3_326, out s4_1031, out s5_1014, out s6_1001, out s7_403, out s8_1022);
				if ((a0_390 & 0x0F) != 0x00)
				{
					word32 a4_1714;
					word32 a5_1715;
					s7_403->b03D7 = (byte) (0x1F - __clzsi2(a0_390 & 0x0F, out a4_1714, out a5_1715));
				}
				else
					s7_403->b03D7 = 0x01;
			}
			word32 a0_1717;
			word32 a2_1718;
			word32 s4_1720;
			word32 a4_1719;
			mac_vsie_find(a0, a1, a2, a3, out a0_1717, out a2_1718, out a4_1719, out s4_1720);
			if (s6_1001 != 0x00)
			{
				struct Eq_46694 * a5_438 = (char *) s5_1014 + 0x05D8 + s1_1017;
				a5_438->b03C0 = (byte) (word32) *((word32) s6_1001 + 8);
				a5_438->w03AE = (word16) ((word32) a5_438->w03AE | 0x0200);
				uint32 a3_452 = (word32) *((word32) s6_1001 + 0x0D) << 24 | (((word32) (*((word32) s6_1001 + 11)) << 8 | (word32) (*((word32) s6_1001 + 0x0A))) | (word32) (*((word32) s6_1001 + 0x0C)) << 16);
				ui32 a1_457 = a3_452 >> 0x03 & 2;
				a5_438->b03C1 = (byte) a1_457;
				a5_438->dw03C8 = a3_452 & 0x0F | (a3_452 >> 0x08) << 4;
				uint32 a3_470 = (word32) *((word32) s6_1001 + 0x0011) << 24 | (((word32) (*((word32) s6_1001 + 0x0F)) << 8 | (word32) (*((word32) s6_1001 + 0x0E))) | (word32) (*((word32) s6_1001 + 16)) << 16);
				ui32 a4_477 = a3_470 >> 0x04 & 0x01 | a1_457;
				a5_438->b03C1 = (byte) a4_477;
				a5_438->dw03C4 = a3_470 & 0x0F | (a3_470 >> 0x08) << 4;
				uint32 a3_489 = (word32) *((word32) s6_1001 + 21) << 24 | (((word32) (*((word32) s6_1001 + 19)) << 8 | (word32) (*((word32) s6_1001 + 18))) | (word32) (*((word32) s6_1001 + 20)) << 16);
				ui32 a4_492 = a4_477 | a3_489 >> 0x02 & 0x04;
				a5_438->b03C1 = (byte) a4_492;
				a5_438->dw03CC = a3_489 & 0x0F | (a3_489 >> 0x08) << 4;
				uint32 a3_508 = (word32) *((word32) s6_1001 + 25) << 24 | (((word32) (*((word32) s6_1001 + 23)) << 8 | (word32) (*((word32) s6_1001 + 22))) | (word32) (*((word32) s6_1001 + 24)) << 16);
				a5_438->b03C1 = (byte) (a4_492 | a3_508 >> 0x01 & 0x08);
				int32 a4_517 = a5_438->dw03E0;
				a5_438->dw03D0 = a3_508 & 0x0F | (a3_508 >> 0x08) << 4;
				a5_438->dw03E0 = a4_517 | 1;
			}
			else
			{
				struct Eq_47659 * a5_429 = (char *) s5_1014 + 0x05D8 + s1_1017;
				a5_429->dw03C4 = 16775747;
				a5_429->dw03C8 = 16775747;
				a5_429->dw03CC = 16775747;
				a5_429->dw03D0 = 16775747;
			}
			Eq_2 s10_524 = 0x00;
			if ((word32) g_b42020B6A != 0x00)
			{
				struct Eq_46914 * s7_529 = (char *) s5_1014 + 0x05D8 + s1_1017;
				int32 s10_530 = s7_529->dw03E0;
				s10_524 = s10_530 & 1;
				if ((s10_530 & 1) != 0x00)
				{
					word32 a5_1721;
					Eq_2 a0_539 = mac_ie_find(s6_1001, s2_147, 45, out a5_1721);
					if (a0_539 != 0x00)
					{
						s7_529->w0358 = (word16) ((word32) *((word32) a0_539 + 3) << 8 | (word32) (*((word32) a0_539 + 2)));
						s7_529->b035A = (byte) (word32) *((word32) a0_539 + 4);
						ptr32 a1_544 = s3_326 + 859;
						int32 a5_552;
						for (a5_552 = 0x00; a5_552 != 0x10; ++a5_552)
							(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(a5_552 + a1_544)[s1_1017].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0] = (byte) (word32) ((word32) a0_539 + 5 + a5_552);
						struct Eq_46976 * a5_573 = (char *) s5_1014 + 0x05D8 + s1_1017;
						a5_573->w036C = (word16) ((word32) *((word32) a0_539 + 22) << 8 | (word32) (*((word32) a0_539 + 21)));
						a5_573->dw0370 = (word32) *((word32) a0_539 + 24) << 8 | (word32) (*((word32) a0_539 + 23));
						a5_573->b0374 = (byte) (word32) *((word32) a0_539 + 27);
						a5_573->dw03E0 |= 2;
					}
					word32 a5_1722;
					s10_524 = mac_ie_find(s6_1001, s2_147, 61, out a5_1722);
				}
			}
			struct Eq_38816 * a5_611 = (word32) *((word32) g_t42021740 + 320);
			struct Eq_47037 * s9_614 = (char *) s5_1014 + 0x05D8 + s1_1017;
			s9_614->b03E8 = (byte) a5_611;
			if (a5_611 == null)
			{
l230112B2:
				me_extract_power_constraint(s6_1001, s2_147, me_bw_check(s10_524, a5_611));
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg56 = <invalid>;
				me_extract_country_reg(a0, a1, a2, stackArg56);
				me_extract_mobility_domain(a0, a1, a2);
				struct Eq_47586 * s1_1018 = (char *) s5_1014 + 0x05D8 + s1_1017;
				s1_1018->dw03E0 |= 0x80000000;
				goto l230112F2;
			}
			a5_611 = s9_614->ptr03E0;
			if (a5_611 < null)
				goto l230112B2;
			Eq_2 a5_685 = s3_326 + 1003 + s1_1017;
			word32 a2_1733;
			word32 a1_1732;
			word32 t1_1723;
			word32 a0_1724;
			word32 a2_1726;
			word32 a4_1728;
			word32 a1_1725;
			word32 a3_1727;
			word32 t1_1730;
			word32 a5_1729;
			word32 a0_1731;
			word32 t1_1737;
			word32 a5_1736;
			word32 a4_1735;
			word32 a0_1738;
			word32 a3_1741;
			word32 a4_1742;
			word32 a5_1743;
			word32 a2_1740;
			word32 a2_1747;
			word32 a5_1750;
			word32 t1_1751;
			word32 a3_1748;
			word32 a1_1739;
			word32 a3_1734;
			word32 a1_1746;
			word32 a4_1749;
			word32 a3_1755;
			word32 t1_1744;
			word32 a0_1745;
			word32 a2_1754;
			word32 a1_1753;
			word32 a5_1757;
			word32 a0_1752;
			word32 a4_1756;
			Eq_2 ra_711 = memset(memset(memset(memset(memset(ra, s3_326 + 1001 + s1_1017, 0x00, 0x02, out t1_1723, out a0_1724, out a1_1725, out a2_1726, out a3_1727, out a4_1728, out a5_1729), s3_326 + 1005 + s1_1017, 0x00, 0x01, out t1_1730, out a0_1731, out a1_1732, out a2_1733, out a3_1734, out a4_1735, out a5_1736), s3_326 + 0x03EE + s1_1017, 0x00, 0x01, out t1_1737, out a0_1738, out a1_1739, out a2_1740, out a3_1741, out a4_1742, out a5_1743), a5_685, 0x00, 0x01, out t1_1744, out a0_1745, out a1_1746, out a2_1747, out a3_1748, out a4_1749, out a5_1750), s3_326 + 1004 + s1_1017, 0x00, 0x01, out t1_1751, out a0_1752, out a1_1753, out a2_1754, out a3_1755, out a4_1756, out a5_1757);
			s9_614->b0411 = 0x00;
			s9_614->b03EF = 0x00;
			s9_614->b03F0 = 0x00;
			word32 a5_1758;
			Eq_2 a0_724 = mac_ie_find(s6_1001, s2_147, 48, out a5_1758);
			Eq_2 s7_727 = s3_326 + 1009 + s1_1017;
			if (a0_724 != 0x00)
			{
				Eq_2 a2_731 = (word32) *((word32) a0_724 + 1) + 0x02 & 0x00FF;
				s9_614->b0411 = (byte) a2_731;
				word32 a2_1760;
				word32 a1_1759;
				word32 a3_1761;
				word32 a6_1764;
				word32 a7_1765;
				word32 a4_1762;
				word32 a5_1763;
				memcpy(s7_727, a0_724, a2_731, out a1_1759, out a2_1760, out a3_1761, out a4_1762, out a5_1763, out a6_1764, out a7_1765);
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg268 = <invalid>;
				word32 s1_1770;
				word32 s0_1769;
				word32 a0_1771;
				word32 s4_1773;
				word32 s3_1772;
				process_rsn_ie(a0, a1, a2, a3, a4, a5, stackArg268, out s0_1769, out s1_1770, out a0_1771, out s3_1772, out s4_1773);
				Eq_47240 a1_753 = s9_614->t03EC;
				s9_614->b0411 = (byte) s7_727;
				word32 s8_1820;
				word32 s11_1823;
				struct Eq_47250 * s9_784;
				Eq_2 a3_803;
				word32 t4_1824;
				word32 a4_1814;
				word32 a7_1816;
				word32 s2_1817;
				word32 a0_1775;
				word32 s1_1774;
				word32 a1_1776;
				word32 a2_1795;
				word32 a4_1779;
				word32 a5_1780;
				word32 s5_1785;
				word32 s3_1783;
				word32 a7_1781;
				word32 s4_1784;
				word32 s6_1786;
				word32 s2_1782;
				word32 t4_1791;
				word32 s10_1789;
				word32 a3_1778;
				word32 s7_1787;
				word32 a2_1777;
				word32 s8_1788;
				word32 s11_1790;
				word32 a4_1796;
				word32 a1_1794;
				word32 a5_1797;
				word32 a0_1793;
				word32 s3_1818;
				word32 s8_1805;
				word32 s1_1792;
				word32 s2_1799;
				word32 s4_1801;
				word32 s5_1802;
				word32 s3_1800;
				word32 a7_1798;
				word32 a1_1811;
				word32 s9_1806;
				word32 s11_1808;
				word32 s10_1807;
				word32 t4_1809;
				word32 a0_1810;
				word32 a3_1813;
				word32 s6_1803;
				word32 s7_1804;
				word32 a2_1812;
				word32 s4_1819;
				word32 a5_1815;
				word32 s10_1822;
				word32 s9_1821;
				ra_711 = printf(printf(printf(ra_711, &g_t230AC5D8, a1_753 >> 0x11 & 0x01, a5_685, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1774, out a0_1775, out a1_1776, out a2_1777, out a3_1778, out a4_1779, out a5_1780, out a7_1781, out s2_1782, out s3_1783, out s4_1784, out s5_1785, out s6_1786, out s7_1787, out s8_1788, out s9_784, out s10_1789, out s11_1790, out t4_1791), &g_t230AC614, s9_784->t03EC >> 0x09 & 0x01, a5_685, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1792, out a0_1793, out a1_1794, out a2_1795, out a3_803, out a4_1796, out a5_1797, out a7_1798, out s2_1799, out s3_1800, out s4_1801, out s5_1802, out s6_1803, out s7_1804, out s8_1805, out s9_1806, out s10_1807, out s11_1808, out t4_1809), &g_t230AC64C, a3_803, a5_685, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1017, out a0_1810, out a1_1811, out a2_1812, out a3_1813, out a4_1814, out a5_1815, out a7_1816, out s2_1817, out s3_1818, out s4_1819, out s5_1014, out s6_1001, out s7_727, out s8_1820, out s9_1821, out s10_1822, out s11_1823, out t4_1824);
			}
			word32 s4_1828;
			word32 a2_1826;
			word32 a0_1825;
			word32 a4_1827;
			mac_vsie_find(a0, a1, a2, a3, out a0_1825, out a2_1826, out a4_1827, out s4_1828);
			Eq_2 a0_851 = s6_1001;
			if (s6_1001 != 0x00)
			{
				struct Eq_47394 * s3_857 = (char *) s5_1014 + 0x05D8 + s1_1017;
				s3_857->b03E9 = (byte) ((word32) s3_857->b03E9 | 8);
				if ((word32) s3_857->b0411 == 0x00)
				{
					Eq_2 a2_867 = (word32) *((word32) s6_1001 + 1) + 0x02 & 0x00FF;
					s3_857->b0411 = (byte) a2_867;
					word32 a4_1832;
					word32 a5_1833;
					word32 a1_1829;
					word32 a2_1830;
					word32 a6_1834;
					word32 a7_1835;
					word32 a3_1831;
					memcpy(s7_727, s6_1001, a2_867, out a1_1829, out a2_1830, out a3_1831, out a4_1832, out a5_1833, out a6_1834, out a7_1835);
					word32 a4_1838;
					word32 s3_1840;
					word32 s1_1836;
					word32 s4_1841;
					word32 s2_1839;
					word32 a2_1837;
					process_wpa_ie(a0, a1, a2, out s1_1836, out a2_1837, out a4_1838, out s2_1839, out s3_1840, out s4_1841);
					s3_857->b0411 = (byte) s7_727;
					a0_851 = s7_727;
				}
			}
			struct Eq_47471 * a5_904;
			((word32) a0_851 + 48)->u0 = 0x00;
			struct Eq_47476 * a5_899 = (char *) s5_1014 + 0x05D8 + s1_1017;
			if ((a5_899->dw03E8 & 0x12FFF800) != 0x00)
				a5_904 = (struct Eq_47471 *) 0x09;
			else
			{
				if (((word32) a5_899->w03AE & 0x10) != 0x00)
				{
					a5_899->b03E9 = (byte) ((word32) a5_899->b03E9 | 2);
					*((word32) a0_851 + 59) = 0x01;
l23011268:
					struct Eq_47491 * s3_926 = (char *) s5_1014 + 0x05D8 + s1_1017;
					struct Eq_47524 ** a5_930;
					word32 a2_1843;
					word32 a6_1846;
					word32 a4_1845;
					word32 a3_1844;
					word32 a7_1847;
					word32 a1_1842;
					memcpy((word32) a0_851 + 64, s7_727, (word32) s3_926->b0411, out a1_1842, out a2_1843, out a3_1844, out a4_1845, out a5_930, out a6_1846, out a7_1847);
					*((char *) *a5_930 + 54) = (struct Eq_47524 **) (word16) (word32) s3_926->b0411;
					word32 t4_1858;
					word32 s3_1854;
					word32 s7_1855;
					word32 s11_1857;
					word32 s9_1856;
					word32 a4_1852;
					word32 a7_1853;
					word32 a3_1851;
					word32 a2_1850;
					word32 a1_1849;
					word32 a0_1848;
					printf(ra_711, &g_t230AC66C, s3_926->t03E8 >> 0x0D & 0x01, a5_685, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_1017, out a0_1848, out a1_1849, out a2_1850, out a3_1851, out a4_1852, out a5_611, out a7_1853, out s2_147, out s3_1854, out s4_1031, out s5_1014, out s6_1001, out s7_1855, out s8_1022, out s9_1856, out s10_524, out s11_1857, out t4_1858);
					goto l230112B2;
				}
				a5_904 = (struct Eq_47471 *) 0x02;
			}
			a5_904->t0030 = a0_851;
			goto l23011268;
		}
		word32 a3_1861;
		a0_90->ptr002C = me_freq_to_chan_ptr((word32) *((word32) a0 + 6), (word32) *((word32) a0 + 4), out a3_1861);
		a5_254 = (int32) *((word32) a0 + 24);
l23010D9C:
		a0_90->b0035 = (byte) a5_254;
		goto l23010DA0;
	}
	struct Eq_37232 * a1_264;
	Eq_46482 a1_255 = (word32) *((word32) a0_238 + 2);
	struct Eq_37241 * a0_256 = (word32) *((word32) a0 + 6);
	if (a0_256 == null)
	{
		if (a1_255 <= ~0x0D)
		{
			if (a1_255 != 0x0E)
				a1_264 = (word32) (word16) ((word32) a1_255.u1 + 0x00FFF96C);
			else
				a1_264 = (struct Eq_37232 *) 0x00FFF9B4;
l23010D88:
			word32 a3_1702;
			a0_90->ptr002C = me_freq_to_chan_ptr(a0_256, a1_264, out a3_1702);
			a5_254 = (int32) *((word32) a0 + 24);
			if ((int32) a0_90->b0035 >= a5_254)
				goto l23010DA0;
			goto l23010D9C;
		}
	}
	else if (a0_256 == (struct Eq_37241 *) 0x01 && a1_255 <= -0x00A5)
	{
		a1_264 = (word32) a1_255.u1 + 0x0100038D;
		goto l23010D88;
	}
	a1_264 = (struct Eq_37232 *) 0x0FFFFFFF;
	goto l23010D88;
}

