pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23011342: Register (ptr32 Eq_46074) scanu_search_by_bssid(Register (ptr32 Eq_46074) a0, Register out ptr32 a3Out, Register out ptr32 a5Out)
// Called from:
//      sm_get_bss_params
struct Eq_46074 * scanu_search_by_bssid(struct Eq_46074 * a0, ptr32 & a3Out, ptr32 & a5Out)
{
	ptr32 a3_7;
	ptr32 a5_9;
	struct Eq_46074 * a0_5 = scanu_find_result(a0, 0x00, out a3_7, out a5_9);
	a3Out = a3_7;
	a5Out = a5_9;
	return a0_5;
}

// 23011348: Register word32 scanu_search_by_ssid(Register Eq_2 a0, Register (ptr32 word32) a1, Stack Eq_2 dwArg0128, Register out ptr32 a3Out)
// Called from:
//      sm_get_bss_params
word32 scanu_search_by_ssid(Eq_2 a0, word32 * a1, Eq_2 dwArg0128, ptr32 & a3Out)
{
	if ((word32) *a0 != 0x00)
	{
		struct Eq_47792 * s0_29 = &g_ptr420215AC;
		word32 s2_30 = 0x00;
		int32 s5_32 = -0x0080;
		while ((word32) s0_29->b004C != 0x00)
		{
			if (s5_32 < (int32) s0_29->b004D)
			{
				Eq_2 a2_42 = (word32) *a0;
				if (a2_42 == (word32) s0_29->b001E)
				{
					word32 a4_150;
					word32 a5_151;
					word32 a1_148;
					word32 a2_149;
					if (memcmp(&s0_29->b001E + 1, (word32) a0 + 1, a2_42, out a1_148, out a2_149, out a3, out a4_150, out a5_151) == 0x00)
					{
						s5_32 = (int32) s0_29->b004D;
						*a1 = s2_30;
					}
				}
			}
			++s2_30;
			++s0_29;
			if (s2_30 == 0x06)
				break;
		}
	}
	0x00 = (int8) dwArg0128;
	a3Out = a3;
	return dwArgE4;
}

// 230113D2: Register Eq_2 scanu_rm_exist_ssid(Register Eq_2 ra, Register (ptr32 byte) a0, Register (ptr32 Eq_47851) a1, Register out ptr32 a4Out)
// Called from:
//      sm_connect_ind
Eq_2 scanu_rm_exist_ssid(Eq_2 ra, byte * a0, struct Eq_47851 * a1, ptr32 & a4Out)
{
	if (a1 < null || a0 == null)
	{
		a4Out = a4;
		return ra;
	}
	else
	{
		ptr32 a4_17 = (word32) a1->b42021630;
		if (a4_17 != 0x00)
		{
			Eq_2 a2_19 = (word32) *a0;
			if (a2_19 == (word32) a1->b42021602)
			{
				word32 a5_106;
				word32 a3_105;
				word32 a2_104;
				word32 a1_103;
				if (memcmp(&a1->b42021602 + 1, a0 + 1, a2_19, out a1_103, out a2_104, out a3_105, out a4_17, out a5_106) == 0x00)
				{
					ptr32 a4_47;
					word32 a5_112;
					word32 a3_111;
					word32 a2_110;
					word32 a1_109;
					word32 a0_108;
					word32 t1_107;
					Eq_2 ra_49 = memset(ra, (char *) a1 + 0x420215FC, 0x00, 56, out t1_107, out a0_108, out a1_109, out a2_110, out a3_111, out a4_47, out a5_112);
					a4Out = a4_47;
					return ra_49;
				}
			}
		}
		a4Out = a4_17;
		return ra;
	}
}

// 2301143C: void scanu_scan_next(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      scanu_dma_cb
//      scanu_start
//      scan_done_ind_handler
void scanu_scan_next(Eq_2 ra, Eq_2 a4, ptr32 mstatus)
{
	struct Eq_46156 * s1_11 = g_ptr420215AC;
	while (true)
	{
		up32 a5_24 = (word32) g_b42021717;
		if (a5_24 > 0x01)
			break;
		int32 a3_58 = (word32) s1_11->b014F;
		a4 = (char *) s1_11 + 2;
		int32 s3_60;
		for (s3_60 = 0x00; s3_60 < a3_58; ++s3_60)
		{
			a4 = (word32) a4 + 6;
			if ((word32) *((word32) a4 - 6) == a5_24)
				goto l2301148A;
		}
		if (a3_58 != s3_60)
		{
l2301148A:
			word32 a4_790;
			word32 a3_789;
			word32 a5_791;
			Eq_2 a0_82;
			struct Eq_47941 * s1_91;
			struct Eq_47942 * s2_92;
			word32 a6_792;
			word32 a2_788;
			word32 s0_786;
			word32 s4_793;
			word32 a1_787;
			word32 s8_794;
			int32 s3_115;
			ke_msg_alloc(ra, 0x00FFF800, 0x02, 340, a4, mstatus, dwLoc08, out s0_786, out s1_91, out a0_82, out a1_787, out a2_788, out a3_789, out a4_790, out a5_791, out a6_792, out s2_92, out s3_115, out s4_793, out s8_794);
			*((word32) a0_82 + 334) = (byte) (word32) s1_91->b014E;
			*((word32) a0_82 + 320) = s1_91->t0140;
			*((word32) a0_82 + 0x0144) = (word16) (word32) s1_91->w0144;
			*((word32) a0_82 + 336) = (byte) (word32) s1_91->b0150;
			*((word32) a0_82 + 337) = (byte) (word32) s1_91->b0151;
			for (; s3_115 < (word32) s1_91->b014F; ++s3_115)
			{
				Eq_2 a1_120 = s1_91 + (s3_115 + 0x06) / 338;
				if ((word32) *((word32) a1_120 + 2) == (word32) s2_92->b016B)
				{
					word32 s4_123 = (word32) *((word32) a0_82 + 335);
					word32 a3_804;
					word32 a7_808;
					word32 a5_806;
					word32 a4_805;
					word32 a1_802;
					word32 a6_807;
					word32 a2_803;
					memcpy((word32) a0_82 + (s4_123 + 0x06), a1_120, 0x06, out a1_802, out a2_803, out a3_804, out a4_805, out a5_806, out a6_807, out a7_808);
					*((word32) a0_82 + 335) = (byte) (s4_123 + 0x01);
				}
			}
			int32 s3_144 = 252;
			int32 s4_145;
			for (s4_145 = 0x00; s4_145 < (word32) s1_91->b0150; ++s4_145)
			{
				word32 a3_797;
				word32 a7_801;
				word32 a2_796;
				word32 a5_799;
				word32 a4_798;
				word32 a6_800;
				word32 a1_795;
				memcpy((word32) a0_82 + s3_144, s1_91 + s3_144 / 338, 0x0022, out a1_795, out a2_796, out a3_797, out a4_798, out a5_799, out a6_800, out a7_801);
				s3_144 += 0x0022;
			}
			struct Eq_48060 * a4_171 = s2_92->ptr0000;
			Eq_48064 a3_174 = (word32) a4_171->w014C;
			struct Eq_48069 * a2_177 = g_a42045DDC;
			if (a3_174 > 200)
				a3_174.u0 = 0x00;
			ptr32 t1_185;
			word32 a4_186;
			if ((word32) s2_92->b016B != 0x01 && (word32) a4_171->b0151 == 0x00)
			{
				t1_185 = 0x00;
				a4_186 = 0x0C;
			}
			else
			{
				t1_185 = 0x04;
				a4_186 = 0x08;
			}
			g_b42046D04 = 0x01;
			g_b42045D05 = 0x08;
			struct Eq_48138 * a5_201 = null;
			do
			{
				a5_201[0x42045D06] = (struct Eq_48138) (byte) (word32) (a5_201 + t1_185)[0x230AD224];
				++a5_201;
			} while (a5_201 != (struct Eq_48138 *) 0x08);
			struct Eq_48152 * a5_216 = &g_t42045D0E;
			if (a3_174 != 0x00 && (word32) g_a42045DDC[0] == 0x0A)
			{
				uint32 a1_233 = (word32) g_b42045DDD + 0x02 & 0x00FF;
				struct Eq_48171 * t3_230 = &g_t42045D0E;
				struct Eq_48173 * a6_231 = &g_t42045DCC;
				uint32 t1_234 = a1_233;
				while (true)
				{
					t1_234 += ~0x00;
					++a6_231;
					if (t1_234 == ~0x00)
						break;
					++t3_230;
					t3_230[0x0FFF] = (struct Eq_48171) (byte) (word32) a6_231[0x0F];
				}
				a5_216 = a1_233 + 0x42045D0E;
				a2_177 = a1_233 + 0x42045DDC;
				a3_174 = (word32) (word16) (a3_174 - a1_233);
			}
			if (a4_186 != 0x08)
			{
				ui32 a4_260 = a4_186 + ~0x07;
				a5_216->t0000.u0 = 0x32;
				a5_216[1] = (struct Eq_48152) (byte) (a4_260 & 0x00FF);
				ui32 a4_261 = a4_260 & 0x00FF;
				struct Eq_48214 * a1_268 = &g_t230AD224;
				int32 t1_269 = (a4_260 & 0x00FF) + 2;
				struct Eq_48220 * a6_270 = a5_216 + 2;
				while (true)
				{
					a4_261 += ~0x00;
					++a1_268;
					if (a4_261 == ~0x00)
						break;
					++a6_270;
					a6_270[0x0FFF] = (struct Eq_48220) (byte) (word32) a1_268[7];
				}
				a5_216 += t1_269;
			}
			if ((word32) s2_92->b016B == 0x00)
			{
				a5_216->t0000.u0 = 0x03;
				a5_216[1] = (struct Eq_48152) 0x01;
				a5_216 += 3;
			}
			if (a3_174 != 0x00 && (word32) a2_177->b0000 == 59)
			{
				Eq_48269 a1_313 = 0x00;
				Eq_48269 a4_315 = (word32) a2_177->b0001 + 0x02 & 0x00FF;
				while (a4_315 != a1_313)
				{
					Mem325[a5_216 + a1_313:byte] = SLICE(CONVERT(Mem320[a2_177 + a1_313:byte], byte, word32), byte, 0);
					a1_313 = (word32) a1_313.u0 + 1;
				}
				a5_216 += a4_315;
				a2_177 += a4_315;
				a3_174 = (word32) (word16) (a3_174 - a4_315);
			}
			if ((word32) g_b42020B6A != 0x00)
			{
				a5_216->t0000.u0 = 0x2D;
				a5_216[1] = (struct Eq_48152) 0x1A;
				struct Eq_48311 * a4_342 = &g_t42020B3C;
				struct Eq_48152 * a1_343 = a5_216 + 28;
				a5_216 += 2;
				while (true)
				{
					++a4_342;
					if (a1_343 == a5_216)
						break;
					++a5_216;
					a5_216[0x0FFF] = (struct Eq_48152) (byte) (word32) a4_342[11];
				}
			}
			if (a3_174 != 0x00)
			{
				Eq_48064 a4_356 = 0x00;
				do
				{
					Mem365[a5_216 + a4_356:byte] = SLICE(CONVERT(Mem360[a2_177 + a4_356:byte], byte, word32), byte, 0);
					a4_356 = (word32) a4_356.u0 + 1;
				} while (a3_174 != a4_356);
				a5_216 += a3_174;
			}
			*((word32) a0_82 + 332) = (word16) (a5_216 - 0x42045D04);
			((word32) a0_82 + 328)->u0 = 0x00;
			word32 s4_818;
			word32 a0_810;
			word32 s8_819;
			word32 a3_813;
			word32 a5_815;
			word32 s1_809;
			word32 a4_814;
			word32 a2_812;
			word32 s3_817;
			word32 s2_816;
			word32 a1_811;
			ke_msg_send(a0_82, mstatus, out s1_809, out a0_810, out a1_811, out a2_812, out a3_813, out a4_814, out a5_815, out s2_816, out s3_817, out s4_818, out s8_819);
			return;
		}
		g_b42021717 = (byte) (a5_24 + 0x01);
	}
	scanu_confirm(ra, a4, mstatus);
}

// 230116FC: void scanu_dma_cb(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus)
void scanu_dma_cb(Eq_2 ra, Eq_2 a4, ptr32 mstatus)
{
	scanu_scan_next(ra, a4, mstatus);
}

// 23011700: void scanu_start(Register Eq_2 ra, Register (ptr32 Eq_48384) s0, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
// Called from:
//      scanu_join_req_handler
//      scanu_start_req_handler
void scanu_start(Eq_2 ra, struct Eq_48384 * s0, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	if ((word32) g_t42021716 == 0x00)
	{
		struct Eq_48421 * a5_12 = &g_ptr420215AC;
		do
		{
			a5_12->b004C = 0x00;
			a5_12->b004D = 0x80;
			++a5_12;
		} while (a5_12 != &g_t420216FC);
		g_w420215C0 = 0x00;
	}
	struct Eq_48395 * a5_31;
	word32 s1_155;
	word32 a0_156;
	word32 a1_157;
	word32 s2_158;
	word32 s3_159;
	word32 s4_160;
	Eq_2 a4_30;
	ke_state_set(0x04, 0x01, mstatus, out s1_155, out a0_156, out a1_157, out a4_30, out a5_31, out s2_158, out s3_159, out s4_160);
	word32 * a3_43 = a5_31->ptr0148;
	if (a3_43 != null)
	{
		a4_30 = (word32) a5_31->w014C;
		if (a4_30 <= 200)
		{
			*a3_43 = 0x42045DCC;
			g_t42045DD4 = (word16) a4_30;
			hal_dma_push(s0, 0x00, 0x42045DCC, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168);
			return;
		}
	}
	scanu_scan_next(ra, a4_30, mstatus);
}

