pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
word32 g_dw23011708 = 2266220038;
// 23011780: Register word32 txl_get_seq_ctrl()
// Called from:
//      sm_disconnect
//      sm_auth_send
//      sm_assoc_req_send
//      sm_handle_supplicant_result
word32 txl_get_seq_ctrl()
{
	uint32 a0_8 = (word32) g_w4201FF64 + 0x01 << 16;
	g_w4201FF64 = (word16) (a0_8 >> 16);
	return (word32) (word16) (a0_8 >> 16 << 4);
}

// 2301179E: Register Eq_2 sm_delete_resources(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s6Out, Register out ptr32 s10Out)
// Called from:
//      sm_disconnect
//      sm_connect_ind
Eq_2 sm_delete_resources(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0158, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s6Out, ptr32 & s10Out)
{
	Eq_2 a4_25;
	word32 s1_30;
	struct Eq_48501 * s0_52;
	Eq_2 s2_54;
	word32 s0_305;
	word32 a0_306;
	word32 a1_307;
	word32 a2_308;
	word32 a3_309;
	word32 a5_310;
	word32 s2_312;
	word32 a6_311;
	word32 s3_313;
	word32 s4_314;
	word32 s8_315;
	word32 s1_316;
	word32 a0_317;
	word32 a1_318;
	word32 a2_319;
	word32 a3_320;
	word32 a4_321;
	word32 a5_322;
	word32 a6_323;
	word32 s3_324;
	word32 s4_325;
	word32 s8_326;
	Eq_2 ra_131 = ke_msg_alloc(ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, a4, mstatus, dwArg08, out s0_305, out s1_30, out a0_306, out a1_307, out a2_308, out a3_309, out a4_25, out a5_310, out a6_311, out s2_312, out s3_313, out s4_314, out s8_315), s1_30 + 0x0411, 0x05, 0x02, a4_25, mstatus, dwArg08, out s0_52, out s1_316, out a0_317, out a1_318, out a2_319, out a3_320, out a4_321, out a5_322, out a6_323, out s2_54, out s3_324, out s4_325, out s8_326);
	*s2_54 = 0x00;
	*((word32) s2_54 + 1) = (byte) (word32) s0_52->b0057;
	Eq_2 a4_70;
	word32 a0_327;
	word32 a1_328;
	word32 a2_329;
	word32 a5_330;
	word32 s2_331;
	word32 s3_332;
	word32 s4_333;
	word32 s8_334;
	Eq_2 a3_110;
	Eq_2 s1_115;
	Eq_2 s0_114 = ke_msg_send(s2_54, mstatus, out s1_115, out a0_327, out a1_328, out a2_329, out a3_110, out a4_70, out a5_330, out s2_331, out s3_332, out s4_333, out s8_334);
	if ((word32) *((word32) s0_114 + 88) != 0x00)
	{
		Eq_2 a0_87;
		struct Eq_48616 * s0_95;
		word32 s1_335;
		word32 a1_336;
		word32 a2_337;
		word32 a3_338;
		word32 a4_339;
		word32 a5_340;
		word32 a6_341;
		word32 s2_342;
		word32 s3_343;
		word32 s4_344;
		word32 s8_345;
		ra_131 = ke_msg_alloc(ra_131, 0x1E, 0x00, 0x04, a4_70, mstatus, dwArg08, out s0_95, out s1_335, out a0_87, out a1_336, out a2_337, out a3_338, out a4_339, out a5_340, out a6_341, out s2_342, out s3_343, out s4_344, out s8_345);
		*((word32) a0_87 + 2) = 0x00;
		*((word32) a0_87 + 3) = (byte) (word32) s0_95->b0057;
		word32 a0_346;
		word32 a1_347;
		word32 a2_348;
		word32 a4_349;
		word32 a5_350;
		word32 s2_351;
		word32 s3_352;
		word32 s4_353;
		word32 s8_354;
		s0_114 = ke_msg_send(a0_87, mstatus, out s1_115, out a0_346, out a1_347, out a2_348, out a3_110, out a4_349, out a5_350, out s2_351, out s3_352, out s4_353, out s8_354);
	}
	Eq_2 a4_125 = (word32) *((word32) s0_114 + 96);
	struct Eq_48611 * a5_126 = (struct Eq_48611 *) 0x00FF;
	if (a4_125 != 0x00FF)
	{
		Eq_2 a0_134;
		struct Eq_48687 * s0_142;
		word32 s1_355;
		word32 a1_356;
		word32 a2_357;
		word32 a3_358;
		word32 a4_359;
		word32 a5_360;
		word32 a6_361;
		word32 s2_362;
		word32 s3_363;
		word32 s4_364;
		word32 s8_365;
		ra_131 = ke_msg_alloc(ra_131, 0x0C, 0x00, 0x01, a4_125, mstatus, dwArg08, out s0_142, out s1_355, out a0_134, out a1_356, out a2_357, out a3_358, out a4_359, out a5_360, out a6_361, out s2_362, out s3_363, out s4_364, out s8_365);
		*a0_134 = (byte) (word32) s0_142->b0060;
		word32 a0_366;
		word32 a1_367;
		word32 a2_368;
		word32 a4_369;
		word32 s2_370;
		word32 s3_371;
		word32 s4_372;
		word32 s8_373;
		ke_msg_send(a0_134, mstatus, out s1_115, out a0_366, out a1_367, out a2_368, out a3_110, out a4_369, out a5_126, out s2_370, out s3_371, out s4_372, out s8_373);
	}
	Eq_2 s0_171 = a5_126->t0040;
	if (a5_126 != null)
	{
		word32 a4_383;
		ra_131 = chan_ctxt_unlink(ra_131, s0_171, (word32) *((word32) s0_171 + 87), a3_110, mstatus, dwLoc08, dwArg18, dwArg28, dwArg88, dwArgF8, dwArg0158, out s1_115, out a4_383, out s6, out s10);
	}
	*s1_115 = 0x00;
	*((word32) s1_115 + 1) = (byte) (word32) *((word32) s0_171 + 87);
	ptr32 s1_217;
	ptr32 s2_218;
	word32 a0_374;
	word32 a1_375;
	word32 a2_376;
	word32 a3_377;
	word32 a4_378;
	word32 a5_379;
	word32 s3_380;
	word32 s4_381;
	word32 s8_382;
	*((word32) ke_msg_send(s1_115, mstatus, out s1_217, out a0_374, out a1_375, out a2_376, out a3_377, out a4_378, out a5_379, out s2_218, out s3_380, out s4_381, out s8_382) + 992) = 0x00;
	0x00 = (int8) dwArg38;
	s1Out = s1_217;
	s2Out = s2_218;
	s6Out = s6;
	s10Out = s10;
	return ra_131;
}

// 23011852: void sm_frame_tx_cfm_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ui32 a1, Register (ptr32 Eq_24474) a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg98, Stack Eq_2 dwArgCC)
void sm_frame_tx_cfm_handler(Eq_2 ra, Eq_2 s1, Eq_2 a0, ui32 a1, struct Eq_24474 * a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg98, Eq_2 dwArgCC)
{
	up32 a0_15;
	word32 a2_107;
	word32 a4_108;
	word32 s2_109;
	ke_state_get(0x06, dwArg18, out a0_15, out a2_107, out a4_108, out s2_109);
	if ((a1 & 0x40030000) != 0x00 && a0_15 <= ~0x05)
	{
		struct Eq_48827 * s0_39;
		word32 s1_40;
		word32 a0_110;
		word32 a1_111;
		word32 a3_112;
		word32 a4_113;
		word32 a5_114;
		word32 s2_115;
		word32 s3_116;
		word32 s4_117;
		word32 s5_118;
		word32 s6_119;
		word32 s7_120;
		word32 s9_121;
		word32 s10_122;
		word32 s11_123;
		txl_frame_push(ra, a0, 0x03, a3, (struct Eq_24700 *) 0x40030000, mstatus, dwArg18, s1, dwArg98, dwArgCC, out s0_39, out s1_40, out a0_110, out a1_111, out a3_112, out a4_113, out a5_114, out s2_115, out s3_116, out s4_117, out s5_118, out s6_119, out s7_120, out s9_121, out s10_122, out s11_123);
		s0_39->b02D6 = (byte) s1_40;
	}
}

