pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
word32 g_dw23011866 = 0x400307B7;
// 2301188C: void sm_init(Register ptr32 mstatus)
// Called from:
//      me_init
void sm_init(ptr32 mstatus)
{
	g_t42021740.u0 = 0x00;
	word32 s1_21;
	word32 a0_22;
	word32 a1_23;
	word32 a4_24;
	word32 a5_25;
	word32 s2_26;
	word32 s3_27;
	word32 s4_28;
	ke_state_set(0x06, 0x00, mstatus, out s1_21, out a0_22, out a1_23, out a4_24, out a5_25, out s2_26, out s3_27, out s4_28);
}

// 2301189C: Register Eq_2 sm_get_bss_params(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 word32) a0, Register (ptr32 word32) a1, Register Eq_2 a3, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack word32 dwArg0198, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      scanu_start_cfm_handler
//      sm_connect_req_handler
//      me_set_active_cfm_handler
Eq_2 sm_get_bss_params(Eq_2 ra, Eq_2 s1, word32 * a0, word32 * a1, Eq_2 a3, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArgE8, word32 dwArg0198, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 s0_180 = g_t42021740;
	*a0 = 0x00;
	*a1 = 0x00;
	word32 s1_416;
	word32 s8_429;
	word32 s10_431;
	word32 t4_433;
	word32 s11_432;
	word32 s9_430;
	word32 s2_423;
	word32 s4_425;
	word32 s6_427;
	word32 s7_428;
	word32 s5_426;
	word32 s3_424;
	word32 a0_417;
	word32 a2_419;
	word32 a5_421;
	word32 a7_422;
	word32 a4_420;
	word32 a1_418;
	Eq_2 a3_44;
	Eq_2 ra_47 = printf(ra, &g_t230AC7DC, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_416, out a0_417, out a1_418, out a2_419, out a3_44, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432, out t4_433);
	word32 s8_63 = 0x230AC000;
	do
	{
		word32 s1_85;
		word32 s7_93;
		word32 s11_447;
		word32 t4_448;
		word32 s3_441;
		word32 s5_443;
		word32 s9_445;
		word32 s10_446;
		word32 s6_444;
		word32 s4_442;
		word32 a1_435;
		word32 a4_437;
		word32 a7_439;
		word32 s2_440;
		word32 a5_438;
		word32 a2_436;
		word32 a0_434;
		ra_47 = printf(ra_47, s8_63 + 2044, a3_44, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_85, out a0_434, out a1_435, out a2_436, out a3_44, out a4_437, out a5_438, out a7_439, out s2_440, out s3_441, out s4_442, out s5_443, out s6_444, out s7_93, out s8_63, out s9_445, out s10_446, out s11_447, out t4_448);
	} while (s1_85 != s7_93);
	Eq_2 a3_140;
	Eq_2 ra_121;
	uint16 ** s4_127;
	uint16 * a5_142;
	ui32 a5_100 = (word32) *((word32) s0_180 + 0x0022);
	if ((a5_100 & 1) == 0x00 && (a5_100 != 0x00 || ((word32) (*((word32) s0_180 + 35)) != 0x00 || ((word32) (*((word32) s0_180 + 36)) != 0x00 || ((word32) (*((word32) s0_180 + 37)) != 0x00 || ((word32) (*((word32) s0_180 + 38)) != 0x00 || (word32) (*((word32) s0_180 + 39)) != 0x00))))))
	{
		struct Eq_46074 * s3_126;
		struct Eq_46074 ** s6_129;
		word32 s11_495;
		word32 t4_496;
		word32 s8_492;
		word32 s10_494;
		word32 s9_493;
		word32 s2_489;
		word32 s7_491;
		word32 s5_490;
		word32 a4_486;
		word32 a7_488;
		word32 a5_487;
		word32 a1_483;
		word32 a3_485;
		word32 a2_484;
		word32 a0_482;
		word32 s1_481;
		ra_121 = printf(ra_47, &g_t230AC840, a3_44, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_481, out a0_482, out a1_483, out a2_484, out a3_485, out a4_486, out a5_487, out a7_488, out s2_489, out s3_126, out s4_127, out s5_490, out s6_129, out s7_491, out s8_492, out s9_493, out s10_494, out s11_495, out t4_496);
		*s6_129 = (struct Eq_46074 **) s3_126;
		if (scanu_search_by_bssid(s3_126, out a3_140, out a5_142) == 0x00)
		{
l230119A4:
			if ((word32) *((word32) s0_180 + 40) != 0x0FFFFFFF)
				*s4_127 = (word32) s0_180 + 40;
			goto l23011966;
		}
	}
	else
	{
		word32 s10_465;
		word32 t4_467;
		word32 s11_466;
		word32 s4_459;
		word32 s6_461;
		word32 s8_463;
		word32 s9_464;
		word32 s7_462;
		word32 s5_460;
		word32 a3_453;
		word32 a5_455;
		word32 s2_457;
		word32 s3_458;
		word32 a7_456;
		word32 a4_454;
		word32 s1_449;
		word32 a1_451;
		word32 a2_452;
		word32 a0_450;
		Eq_2 ra_160 = printf(ra_47, &g_t230AC810, a3_44, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_449, out a0_450, out a1_451, out a2_452, out a3_453, out a4_454, out a5_455, out a7_456, out s2_457, out s3_458, out s4_459, out s5_460, out s6_461, out s7_462, out s8_463, out s9_464, out s10_465, out s11_466, out t4_467);
		Eq_2 a3_192;
		s0_180 = scanu_search_by_ssid(s0_180, fp + -52, dwArgE8, out a3_192);
		word32 s1_207;
		struct Eq_49067 * s5_213;
		word32 * s6_214;
		word32 t4_480;
		word32 s9_477;
		word32 s11_479;
		word32 s10_478;
		word32 a4_471;
		word32 s2_473;
		word32 s7_475;
		word32 s8_476;
		word32 s3_474;
		word32 a7_472;
		word32 a1_469;
		word32 a2_470;
		word32 a0_468;
		ra_121 = printf(ra_160, &g_t230AC824, a3_192, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_207, out a0_468, out a1_469, out a2_470, out a3_140, out a4_471, out a5_142, out a7_472, out s2_473, out s3_474, out s4_127, out s5_213, out s6_214, out s7_475, out s8_476, out s9_477, out s10_478, out s11_479, out t4_480);
		if (s1_207 == 0x00)
			goto l230119A4;
		if (a5_142 >= null)
		{
			*s6_214 = s1_207;
			s5_213->ptr0014 = a5_142;
		}
	}
	*s4_127 = (uint16 **) a5_142;
l23011966:
	ptr32 a0_249;
	ptr32 a1_252;
	ptr32 a4_255;
	ptr32 s5_264;
	ptr32 s6_265;
	word32 t4_510;
	word32 s11_509;
	word32 s10_508;
	word32 s9_507;
	word32 s8_506;
	word32 s7_505;
	word32 s4_504;
	word32 s3_503;
	word32 s2_502;
	word32 a7_501;
	word32 a3_499;
	word32 a5_500;
	word32 s1_497;
	word32 a2_498;
	Eq_2 ra_257 = printf(ra_121, &g_t230AC854, a3_140, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_497, out a0_249, out a1_252, out a2_498, out a3_499, out a4_255, out a5_500, out a7_501, out s2_502, out s3_503, out s4_504, out s5_264, out s6_265, out s7_505, out s8_506, out s9_507, out s10_508, out s11_509, out t4_510);
	0x00 = dwArg0198;
	a0Out = a0_249;
	a1Out = a1_252;
	a4Out = a4_255;
	s5Out = s5_264;
	s6Out = s6_265;
	return ra_257;
}

// 230119BA: Register word32 sm_scan_bss(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg0128)
// Called from:
//      sm_connect_req_handler
word32 sm_scan_bss(Eq_2 ra, Eq_2 a4, ptr32 mstatus, word32 dwArg0128)
{
	Eq_2 a0_30;
	Eq_2 s1_39;
	Eq_2 s2_40;
	Eq_2 s3_41;
	word32 s8_316;
	word32 a6_314;
	word32 s4_315;
	word32 s0_308;
	word32 a5_313;
	word32 a2_310;
	word32 a3_311;
	word32 a4_312;
	word32 a1_309;
	ke_msg_alloc(ra, 0x01000000, 0x04, 340, a4, mstatus, dwLoc18, out s0_308, out s1_39, out a0_30, out a1_309, out a2_310, out a3_311, out a4_312, out a5_313, out a6_314, out s2_40, out s3_41, out s4_315, out s8_316);
	word32 a5_48 = (word32) *((word32) s3_41 + 61);
	((word32) a0_30 + 328)->u0 = 0x00;
	*((word32) a0_30 + 334) = (byte) a5_48;
	*((word32) a0_30 + 332) = 0x00;
	word32 a1_317;
	word32 a2_318;
	word32 a3_319;
	word32 a4_320;
	word32 a5_321;
	word32 a6_322;
	word32 a7_323;
	memcpy((word32) a0_30 + 252, s3_41, 0x0022, out a1_317, out a2_318, out a3_319, out a4_320, out a5_321, out a6_322, out a7_323);
	*((word32) a0_30 + 336) = 0x01;
	Eq_2 a1_73 = s2_40;
	if (s2_40 == 0x00)
		a1_73.u0 = 0x230CB890;
	word32 a1_324;
	word32 a2_325;
	word32 a3_326;
	word32 a4_327;
	word32 a5_328;
	word32 a6_329;
	word32 a7_330;
	memcpy((word32) a0_30 + 320, a1_73, 0x06, out a1_324, out a2_325, out a3_326, out a4_327, out a5_328, out a6_329, out a7_330);
	if (s1_39 != 0x00)
	{
		word32 a1_331;
		word32 a2_332;
		word32 a3_333;
		word32 a4_334;
		word32 a5_335;
		word32 a6_336;
		word32 a7_337;
		memcpy(a0_30, s1_39, 0x06, out a1_331, out a2_332, out a3_333, out a4_334, out a5_335, out a6_336, out a7_337);
		*((word32) a0_30 + 335) = 0x01;
	}
	else
	{
		*((word32) a0_30 + 335) = 0x00;
		byte * s2_104 = fp + -44;
		int32 * s3_106 = fp + -40;
		do
		{
			int32 s1_109;
			for (s1_109 = 0x06; s1_109 < (word32) (*s2_104); ++s1_109)
			{
				Eq_2 a1_118 = s1_109 + 0x00 + *s3_106;
				if (((word32) *((word32) a1_118 + 3) & 0x02) == 0x00)
				{
					word32 a0_122 = (word32) *((word32) a0_30 + 335);
					*((word32) a0_30 + 335) = (byte) (a0_122 + 1);
					word32 a1_356;
					word32 a2_357;
					word32 a3_358;
					word32 a4_359;
					word32 a5_360;
					word32 a6_361;
					word32 a7_362;
					memcpy((word32) a0_30 + (a0_122 + 0x06), a1_118, 0x06, out a1_356, out a2_357, out a3_358, out a4_359, out a5_360, out a6_361, out a7_362);
				}
			}
			++s2_104;
			++s3_106;
		} while (s2_104 != fp + -42);
	}
	word32 s1_345;
	word32 a0_346;
	word32 a1_347;
	word32 a2_348;
	word32 a3_349;
	word32 a4_350;
	word32 a5_351;
	word32 s2_352;
	word32 s3_353;
	word32 s4_354;
	word32 s8_355;
	ke_msg_send(a0_30, mstatus, out s1_345, out a0_346, out a1_347, out a2_348, out a3_349, out a4_350, out a5_351, out s2_352, out s3_353, out s4_354, out s8_355);
	0x00 = dwArg0128;
	word32 s4_211;
	word32 s1_338;
	word32 a0_339;
	word32 a1_340;
	word32 a4_341;
	word32 a5_342;
	word32 s2_343;
	word32 s3_344;
	ke_state_set(0x06, 0x01, mstatus, out s1_338, out a0_339, out a1_340, out a4_341, out a5_342, out s2_343, out s3_344, out s4_211);
	return s4_211;
}

// 23011AC6: Register word32 sm_join_bss(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      scanu_start_cfm_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      me_set_active_cfm_handler
word32 sm_join_bss(Eq_2 ra, Eq_2 a0, Eq_2 a4, ptr32 mstatus)
{
	Eq_2 a0_33;
	struct Eq_49500 * s1_42;
	word32 s2_43;
	Eq_2 s3_44;
	Eq_2 s4_45;
	word32 a1_184;
	word32 a2_185;
	word32 a3_186;
	word32 a4_187;
	word32 a5_188;
	word32 a6_189;
	word32 s8_190;
	word32 s0_183;
	ke_msg_alloc(ra, 0x01000002, 0x04, 340, a4, mstatus, dwLoc08, out s0_183, out s1_42, out a0_33, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188, out a6_189, out s2_43, out s3_44, out s4_45, out s8_190);
	word32 a1_191;
	word32 a2_192;
	word32 a3_193;
	word32 a4_194;
	word32 a5_195;
	word32 a6_196;
	word32 a7_197;
	memcpy(a0_33, s4_45, 0x06, out a1_191, out a2_192, out a3_193, out a4_194, out a5_195, out a6_196, out a7_197);
	*((word32) a0_33 + 335) = 0x01;
	word32 a1_198;
	word32 a2_199;
	word32 a3_200;
	word32 a4_201;
	word32 a5_202;
	word32 a6_203;
	word32 a7_204;
	memcpy((word32) a0_33 + 252, s3_44, 0x0022, out a1_198, out a2_199, out a3_200, out a4_201, out a5_202, out a6_203, out a7_204);
	*((word32) a0_33 + 336) = 0x01;
	*((word32) a0_33 + 332) = 0x00;
	((word32) a0_33 + 328)->u0 = 0x00;
	*((word32) a0_33 + 334) = (byte) (word32) *((word32) s3_44 + 61);
	word32 a1_205;
	word32 a2_206;
	word32 a3_207;
	word32 a4_208;
	word32 a5_209;
	word32 a6_210;
	word32 a7_211;
	memcpy((word32) a0_33 + 320, a0, 0x06, out a1_205, out a2_206, out a3_207, out a4_208, out a5_209, out a6_210, out a7_211);
	if (s2_43 != 0x00)
		*((word32) a0_33 + 3) = (byte) ((word32) *((word32) a0_33 + 3) | 1);
	s1_42->b0750 = (byte) s2_43;
	word32 s1_212;
	word32 a0_213;
	word32 a1_214;
	word32 a2_215;
	word32 a3_216;
	word32 a4_217;
	word32 a5_218;
	word32 s2_219;
	word32 s3_220;
	word32 s4_221;
	word32 s8_222;
	ke_msg_send(a0_33, mstatus, out s1_212, out a0_213, out a1_214, out a2_215, out a3_216, out a4_217, out a5_218, out s2_219, out s3_220, out s4_221, out s8_222);
	word32 s4_151;
	word32 s1_223;
	word32 a0_224;
	word32 a1_225;
	word32 a4_226;
	word32 a5_227;
	word32 s2_228;
	word32 s3_229;
	ke_state_set(0x06, 0x02, mstatus, out s1_223, out a0_224, out a1_225, out a4_226, out a5_227, out s2_228, out s3_229, out s4_151);
	return s4_151;
}

// 23011B68: Register Eq_2 sm_add_chan_ctx(Register (ptr32 byte) a0, Stack Eq_2 dwArg88, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      scanu_join_cfm_handler
Eq_2 sm_add_chan_ctx(byte * a0, Eq_2 dwArg88, ptr32 & a0Out, ptr32 & a4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_32;
	ptr32 a4_34;
	ptr32 s5_42;
	ptr32 s6_43;
	word32 s1_61;
	word32 s2_62;
	word32 s3_63;
	Eq_2 s0_37 = chan_ctxt_add(fp + ~0x1B, a0, 0x42020318, dwArg88, out s1_61, out a0_32, out a4_34, out s2_62, out s3_63, out s5_42, out s6_43);
	a0Out = a0_32;
	a4Out = a4_34;
	s5Out = s5_42;
	s6Out = s6_43;
	return s0_37;
}

// 23011BCA: void sm_send_next_bss_param(Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
// Called from:
//      sm_set_bss_param
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
void sm_send_next_bss_param(Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	word32 a5_43;
	Eq_2 a0_12 = co_list_pop_front(a4, a5, out a5_43);
	if (a0_12 != 0x00)
	{
		word32 s1_44;
		word32 a0_45;
		word32 a1_46;
		word32 a2_47;
		word32 a3_48;
		word32 a4_49;
		word32 a5_50;
		word32 s2_51;
		word32 s3_52;
		word32 s4_53;
		word32 s8_54;
		ke_msg_send((word32) a0_12 + 0x0C, mstatus, out s1_44, out a0_45, out a1_46, out a2_47, out a3_48, out a4_49, out a5_50, out s2_51, out s3_52, out s4_53, out s8_54);
	}
	else
		assert_err();
}

