pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23011C06: void sm_set_bss_param(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
// Called from:
//      mm_sta_add_cfm_handler
void sm_set_bss_param(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	Eq_2 a4_38;
	Eq_2 a4_61;
	struct Eq_49743 * a0_80;
	Eq_2 a4_84;
	Eq_2 a4_107;
	word32 s1_112;
	struct Eq_49747 * s0_134;
	struct Eq_49748 * s2_136;
	struct Eq_49749 * s3_137;
	Eq_2 s8_139;
	word32 a5_415;
	word32 s3_418;
	word32 s2_417;
	word32 s2_405;
	word32 a6_416;
	word32 a2_413;
	word32 a3_414;
	word32 a0_411;
	word32 a1_412;
	word32 s0_409;
	word32 s1_410;
	word32 s4_407;
	word32 s8_408;
	word32 s0_397;
	word32 s1_398;
	word32 a0_399;
	word32 a1_400;
	word32 a2_401;
	word32 a3_402;
	word32 a6_404;
	word32 a5_403;
	word32 s3_406;
	word32 s4_419;
	word32 s8_420;
	word32 s0_421;
	word32 s1_422;
	word32 a1_423;
	word32 a2_424;
	word32 a3_425;
	word32 a5_426;
	word32 a6_427;
	word32 s2_428;
	word32 s3_429;
	word32 s4_430;
	word32 s8_431;
	word32 s0_432;
	word32 a0_433;
	word32 a1_434;
	word32 a2_435;
	word32 a3_436;
	word32 a5_437;
	word32 a6_438;
	word32 s2_439;
	word32 s3_440;
	word32 s4_441;
	word32 s8_442;
	word32 s1_443;
	word32 a0_444;
	word32 a1_445;
	word32 a2_446;
	word32 a3_447;
	word32 a4_448;
	word32 a5_449;
	word32 a6_450;
	word32 s4_451;
	Eq_2 ra_133 = ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, a4, mstatus, dwLoc18, out s0_397, out s1_398, out a0_399, out a1_400, out a2_401, out a3_402, out a4_38, out a5_403, out a6_404, out s2_405, out s3_406, out s4_407, out s8_408), 0x18, 0x00, 0x07, a4_38, mstatus, dwLoc18, out s0_409, out s1_410, out a0_411, out a1_412, out a2_413, out a3_414, out a4_61, out a5_415, out a6_416, out s2_417, out s3_418, out s4_419, out s8_420), 22, 0x00, 0x08, a4_61, mstatus, dwLoc18, out s0_421, out s1_422, out a0_80, out a1_423, out a2_424, out a3_425, out a4_84, out a5_426, out a6_427, out s2_428, out s3_429, out s4_430, out s8_431), 0x14, 0x00, 0x04, a4_84, mstatus, dwLoc18, out s0_432, out s1_112, out a0_433, out a1_434, out a2_435, out a3_436, out a4_107, out a5_437, out a6_438, out s2_439, out s3_440, out s4_441, out s8_442), s1_112 + 0x0411, 0x05, 0x02, a4_107, mstatus, dwLoc18, out s0_134, out s1_443, out a0_444, out a1_445, out a2_446, out a3_447, out a4_448, out a5_449, out a6_450, out s2_136, out s3_137, out s4_451, out s8_139);
	co_list_init(&g_t42021748);
	s0_134->b0000 = 0x01;
	Eq_2 a5_149 = (word32) s2_136->b003D;
	s0_134->b0001 = (byte) a5_149;
	co_list_push_back((char *) s0_134 - 0x0C, a5_149);
	word32 a1_452;
	word32 a2_453;
	word32 a3_454;
	word32 a4_455;
	word32 a5_456;
	word32 a6_457;
	word32 a7_458;
	memcpy(s8_139, (char *) s3_137 + 0x420208C8, 0x06, out a1_452, out a2_453, out a3_454, out a4_455, out a5_456, out a6_457, out a7_458);
	Eq_2 a5_177 = (word32) s2_136->b003D;
	*((word32) s8_139 + 6) = (byte) a5_177;
	co_list_push_back((word32) s8_139 - 0x0C, a5_177);
	a0_80->b0005 = (byte) (word32) s3_137->ptr420208F4->b0002;
	word32 a0_191;
	struct Eq_49963 * s2_199;
	struct Eq_49964 * s5_202;
	word32 s6_203;
	struct Eq_49966 * s7_204;
	word32 s1_459;
	word32 s3_460;
	word32 s4_461;
	word32 s8_462;
	Eq_2 a4_194;
	Eq_2 s0_197 = me_legacy_rate_bitfield_build((char *) &s3_137->ptr420208F4 + 0x0C, 0x01, dwArgF8, out s1_459, out a0_191, out a4_194, out s2_199, out s3_460, out s4_461, out s5_202, out s6_203, out s7_204, out s8_462);
	s5_202->dw0000 = a0_191;
	Eq_2 a5_209 = (word32) s2_199->b003D;
	s5_202->b0004 = (byte) a5_209;
	co_list_push_back((char *) s5_202 - 0x0C, a5_209);
	s7_204->w0000 = (word16) (word32) *((word32) s0_197 + 940);
	Eq_2 a5_220 = (word32) s2_199->b003D;
	s7_204->b0002 = (byte) a5_220;
	co_list_push_back((char *) s7_204 - 0x0C, a5_220);
	do
	{
		struct Eq_50027 * a0_240;
		struct Eq_50059 * s0_248;
		struct Eq_50045 * s2_250;
		ptr32 s3_251;
		struct Eq_50060 * s4_252;
		struct Eq_50038 * s8_253;
		word32 s1_463;
		word32 a1_464;
		word32 a2_465;
		word32 a3_466;
		word32 a4_467;
		word32 a5_468;
		word32 a6_469;
		ra_133 = ke_msg_alloc(ra_133, 0x1A, 0x00, 0x08, a4_194, mstatus, dwLoc18, out s0_248, out s1_463, out a0_240, out a1_464, out a2_465, out a3_466, out a4_467, out a5_468, out a6_469, out s2_250, out s3_251, out s4_252, out s8_253);
		struct Eq_50027 ** a5_258 = s0_248->ptr03C4;
		a0_240->b0005 = (byte) s3_251;
		*a5_258 = (struct Eq_50027 **) a0_240;
		a0_240->b0006 = (byte) (word32) s2_250->b003D;
		a4_194 = g_t4201E9FC;
		Eq_2 a5_265 = 0x00;
		if (a4_194 != 0x00)
		{
			a4_194 = (int32) s8_253->b03C0;
			if (a4_194 < 0x00)
			{
				a4_194 = (word32) s2_250->b003C;
				a5_265 = (word32) (((word32) (s3_251 + (s6_203 + -0x0774)) & a4_194) != 0x00);
			}
		}
		a0_240->b0004 = (byte) a5_265;
		co_list_push_back((char *) a0_240 - 0x0C, a5_265);
	} while (s3_251 != ~0x02);
	s4_252->b0000 = 0x01;
	Eq_2 a5_292 = (word32) s2_250->b003D;
	s4_252->b0001 = (byte) a5_292;
	co_list_push_back((char *) s4_252 - 0x0C, a5_292);
	sm_send_next_bss_param(a4_194, a5_292, mstatus);
	0x00 = (int8) dwArg0128;
	word32 s1_470;
	word32 a0_471;
	word32 a1_472;
	word32 a4_473;
	word32 a5_474;
	word32 s2_475;
	word32 s3_476;
	word32 s4_477;
	ke_state_set(0x06, 0x04, mstatus, out s1_470, out a0_471, out a1_472, out a4_473, out a5_474, out s2_475, out s3_476, out s4_477);
}

// 23011DC4: Register Eq_2 sm_disconnect_process(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0148, Register out ptr32 a4Out, Register out (ptr32 byte) s4Out)
// Called from:
//      sm_deauth_cfm
//      sm_disconnect
//      mm_connection_loss_ind_handler
//      sm_connect_req_handler
//      rxu_mgt_ind_handler
Eq_2 sm_disconnect_process(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgE8, Eq_2 dwArg0148, ptr32 & a4Out, byte & s4Out)
{
	Eq_2 a0_23;
	Eq_2 a4_27;
	struct Eq_50165 * s1_51;
	word32 s2_52;
	word32 a2_129;
	word32 a3_130;
	word32 a5_131;
	word32 a6_132;
	word32 a1_128;
	word32 s1_127;
	word32 s0_126;
	word32 s2_133;
	word32 s3_134;
	word32 s4_135;
	word32 s8_136;
	word32 s6_137;
	word32 s10_138;
	Eq_2 ra_50 = sm_delete_resources(ke_msg_alloc(ra, 0x01FFF805, 0x0D, 0x04, a4, mstatus, dwArg08, out s0_126, out s1_127, out a0_23, out a1_128, out a2_129, out a3_130, out a4_27, out a5_131, out a6_132, out s2_133, out s3_134, out s4_135, out s8_136), a4_27, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg78, dwArgE8, dwArg0148, out s1_51, out s2_52, out s6_137, out s10_138);
	*a0_23 = (word16) s2_52;
	*((word32) a0_23 + 2) = (byte) (word32) s1_51->b0057;
	if ((word32) g_b42021751 != 0x00)
		*((word32) a0_23 + 3) = 0x01;
	0x00 = (int8) dwArg38;
	ptr32 a4_85;
	byte * s4_92;
	word32 s1_139;
	word32 a0_140;
	word32 a1_141;
	word32 a2_142;
	word32 a3_143;
	word32 a5_144;
	word32 s2_145;
	word32 s3_146;
	word32 s8_147;
	ke_msg_send(a0_23, mstatus, out s1_139, out a0_140, out a1_141, out a2_142, out a3_143, out a4_85, out a5_144, out s2_145, out s3_146, out s4_92, out s8_147);
	a4Out = a4_85;
	s4Out = s4_92;
	return ra_50;
}

// 23011E16: void sm_deauth_cfm(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0148)
void sm_deauth_cfm(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgE8, Eq_2 dwArg0148)
{
	word32 a4_39;
	word32 s4_40;
	sm_disconnect_process(ra, a4, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg78, dwArgE8, dwArg0148, out a4_39, out s4_40);
}

// 23011E1C: Register Eq_2 sm_disconnect(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_50272) a0, Register (ptr32 Eq_44272) a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack word32 dwArgA8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 a4Out)
// Called from:
//      sm_disconnect_req_handler
Eq_2 sm_disconnect(Eq_2 ra, Eq_2 s1, struct Eq_50272 * a0, struct Eq_42953 * a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArg98, word32 dwArgA8, Eq_2 dwArgCC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & a4Out)
{
	if ((word32) a0->b420205A6 == 0x00 && (word32) a0->b420205A8 != 0x00)
	{
		word32 s6_33 = (word32) a0->b420205B0;
		Eq_2 a4_37;
		word32 s1_361;
		word32 a0_362;
		word32 a1_363;
		word32 a5_364;
		word32 s2_365;
		word32 s3_366;
		word32 s4_367;
		Eq_2 a5_48 = *((word32) ke_state_set(0x06, 0x08, mstatus, out s1_361, out a0_362, out a1_363, out a4_37, out a5_364, out s2_365, out s3_366, out s4_367) + 932);
		Eq_2 s0_58;
		word32 s4_60;
		struct Eq_50335 * a0_64;
		word32 s1_368;
		word32 a1_369;
		word32 a3_370;
		word32 a5_371;
		word32 s2_372;
		word32 s3_373;
		word32 s5_374;
		word32 s6_375;
		word32 s7_376;
		word32 s8_377;
		word32 s9_378;
		word32 s10_379;
		word32 s11_380;
		txl_frame_get(ra, (word32) ((word32) *((word32) a5_48 + 2) != 0x00), (struct Eq_25902 *) 0x0100, a4_37, a5_48, fflags, frm, mstatus, dwArgE8, dwArg0108, dwArg0128, out s0_58, out s1_368, out a0_64, out a1_369, out a3_370, out a4, out a5_371, out s2_372, out s3_373, out s4_60, out s5_374, out s6_375, out s7_376, out s8_377, out s9_378, out s10_379, out s11_380);
		if (a0_64 == null)
		{
l23011F24:
			0x00 = dwArgA8;
			Eq_2 a4_228;
			word32 s4_416;
			Eq_2 ra_231 = sm_disconnect_process(ra, a4, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg78, dwArgE8, dwArg0148, out a4_228, out s4_416);
			a4Out = a4_228;
			return ra_231;
		}
		word32 a4_381;
		tpc_update_frame_tx_power(ra, s0_58, fflags, frm, out a4_381);
		struct Eq_50382 * s2_90 = a0_64->ptr0068;
		s2_90->b014C = 0xC0;
		s2_90->b014D = 0x00;
		s2_90->b014E = 0x00;
		s2_90->b014F = 0x00;
		word32 a1_382;
		word32 a2_383;
		word32 a3_384;
		word32 a4_385;
		word32 a5_386;
		word32 a6_387;
		word32 a7_388;
		memcpy(&s2_90->b014F + 1, s6_33 + 0x4201EC2E, 0x06, out a1_382, out a2_383, out a3_384, out a4_385, out a5_386, out a6_387, out a7_388);
		word32 a1_389;
		word32 a2_390;
		word32 a3_391;
		word32 a4_392;
		word32 a5_393;
		word32 a6_394;
		word32 a7_395;
		memcpy(&s2_90->b014F + 7, (word32) s0_58 + 80, 0x06, out a1_389, out a2_390, out a3_391, out a4_392, out a5_393, out a6_394, out a7_395);
		struct Eq_24474 * a3_142;
		word32 a1_396;
		word32 a2_397;
		word32 a4_398;
		word32 a5_399;
		word32 a6_400;
		word32 a7_401;
		memcpy(&s2_90->b014F + 0x0D, s6_33 + 0x4201EC2E, 0x06, out a1_396, out a2_397, out a3_142, out a4_398, out a5_399, out a6_400, out a7_401);
		uint32 a0_150 = txl_get_seq_ctrl();
		s2_90->b0162 = (byte) a0_150;
		s2_90->b0163 = (byte) (a0_150 >> 8);
		a0_64->dw02CC = 587275798;
		a0_64->t02D0 = s0_58;
		a0_64->b002F = (byte) s4_60;
		struct Eq_50489 * a5_160 = (word32) *((word32) s0_58 + 96);
		a0_64->b0030 = (byte) a5_160;
		struct Eq_50498 * a0_164 = me_build_deauthenticate(&s2_90->b0163 + 1, a1);
		word32 a4_168 = a5_160->dw0014;
		a0_164->dw0038 = a4_168;
		word32 a5_170 = a5_160 + 0x17 + a0_164;
		a5_170->dw0018 = a4_168;
		word32 a0_175;
		word32 s0_402;
		word32 s1_403;
		word32 a1_404;
		word32 a3_405;
		word32 a5_406;
		word32 s2_407;
		word32 s3_408;
		word32 s4_409;
		word32 s5_410;
		word32 s6_411;
		word32 s7_412;
		word32 s9_413;
		word32 s10_414;
		word32 s11_415;
		ra = txl_frame_push(ra, s0_58, 0x03, a3_142, a5_170, mstatus, dwArg18, s1, dwArg98, dwArgCC, out s0_402, out s1_403, out a0_175, out a1_404, out a3_405, out a4, out a5_406, out s2_407, out s3_408, out s4_409, out s5_410, out s6_411, out s7_412, out s9_413, out s10_414, out s11_415);
		if (a0_175 == 0x00)
			goto l23011F24;
	}
	0x00 = dwArgA8;
	a4Out = a4;
	return ra;
}

// 23011F54: Register Eq_2 sm_connect_ind(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0128, Register out ptr32 a4Out, Register out (ptr32 Eq_50577) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s10Out)
// Called from:
//      sm_supplicant_deauth_cfm
//      sm_auth_send
//      sm_assoc_req_send
//      sm_auth_handler
//      sm_assoc_rsp_handler
//      sm_handle_supplicant_result
//      sm_rsp_timeout_ind_handler
//      scanu_start_cfm_handler
//      scanu_join_cfm_handler
//      rxu_mgt_ind_handler
//      mm_set_vif_state_cfm_handler
//      mm_sta_add_cfm_handler
Eq_2 sm_connect_ind(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArg0128, ptr32 & a4Out, struct Eq_50577 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s10Out)
{
	struct Eq_50581 * s3_27 = (word32) *((word32) g_t42021740 + 61);
	*((word32) s0 + 9) = (byte) s3_27;
	Eq_2 a3_46;
	word32 a4_434;
	word32 a1_432;
	word32 a2_433;
	word32 a6_436;
	word32 a5_435;
	word32 a7_437;
	memcpy((word32) s0 + 2, &s3_27->b420205B0 + 792, 0x06, out a1_432, out a2_433, out a3_46, out a4_434, out a5_435, out a6_436, out a7_437);
	*((word32) s0 + 0x0A) = (byte) (word32) s3_27->b420205B0;
	struct Eq_50621 * a5_61;
	word32 s3_73;
	word32 s4_74;
	word32 s9_449;
	word32 s11_450;
	word32 t4_451;
	word32 a1_440;
	word32 s1_438;
	word32 a0_439;
	word32 a3_442;
	word32 a2_441;
	word32 a7_444;
	word32 a4_443;
	word32 s2_445;
	word32 s5_446;
	word32 s8_448;
	word32 s7_447;
	word32 s6_243;
	ptr32 s10_240;
	Eq_2 ra_230 = printf(ra, &g_t230AC734, a3_46, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_438, out a0_439, out a1_440, out a2_441, out a3_442, out a4_443, out a5_61, out a7_444, out s2_445, out s3_73, out s4_74, out s5_446, out s6_243, out s7_447, out s8_448, out s9_449, out s10_240, out s11_450, out t4_451);
	*((word32) s0 + 11) = 0x00;
	if (a5_61 != null)
	{
		struct Eq_50690 * a5_90 = (word32) a5_61->b0004;
		*((word32) s0 + 822) = (byte) a5_90;
		struct Eq_50699 * a5_93 = (word32) a5_90->w0006;
		((word32) s0 + 0x0338)->u2 = (word16) a5_93;
		struct Eq_50678 * a5_96 = (word32) a5_93->w0008;
		*((word32) s0 + 828) = a5_96;
		Eq_20883 a5_99 = (word32) a5_96->w000A;
		*((word32) s0 + 832) = a5_99;
		*((word32) s0 + 0x033A) = (byte) (word32) *((word32) a5_99 + 5);
	}
	else
	{
		*((word32) s0 + 822) = 0x00;
		((word32) s0 + 0x0338)->u2 = 0x00;
		*((word32) s0 + 828) = null;
		*((word32) s0 + 832) = 0x00;
		*((word32) s0 + 0x033A) = 0x00;
	}
	struct Eq_50744 * a5_109 = s3_73 + 0x05D8 + s4_74;
	int32 a4_111 = a5_109->dw03E0;
	*((word32) s0 + 0x0C) = (byte) (a4_111 & 0x01);
	Eq_2 a3_107 = 0x00;
	if ((a4_111 & 0x01) != 0x00)
		a3_107 = (word32) a5_109->b03C1;
	int32 * s2_232;
	*((word32) s0 + 0x0D) = (byte) a3_107;
	*((word32) s0 + 8) = 0x00;
	if (s6_243 == 0x00)
	{
		word32 s1_476;
		word32 a0_477;
		word32 a1_478;
		word32 a4_479;
		word32 a5_480;
		word32 s3_481;
		word32 s4_482;
		ke_state_set(0x06, 0x00, mstatus, out s1_476, out a0_477, out a1_478, out a4_479, out a5_480, out s2_232, out s3_481, out s4_482);
	}
	else
	{
		word32 s3_458;
		word32 s4_459;
		word32 a4_455;
		word32 a5_456;
		word32 s2_457;
		word32 s1_452;
		word32 a0_453;
		word32 a1_454;
		ke_state_set(0x06, 0x08, mstatus, out s1_452, out a0_453, out a1_454, out a4_455, out a5_456, out s2_457, out s3_458, out s4_459);
		word32 s5_469;
		word32 s4_468;
		word32 s8_471;
		word32 s6_470;
		word32 s9_472;
		word32 s10_473;
		Eq_2 a3_157;
		int32 s7_169;
		word32 s2_466;
		word32 s3_467;
		word32 a5_464;
		word32 a7_465;
		word32 a1_462;
		word32 a2_463;
		word32 a0_461;
		word32 s1_460;
		word32 s11_474;
		word32 t4_475;
		Eq_2 a4_158;
		Eq_2 ra_160 = printf(ra_230, &g_t230AC754, a3_107, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_460, out a0_461, out a1_462, out a2_463, out a3_157, out a4_158, out a5_464, out a7_465, out s2_466, out s3_467, out s4_468, out s5_469, out s6_470, out s7_169, out s8_471, out s9_472, out s10_473, out s11_474, out t4_475);
		if (s7_169 >= 0x00)
		{
			struct Eq_50857 * s2_188;
			byte * s5_191;
			struct Eq_47851 * s7_193;
			word32 s1_484;
			word32 a0_485;
			word32 a1_486;
			word32 a2_487;
			word32 a3_488;
			word32 a4_489;
			word32 a5_490;
			word32 a7_491;
			word32 s3_492;
			word32 s4_493;
			word32 s6_494;
			word32 s8_495;
			word32 s9_496;
			word32 s10_497;
			word32 s11_498;
			word32 t4_499;
			ra_160 = scanu_rm_exist_ssid(printf(ra_160, &g_t230AC780, a3_157, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_484, out a0_485, out a1_486, out a2_487, out a3_488, out a4_489, out a5_490, out a7_491, out s2_188, out s3_492, out s4_493, out s5_191, out s6_494, out s7_193, out s8_495, out s9_496, out s10_497, out s11_498, out t4_499), s5_191, s7_193, out a4_158);
			s2_188->dw0014 = ~0x00;
		}
		word32 s1_483;
		ra_230 = sm_delete_resources(ra_160, a4_158, mstatus, s6, dwLoc18, dwLoc08, dwArg08, s5, dwArgC8, dwArg0128, out s1_483, out s2_232, out s6_243, out s10_240);
	}
	struct Eq_50906 * s2_273;
	word32 s1_500;
	word32 a3_501;
	word32 a4_502;
	word32 a5_503;
	word32 s4_504;
	Eq_2 s0_271 = ke_msg_free(*s2_232 + ~0x0B, mstatus, out s1_500, out a3_501, out a4_502, out a5_503, out s2_273, out s4_504);
	s2_273->dw0000 = 0x00;
	s2_273->b0011 = 0x00;
	*s0_271 = (word16) s6_243;
	ptr32 a4_286;
	struct Eq_50577 * s2_291;
	ptr32 s3_292;
	word32 s1_505;
	word32 a0_506;
	word32 a1_507;
	word32 a2_508;
	word32 a3_509;
	word32 a5_510;
	word32 s4_511;
	word32 s8_512;
	ke_msg_send(s0_271, mstatus, out s1_505, out a0_506, out a1_507, out a2_508, out a3_509, out a4_286, out a5_510, out s2_291, out s3_292, out s4_511, out s8_512);
	s2_291->dw0004 = 0x00;
	0x00 = (int8) dwArg0128;
	a4Out = a4_286;
	s2Out = s2_291;
	s3Out = s3_292;
	s4Out = dwArg78;
	s10Out = s10_240;
	return ra_230;
}

// 230120C2: void sm_supplicant_deauth_cfm(Register Eq_2 ra, Register Eq_2 s0, Register ui32 a1, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0128)
void sm_supplicant_deauth_cfm(Eq_2 ra, Eq_2 s0, ui32 a1, Eq_2 a3, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArg0128)
{
	if (a1 << 0x08 >= 0x00)
	{
		word32 a5_105;
		word32 a4_104;
		word32 a3_103;
		word32 a2_102;
		word32 a1_101;
		word32 a0_100;
		word32 s1_99;
		word32 a7_106;
		word32 s2_107;
		word32 s3_108;
		word32 s4_109;
		word32 s7_110;
		word32 s8_111;
		word32 s9_112;
		word32 s10_113;
		word32 s11_114;
		word32 t4_115;
		ra = printf(ra, &g_t230AC8F0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_99, out a0_100, out a1_101, out a2_102, out a3_103, out a4_104, out a5_105, out a7_106, out s2_107, out s3_108, out s4_109, out s5, out s6, out s7_110, out s8_111, out s9_112, out s10_113, out s11_114, out t4_115);
	}
	word32 a4_116;
	word32 s2_117;
	word32 s3_118;
	word32 s4_119;
	word32 s10_120;
	sm_connect_ind(ra, s0, s5, s6, mstatus, dwArg08, dwArg40, dwArg44, dwArg68, dwArg8C, dwArgC8, dwArg0128, out a4_116, out s2_117, out s3_118, out s4_119, out s10_120);
}

