pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
word32 g_dw230120D6 = 0x00EFC606;
// 230120E6: void sm_auth_send(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
// Called from:
//      sm_auth_handler
//      me_set_active_cfm_handler
void sm_auth_send(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	struct Eq_51065 * a5_24 = (word32) *((word32) g_t42021740 + 61);
	Eq_2 a5_35 = a5_24->t420208F4;
	word32 s7_36 = (word32) a5_24->b420205B0;
	struct Eq_51081 * s1_47;
	struct Eq_51082 * s4_48;
	word32 a0_52;
	Eq_2 s2_56;
	word32 s0_394;
	word32 a1_395;
	word32 a3_396;
	word32 a4_397;
	word32 a5_398;
	word32 s3_399;
	word32 s5_400;
	word32 s6_401;
	word32 s7_402;
	word32 s8_403;
	word32 s9_404;
	word32 s10_405;
	word32 s11_406;
	txl_frame_get(ra, (word32) ((word32) *((word32) a5_35 + 2) != 0x00), (struct Eq_25902 *) 0x0100, 0x05D8, a5_35, fflags, frm, mstatus, dwArgD8, dwArgF8, dwArg0118, out s0_394, out s1_47, out a0_52, out a1_395, out a3_396, out a4_397, out a5_398, out s2_56, out s3_399, out s4_48, out s5_400, out s6_401, out s7_402, out s8_403, out s9_404, out s10_405, out s11_406);
	if (a0_52 == 0x00)
	{
		0x00 = (int8) dwArg0128;
		word32 a4_444;
		word32 s2_445;
		word32 s3_446;
		word32 s4_447;
		word32 s10_448;
		sm_connect_ind(ra, dwArgE4, a0, a1, mstatus, dwArg08, dwArg40, dwArg44, dwArg68, dwArg8C, dwArgC8, dwArg0128, out a4_444, out s2_445, out s3_446, out s4_447, out s10_448);
	}
	else
	{
		word32 a4_407;
		tpc_update_frame_tx_power(ra, s2_56, fflags, frm, out a4_407);
		struct Eq_6750 * s0_114 = s1_47->ptr0068;
		s1_47->b014C = 0xB0;
		s1_47->b014D = 0x00;
		s1_47->b014E = 0x00;
		s1_47->b014F = 0x00;
		word32 a1_408;
		word32 a2_409;
		word32 a3_410;
		word32 a4_411;
		word32 a5_412;
		word32 a6_413;
		word32 a7_414;
		memcpy(&s1_47->b014F + 1, s7_36 + 0x4201EC2E, 0x06, out a1_408, out a2_409, out a3_410, out a4_411, out a5_412, out a6_413, out a7_414);
		word32 a1_415;
		word32 a2_416;
		word32 a3_417;
		word32 a4_418;
		word32 a5_419;
		word32 a6_420;
		word32 a7_421;
		memcpy(&s1_47->b014F + 7, (word32) s2_56 + 80, 0x06, out a1_415, out a2_416, out a3_417, out a4_418, out a5_419, out a6_420, out a7_421);
		word32 a1_422;
		word32 a2_423;
		word32 a3_424;
		word32 a4_425;
		word32 a5_426;
		word32 a6_427;
		word32 a7_428;
		memcpy(&s1_47->b014F + 0x0D, s7_36 + 0x4201EC2E, 0x06, out a1_422, out a2_423, out a3_424, out a4_425, out a5_426, out a6_427, out a7_428);
		uint32 a0_174 = txl_get_seq_ctrl();
		s1_47->b0162 = (byte) a0_174;
		s1_47->b0163 = (byte) (a0_174 >> 8);
		s0_114->b002F = (byte) (word32) *((word32) s2_56 + 87);
		word32 a5_182 = (word32) *((word32) s2_56 + 96);
		s0_114->b005E = 0x00;
		s0_114->b0060 = 0x00;
		s0_114->b0030 = (byte) a5_182;
		byte * s1_180 = &s1_47->b014C;
		int32 s2_188 = 0x18;
		if ((word32) s4_48->b003B == 0x01 && a0 == 0x03)
		{
			s0_114 = txu_cntrl_protect_mgmt_frame(s0_114, &s1_47->b014C, 0x18, out s1_180);
			s2_188 = (word32) s0_114->b005E + 24;
		}
		struct Eq_24474 * a3_226;
		word32 a5_429;
		struct Eq_50498 * a0_223 = me_build_authenticate(s1_180 + s2_188, (word32) s4_48->b003B, a0, 0x00, a1, out a3_226, out a5_429);
		word32 a5_229 = (word32) s0_114->b0060;
		Eq_2 s0_230 = *((word32) a1 + 0x006C);
		*((word32) s0_230 + 720) = s0_230;
		*((word32) s0_230 + 0x02CC) = &g_t23011852;
		struct Eq_51301 * a0_233 = a0_223 + (a5_229 + s2_188) / 0x230120F5;
		word32 a4_237 = g_dw23011866;
		a0_233->dw0020 = a4_237;
		a0_233->dw23011869 = a4_237;
		Eq_2 a3_251;
		Eq_2 a4_252;
		word32 s0_430;
		word32 s1_431;
		word32 a0_432;
		word32 a1_433;
		word32 a5_434;
		word32 s2_435;
		word32 s3_436;
		word32 s4_437;
		word32 s5_438;
		word32 s6_439;
		word32 s7_440;
		word32 s9_441;
		word32 s10_442;
		word32 s11_443;
		ke_timer_set(txl_frame_push(ra, s0_230, 0x03, a3_226, (char *) &a0_233->dw0020 + 0x23011831, mstatus, dwArg08, s5, dwArg88, dwArgBC, out s0_430, out s1_431, out a0_432, out a1_433, out a3_251, out a4_252, out a5_434, out s2_435, out s3_436, out s4_437, out s5_438, out s6_439, out s7_440, out s9_441, out s10_442, out s11_443), 0x01FFF806, 0x06, 0x00032000, a3_251, a4_252, mstatus, dwLoc18, dwArg78, dwArgD8);
		0x00 = (int8) dwArg0128;
		word32 s1_449;
		word32 a0_450;
		word32 a1_451;
		word32 a4_452;
		word32 a5_453;
		word32 s2_454;
		word32 s3_455;
		word32 s4_456;
		ke_state_set(0x06, 0x05, mstatus, out s1_449, out a0_450, out a1_451, out a4_452, out a5_453, out s2_454, out s3_455, out s4_456);
	}
}

// 23012266: void sm_assoc_req_send(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register (ptr32 byte) s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0198)
// Called from:
//      sm_auth_handler
//      me_set_active_cfm_handler
void sm_assoc_req_send(Eq_2 ra, Eq_2 a4, Eq_2 s2, Eq_2 s7, Eq_2 s9, Eq_2 s10, byte * s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0198)
{
	Eq_2 s6_30 = g_t42021740;
	struct Eq_51442 * s2_33 = (word32) *((word32) s6_30 + 61);
	Eq_2 a5_38 = s2_33->t420208F4;
	word32 s9_39 = (word32) s2_33->b420205B0;
	Eq_2 s0_50;
	Eq_2 s1_51;
	word32 s4_52;
	word32 a0_56;
	struct Eq_51460 * s2_60;
	word32 s9_468;
	word32 s10_469;
	word32 s11_470;
	word32 s6_465;
	word32 s7_466;
	word32 s8_467;
	word32 a1_459;
	word32 s3_463;
	word32 s5_464;
	word32 a3_460;
	word32 a4_461;
	word32 a5_462;
	txl_frame_get(ra, (word32) ((word32) *((word32) a5_38 + 2) != 0x00), (struct Eq_25902 *) 0x0100, a4, a5_38, fflags, frm, mstatus, dwArgC8, dwArgE8, dwArg0108, out s0_50, out s1_51, out a0_56, out a1_459, out a3_460, out a4_461, out a5_462, out s2_60, out s3_463, out s4_52, out s5_464, out s6_465, out s7_466, out s8_467, out s9_468, out s10_469, out s11_470);
	uint16 wLoc36_367 = SLICE(s10, uint16, 16);
	if (a0_56 != 0x00)
	{
		int32 s8_99 = g_dw42021744;
		word32 a4_476;
		tpc_update_frame_tx_power(ra, s1_51, fflags, frm, out a4_476);
		int32 a5_110 = (word32) g_b42021751;
		if (a5_110 != 0x00)
			a5_110 = 32;
		*((word32) s1_51 + 332) = (byte) a5_110;
		*((word32) s1_51 + 333) = 0x00;
		*((word32) s1_51 + 334) = 0x00;
		*((word32) s1_51 + 335) = 0x00;
		word32 a6_482;
		word32 a7_483;
		word32 a4_480;
		word32 a5_481;
		word32 a2_478;
		word32 a3_479;
		word32 a1_477;
		memcpy((word32) s1_51 + 336, s9_39 + 0x4201EC2E, 0x06, out a1_477, out a2_478, out a3_479, out a4_480, out a5_481, out a6_482, out a7_483);
		word32 a7_490;
		word32 a6_489;
		word32 a5_488;
		word32 a3_486;
		word32 a4_487;
		word32 a1_484;
		word32 a2_485;
		memcpy((word32) s1_51 + 342, (char *) s2_60 + 0x420205A0, 0x06, out a1_484, out a2_485, out a3_486, out a4_487, out a5_488, out a6_489, out a7_490);
		word32 a2_492;
		word32 a1_491;
		word32 a3_493;
		word32 a4_494;
		word32 a5_495;
		word32 a6_496;
		word32 a7_497;
		memcpy((word32) s1_51 + 348, s9_39 + 0x4201EC2E, 0x06, out a1_491, out a2_492, out a3_493, out a4_494, out a5_495, out a6_496, out a7_497);
		uint32 a0_184 = txl_get_seq_ctrl();
		*((word32) s1_51 + 354) = (byte) a0_184;
		*((word32) s1_51 + 355) = (byte) (a0_184 >> 8);
		struct Eq_51621 * a0_206;
		word32 a3_209;
		struct Eq_51623 * a4_210;
		struct Eq_51624 * s2_217;
		struct Eq_51625 * s8_223;
		Eq_2 ra_214 = me_build_associate_req(ra, s4_52 + 0x420202D0, (word32) s2_60->b420205A7, fp + -52, fp + -54, s6_30, s6_30, s8_99, (word32) s1_51 + 332, s11, dwLoc3C, dwArg00, out a0_206, out a3_209, out a4_210, out s2_217, out s8_223);
		Eq_2 s0_230 = a4_210->t006C;
		*((word32) s0_230 + 47) = (byte) (word32) s2_217->b0057;
		word32 a5_233 = (word32) s2_217->b0060;
		*((word32) s0_230 + 720) = s0_230;
		*((word32) s0_230 + 48) = (byte) a5_233;
		*((word32) s0_230 + 0x02CC) = &g_t23011852;
		word32 a4_240 = g_dw23011866;
		a0_206->dw23011881 = a4_240;
		a0_206->dw0038 = a4_240;
		struct Eq_24474 * a3_235 = a3_209 - s8_223;
		struct Eq_51625 * a5_247 = s8_223;
		struct Eq_51625 * a4_248 = s8_223 + (word32) wLoc36_367;
		while (a5_247 != a4_248)
		{
			++a5_247;
			Mem256[a5_247 + 19:byte] = SLICE(CONVERT(Mem253[a3_235 + a5_247:byte], byte, word32), byte, 0);
		}
		struct Eq_24700 * a5_258 = (word32) wLoc36_367;
		s8_223[0x0E] = (struct Eq_51625) (word16) a5_258;
		Eq_2 a3_270;
		Eq_2 a4_271;
		word32 s0_498;
		word32 s1_499;
		word32 a0_500;
		word32 a1_501;
		word32 a5_502;
		word32 s2_503;
		word32 s3_504;
		word32 s4_505;
		word32 s5_506;
		word32 s6_507;
		word32 s7_508;
		word32 s9_509;
		word32 s10_510;
		word32 s11_511;
		ke_timer_set(txl_frame_push(ra_214, s0_230, 0x03, a3_235, a5_258, mstatus, dwLoc08, s9, dwArg78, dwArgAC, out s0_498, out s1_499, out a0_500, out a1_501, out a3_270, out a4_271, out a5_502, out s2_503, out s3_504, out s4_505, out s5_506, out s6_507, out s7_508, out s9_509, out s10_510, out s11_511), 0x01FFF806, 0x06, 0x00032000, a3_270, a4_271, mstatus, s2, dwArg68, dwArgC8);
		word32 s1_512;
		word32 a0_513;
		word32 a1_514;
		word32 a4_515;
		word32 a5_516;
		word32 s2_517;
		word32 s3_518;
		word32 s4_519;
		ke_state_set(0x06, 0x06, mstatus, out s1_512, out a0_513, out a1_514, out a4_515, out a5_516, out s2_517, out s3_518, out s4_519);
	}
	else
	{
		word32 s4_474;
		word32 s10_475;
		word32 a4_471;
		word32 s2_472;
		word32 s3_473;
		sm_connect_ind(ra, s0_50, 0x42020000, s6_30, mstatus, s10, dwArg00, dwArg04, dwArg28, s7, dwArg88, dwArgE8, out a4_471, out s2_472, out s3_473, out s4_474, out s10_475);
	}
	0x00 = dwArg0198;
}

// 23012404: Register Eq_2 sm_assoc_done(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out ptr32 s4Out)
// Called from:
//      sm_assoc_rsp_handler
Eq_2 sm_assoc_done(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, ptr32 & s4Out)
{
	Eq_2 a0_20;
	struct Eq_51794 * s0_28;
	word32 s1_29;
	word32 a1_84;
	word32 a2_85;
	word32 a3_86;
	word32 a4_87;
	word32 a5_88;
	word32 a6_89;
	word32 s2_90;
	word32 s3_91;
	word32 s4_92;
	word32 s8_93;
	Eq_2 ra_27 = ke_msg_alloc(ra, 0x1E, 0x00, 0x04, a4, mstatus, dwArg08, out s0_28, out s1_29, out a0_20, out a1_84, out a2_85, out a3_86, out a4_87, out a5_88, out a6_89, out s2_90, out s3_91, out s4_92, out s8_93);
	*a0_20 = (word16) s1_29;
	*((word32) a0_20 + 2) = 0x01;
	*((word32) a0_20 + 3) = (byte) (word32) s0_28->b003D;
	word32 s1_94;
	word32 a0_95;
	word32 a1_96;
	word32 a2_97;
	word32 a3_98;
	word32 a4_99;
	word32 a5_100;
	word32 s2_101;
	word32 s3_102;
	word32 s4_103;
	word32 s8_104;
	ke_msg_send(a0_20, mstatus, out s1_94, out a0_95, out a1_96, out a2_97, out a3_98, out a4_99, out a5_100, out s2_101, out s3_102, out s4_103, out s8_104);
	ptr32 s4_73;
	word32 s1_105;
	word32 a0_106;
	word32 a1_107;
	word32 a4_108;
	word32 a5_109;
	word32 s2_110;
	word32 s3_111;
	ke_state_set(0x06, 0x07, mstatus, out s1_105, out a0_106, out a1_107, out a4_108, out a5_109, out s2_110, out s3_111, out s4_73);
	s4Out = s4_73;
	return ra_27;
}

// 23012448: void sm_auth_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register (ptr32 byte) s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack word32 dwArg0198)
// Called from:
//      rxu_mgt_ind_handler
void sm_auth_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s10, byte * s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, word32 dwArg0198)
{
	Eq_2 a1_105;
	Eq_2 a0_106;
	struct Eq_51930 * s1_18;
	Eq_2 a3_22;
	Eq_2 s0_27;
	Eq_2 s2_28;
	Eq_2 ra_26 = ke_timer_clear(ra, a0, 0x01FFF806, 0x06, mstatus, dwArg0108, out s0_27, out s1_18, out a3_22, out s2_28);
	if (((word32) s1_18->b0005 << 8 | (word32) s1_18->b0004) == 0x00)
	{
		Eq_2 a4_108 = (word32) *((word32) s0_27 + 28);
		ui32 a5_110 = (word32) *((word32) s0_27 + 29) << 8 | a4_108;
		if (a5_110 == 0x00)
		{
l2301247E:
			sm_assoc_req_send(ra_26, a4_108, s2_28, s7, s9, s10, s11, fflags, frm, mstatus, dwArg00, dwArg04, dwArg28, dwArg68, dwArg78, dwArg88, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0198);
			return;
		}
		if (a5_110 != 0x01)
			return;
		ui32 a5_119 = (word32) s1_18->b0003 << 8 | (word32) s1_18->b0002;
		a4_108.u0 = 0x04;
		if (a5_119 == 0x04)
			goto l2301247E;
		if (a5_119 != 0x02)
		{
			word32 a4_425;
			word32 s2_426;
			word32 s3_427;
			word32 s4_428;
			word32 s10_429;
			sm_connect_ind(ra_26, s0_27, s5, s6, mstatus, dwLoc08, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArg0118, out a4_425, out s2_426, out s3_427, out s4_428, out s10_429);
			assert_warn();
			return;
		}
		if ((word32) *s0_27 <= 0x0087)
		{
			word32 s1_430;
			word32 a0_431;
			word32 a1_432;
			word32 a2_433;
			word32 a3_434;
			word32 a4_435;
			word32 a5_436;
			word32 a7_437;
			word32 s2_438;
			word32 s3_439;
			word32 s4_440;
			word32 s5_441;
			word32 s6_442;
			word32 s7_443;
			word32 s8_444;
			word32 s9_445;
			word32 s10_446;
			word32 s11_447;
			word32 t4_448;
			printf(ra_26, &g_t230AC6D4, a3_22, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_430, out a0_431, out a1_432, out a2_433, out a3_434, out a4_435, out a5_436, out a7_437, out s2_438, out s3_439, out s4_440, out s5_441, out s6_442, out s7_443, out s8_444, out s9_445, out s10_446, out s11_447, out t4_448);
			return;
		}
		a1_105 = (word32) s0_27 + 36;
		a0_106.u0 = 0x03;
	}
	else
	{
		Eq_2 a5_38 = g_t42021740;
		Eq_2 a3_40 = (word32) *((word32) a5_38 + 59);
		if (a3_40 != 0x01 || (word32) (*((word32) a5_38 + 320)) == 0x00)
		{
			word32 a1_405;
			word32 a2_406;
			Eq_2 s5_63;
			Eq_2 s6_64;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			word32 a7_410;
			word32 s2_411;
			word32 s3_412;
			word32 s4_413;
			word32 s7_414;
			word32 a0_404;
			word32 s1_403;
			word32 s8_415;
			word32 s9_416;
			word32 s10_417;
			word32 s11_418;
			word32 t4_419;
			Eq_2 ra_56 = printf(ra_26, &g_t230AC6FC, a3_40, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_403, out a0_404, out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a7_410, out s2_411, out s3_412, out s4_413, out s5_63, out s6_64, out s7_414, out s8_415, out s9_416, out s10_417, out s11_418, out t4_419);
			word32 a4_420;
			word32 s2_421;
			word32 s3_422;
			word32 s4_423;
			word32 s10_424;
			sm_connect_ind(ra_56, s0, s5_63, s6_64, mstatus, dwArg08, dwArg40, dwArg44, dwArg68, dwArg8C, dwArgC8, dwArg0128, out a4_420, out s2_421, out s3_422, out s4_423, out s10_424);
			return;
		}
		*((word32) a5_38 + 59) = 0x00;
		a1_105.u0 = 0x00;
		a0_106.u0 = 0x01;
	}
	sm_auth_send(ra_26, a0_106, a1_105, s5, fflags, frm, mstatus, dwArg08, dwArg40, dwArg44, dwArg68, dwArg78, dwArg88, dwArg8C, dwArgBC, dwArgC8, dwArgD8, dwArgE4, dwArgF8, dwArg0118, dwArg0128);
}

// 23012546: void sm_assoc_rsp_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg48, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0158, Stack word32 dwArg0198)
// Called from:
//      rxu_mgt_ind_handler
void sm_assoc_rsp_handler(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s7, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg48, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0158, word32 dwArg0198)
{
	Eq_2 a3_46;
	struct Eq_52174 * s2_52;
	word32 s0_391;
	word32 s1_392;
	Eq_2 ra_50 = ke_timer_clear(ra, s0, 0x01FFF806, 0x06, mstatus, dwArgD8, out s0_391, out s1_392, out a3_46, out s2_52);
	Eq_2 s0_60 = (word32) s2_52->b0003 << 8 | (word32) s2_52->b0002;
	word32 dwLoc34_314 = SEQ(bLoc31, 0x00, wLoc34);
	if (s0_60 == 0x00)
	{
		Eq_2 a4_115 = (word32) *a0;
		word32 s4_148;
		Eq_2 a3_168;
		word32 s1_175;
		word32 s3_179;
		ptr32 s5_181;
		struct Eq_52272 * s6_182;
		ptr32 s7_183;
		int32 s1_209;
		word32 a5_415;
		word32 s4_416;
		word32 s8_417;
		word32 s9_418;
		word32 a3_419;
		word32 a4_420;
		word32 s2_421;
		word32 s3_422;
		Eq_2 s0_208 = tpc_update_vif_tx_power(me_init_rate(sm_assoc_done(ra_50, a4_115, mstatus, dwLoc38, out s4_148), s4_148 + 1107422224, s9, fflags, frm, mstatus, dwLoc34_314, dwLoc1C, dwLoc08, dwArg28, dwArgA8, dwArgD8, dwArg0158, out s1_175, out a3_168, out a5_415, out s3_179, out s4_416, out s5_181, out s6_182, out s7_183, out s8_417, out s9_418), s1_175 + s3_179, fp + -49, fp + -50, a3_168, fflags, frm, out s1_209, out a3_419, out a4_420, out s2_421, out s3_422);
		Eq_2 a4_219 = 0x00;
		byte (* a3_220)[] = &s6_182->w0010 + 2 + (word32) s6_182->w000E / 18;
		while (s0_208 != a4_219)
		{
			Mem230[a3_220 + a4_219:byte] = SLICE(CONVERT(Mem225[s5_181 + a4_219 + 0x0022:byte], byte, word32), byte, 0);
			a4_219 = (word32) a4_219 + 1;
		}
		s6_182->w0010 = (word16) s0_208;
		if (((s7_183 + 0x05D8 + s1_209)->dw03E8 & 0x12FFFA00) != 0x00)
			supplicantInitSession(mstatus, dwArg48, dwArgD8, dwArgF8, dwArg0118, dwArg0138);
	}
	else
	{
		Eq_2 s5_79;
		Eq_2 s6_80;
		word32 s10_407;
		word32 s9_406;
		word32 s8_405;
		word32 s7_404;
		word32 s1_393;
		word32 a0_394;
		word32 a1_395;
		word32 a2_396;
		word32 a4_398;
		word32 a3_397;
		word32 a5_399;
		word32 a7_400;
		word32 s2_401;
		word32 s3_402;
		word32 s4_403;
		word32 s11_408;
		word32 t4_409;
		word32 a4_410;
		word32 s2_411;
		word32 s3_412;
		word32 s4_413;
		word32 s10_414;
		sm_connect_ind(printf(ra_50, &g_t230AC6A0, a3_46, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_393, out a0_394, out a1_395, out a2_396, out a3_397, out a4_398, out a5_399, out a7_400, out s2_401, out s3_402, out s4_403, out s5_79, out s6_80, out s7_404, out s8_405, out s9_406, out s10_407, out s11_408, out t4_409), s0_60, s5_79, s6_80, mstatus, dwLoc38, dwArg00, dwArg04, dwArg28, s7, dwArg88, dwArgE8, out a4_410, out s2_411, out s3_412, out s4_413, out s10_414);
	}
	0x00 = dwArg0198;
}

// 2301269E: void sm_deauth_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
// Called from:
//      rxu_mgt_ind_handler
void sm_deauth_handler(Eq_2 ra, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 s0_19 = g_t42021740;
	word32 a0_20;
	word32 s2_251;
	word32 a4_250;
	word32 a2_249;
	ke_state_get(0x06, dwArg18, out a0_20, out a2_249, out a4_250, out s2_251);
	if (a0_20 == 0x08)
		return;
	word32 a0_29;
	struct Eq_52400 * s2_34;
	word32 a4_253;
	word32 a2_252;
	Eq_2 s1_33 = ke_state_get(0x06, dwArg18, out a0_29, out a2_252, out a4_253, out s2_34);
	if (a0_29 == 0x00)
	{
		if ((word32) *((word32) s1_33 + 0x420205A8) != 0x00)
		{
			word32 a5_263;
			word32 s2_264;
			word32 a4_262;
			word32 a1_261;
			word32 a0_260;
			word32 s1_259;
			word32 s3_265;
			word32 s4_266;
			ke_state_set(0x06, 0x08, mstatus, out s1_259, out a0_260, out a1_261, out a4_262, out a5_263, out s2_264, out s3_265, out s4_266);
			Eq_2 a4_73;
			word32 s1_267;
			word32 a0_268;
			word32 a1_269;
			word32 a2_270;
			word32 a3_271;
			word32 a5_272;
			word32 a7_273;
			word32 s2_274;
			word32 s3_275;
			word32 s4_276;
			word32 s5_277;
			word32 s6_278;
			word32 s7_279;
			word32 s8_280;
			word32 s9_281;
			word32 s10_282;
			word32 s11_283;
			word32 t4_284;
			word32 a4_285;
			word32 s4_286;
			sm_disconnect_process(printf(ra, &g_t230AC7B0, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_267, out a0_268, out a1_269, out a2_270, out a3_271, out a4_73, out a5_272, out a7_273, out s2_274, out s3_275, out s4_276, out s5_277, out s6_278, out s7_279, out s8_280, out s9_281, out s10_282, out s11_283, out t4_284), a4_73, mstatus, s2, dwLoc08, dwArg08, dwArg18, dwArg58, dwArgC8, dwArg0128, out a4_285, out s4_286);
		}
	}
	else
	{
		if ((word32) *((word32) s0_19 + 61) != (word32) s2_34->b0008)
			return;
		word32 s10_258;
		word32 s4_257;
		word32 s3_256;
		word32 s2_255;
		word32 a4_254;
		sm_connect_ind(ra, s0_19, s5, s6, mstatus, s2, dwArg20, dwArg24, dwArg48, ra, dwArgA8, dwArg0108, out a4_254, out s2_255, out s3_256, out s4_257, out s10_258);
	}
}

