pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301273A: Register Eq_2 sm_handle_supplicant_result(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 a4Out, Register out ptr32 s10Out)
// Called from:
//      keyMgmtKeyGroupTxDone.isra.1
//      keyMgmtStaRsnSecuredTimeoutHandler
Eq_2 sm_handle_supplicant_result(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 s2, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & a4Out, ptr32 & s10Out)
{
	Eq_2 a4_41 = (word32) a0 + 432;
	Eq_2 s6_211 = (word32) *((word32) a0 + 1107422250);
	if (a1 == 0x00)
		*((word32) a0 + 1107422273) = 0x02;
	else
	{
		s5 = a0;
		if (a1 == 0x0F)
		{
			word32 s1_381;
			word32 a0_382;
			word32 a1_383;
			word32 a2_384;
			word32 a3_385;
			word32 a5_386;
			word32 a7_387;
			word32 s2_388;
			word32 s3_389;
			word32 s4_390;
			word32 s7_391;
			word32 s8_392;
			word32 s9_393;
			word32 s10_394;
			word32 s11_395;
			word32 t4_396;
			ra = printf(ra, &g_t230AC874, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_381, out a0_382, out a1_383, out a2_384, out a3_385, out a4_41, out a5_386, out a7_387, out s2_388, out s3_389, out s4_390, out s5, out s6_211, out s7_391, out s8_392, out s9_393, out s10_394, out s11_395, out t4_396);
		}
		Eq_2 a5_65 = *((word32) s6_211 + 0x420208F4);
		Eq_2 s0_81;
		struct Eq_42953 * s4_83;
		word32 a0_87;
		Eq_2 s2_91;
		word32 s3_92;
		word32 s1_369;
		word32 a1_370;
		word32 a3_371;
		word32 a4_372;
		word32 a5_373;
		word32 s5_374;
		word32 s6_375;
		word32 s7_376;
		word32 s8_377;
		word32 s9_378;
		word32 s10_379;
		word32 s11_380;
		txl_frame_get(ra, (word32) ((word32) *((word32) a5_65 + 2) != 0x00), (struct Eq_25902 *) 0x0100, a4_41, a5_65, fflags, frm, mstatus, dwArgE8, dwArg0108, dwArg0128, out s0_81, out s1_369, out a0_87, out a1_370, out a3_371, out a4_372, out a5_373, out s2_91, out s3_92, out s4_83, out s5_374, out s6_375, out s7_376, out s8_377, out s9_378, out s10_379, out s11_380);
		if (a0_87 != 0x00)
		{
			word32 a4_397;
			tpc_update_frame_tx_power(ra, s2_91, fflags, frm, out a4_397);
			Eq_2 s1_112 = *((word32) s0_81 + 0x0068);
			*((word32) s0_81 + 332) = 0xC0;
			*((word32) s0_81 + 333) = 0x00;
			*((word32) s0_81 + 334) = 0x00;
			*((word32) s0_81 + 335) = 0x00;
			word32 s3_123 = s3_92 + ((word32) s5 + 432);
			word32 a1_398;
			word32 a2_399;
			word32 a3_400;
			word32 a4_401;
			word32 a5_402;
			word32 a6_403;
			word32 a7_404;
			memcpy((word32) s0_81 + 336, s3_123 + 0x1E, 0x06, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a6_403, out a7_404);
			word32 a1_405;
			word32 a2_406;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			word32 a6_410;
			word32 a7_411;
			memcpy((word32) s0_81 + 342, (word32) s2_91 + 80, 0x06, out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a6_410, out a7_411);
			struct Eq_24474 * a3_163;
			word32 a1_412;
			word32 a2_413;
			word32 a4_414;
			word32 a5_415;
			word32 a6_416;
			word32 a7_417;
			memcpy((word32) s0_81 + 348, s3_123 + 0x1E, 0x06, out a1_412, out a2_413, out a3_163, out a4_414, out a5_415, out a6_416, out a7_417);
			uint32 a0_171 = txl_get_seq_ctrl();
			*((word32) s0_81 + 354) = (byte) a0_171;
			*((word32) s0_81 + 355) = (byte) (a0_171 >> 8);
			*((word32) s1_112 + 0x02CC) = &g_t230120C2;
			*((word32) s1_112 + 720) = s2_91;
			*((word32) s1_112 + 47) = (byte) s6_211;
			*((word32) s1_112 + 48) = (byte) s5;
			struct Eq_50498 * a0_184 = me_build_deauthenticate((word32) s0_81 + 356, s4_83);
			word32 a4_188 = g_dw230120D6;
			a0_184->dw0038 = a4_188;
			a0_184->dw230120F1 = a4_188;
			word32 a0_195;
			ptr32 a4_199;
			ptr32 s10_205;
			word32 s0_418;
			word32 s1_419;
			word32 a1_420;
			word32 a3_421;
			word32 a5_422;
			word32 s2_423;
			word32 s3_424;
			word32 s4_425;
			word32 s7_426;
			word32 s9_427;
			word32 s11_428;
			ra = txl_frame_push(ra, s0_81, 0x03, a3_163, (char *) &a0_184->dw0038 + 0x230120A1, mstatus, dwArg18, s1, dwArg98, dwArgCC, out s0_418, out s1_419, out a0_195, out a1_420, out a3_421, out a4_199, out a5_422, out s2_423, out s3_424, out s4_425, out s5, out s6_211, out s7_426, out s9_427, out s10_205, out s11_428);
			if (a0_195 != 0x00)
			{
				0x00 = (int8) dwArgA8;
				a4Out = a4_199;
				s10Out = s10_205;
				return ra;
			}
		}
	}
	0x00 = (int8) dwArgA8;
	ptr32 a4_249;
	ptr32 s10_256;
	word32 s3_367;
	word32 s2_366;
	word32 s4_368;
	Eq_2 ra_253 = sm_connect_ind(ra, s1, s5, s6_211, mstatus, dwArg08, dwArg40, dwArg44, s1, dwArg8C, dwArgC8, dwArg0128, out a4_249, out s2_366, out s3_367, out s4_368, out s10_256);
	a4Out = a4_249;
	s10Out = s10_256;
	return ra_253;
}

// 2301287A: Register (ptr32 Eq_6750) txu_cntrl_sec_hdr_append(Register (ptr32 Eq_6750) a0, Register (ptr32 Eq_6750) a1, Register word32 a2)
// Called from:
//      txu_cntrl_frame_build
//      txu_cntrl_protect_mgmt_frame
struct Eq_6750 * txu_cntrl_sec_hdr_append(struct Eq_6750 * a0, struct Eq_6750 * a1, word32 a2)
{
	struct Eq_52827 * a5_5 = (word32) a0->b0030;
	struct Eq_52832 * a6_10 = (word32) a0->b002F;
	struct Eq_52837 * a5_13 = *a5_5->ptr4201ECBC;
	if (a5_13 == null)
		return a1;
	if ((a6_10->dw42020B14 & 0x02) != 0x00)
	{
		uint32 a6_21 = (word32) a0->w0020;
		if ((word32) a5_5->w4201EC48 == (word32) ((word16) (a6_21 << 0x08 | a6_21 >> 0x08)))
			return a1;
	}
	struct Eq_52853 * a3_47;
	ui32 a4_49;
	word32 a4_30 = (word32) a5_13->b0060;
	if (a4_30 != 0x01)
	{
		if (a4_30 == 0x00)
		{
l230128EC:
			a1->wFFFFFFFC = (word16) (word32) a0->t0022;
			a3_47 = (word32) a0->w0024;
			a1->wFFFFFFFE = (word16) ((word32) a5_13->b0061 << 0x0E | a3_47);
			a1 = (struct Eq_6750 *) &a1->wFFFFFFFC;
			goto l23012906;
		}
		if (a4_30 != 0x02)
		{
			a3_47 = (struct Eq_52853 *) 0x03;
			if (a4_30 == 0x03)
				goto l230128EC;
			goto l23012906;
		}
		a1->wFFFFFFF8 = (word16) (word32) a0->t0022;
		a3_47 = (struct Eq_52853 *) 0x02000000;
		a4_49 = (word32) a5_13->b0061 << 0x0E | 0x02000000;
	}
	else
	{
		uint32 a6_33 = (word32) a0->t0022;
		a1->wFFFFFFF8 = (word16) ((a6_33 | 0x02000000) & 0x07FFFF00 | a6_33 >> 0x08);
		ui32 a3_45 = (word32) a5_13->b0061;
		a3_47 = a3_45 << 0x0E;
		a4_49 = (word32) a0->t0022 | a3_45 << 0x0E | 0x02000000;
	}
	a1->wFFFFFFFA = (word16) a4_49;
	a1->wFFFFFFFC = (word16) (word32) a0->w0024;
	a1->wFFFFFFFE = (word16) (word32) a0->w0026;
	a1 = (struct Eq_6750 *) &a1->wFFFFFFF8;
l23012906:
	((word32) a5_13->b0062 | a3_47 & 0x000FFC00)->dw000C = a3_47->dw000C;
	return a1;
}

