pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23012988: Register (ptr32 Eq_6750) txu_cntrl_sechdr_len_compute(Register (ptr32 Eq_6750) a0, Register Eq_2 a1, Register out (ptr32 Eq_52996) a5Out)
// Called from:
//      txu_cntrl_push
//      txu_cntrl_protect_mgmt_frame
struct Eq_6750 * txu_cntrl_sechdr_len_compute(struct Eq_6750 * a0, Eq_2 a1, struct Eq_52996 & a5Out)
{
	struct Eq_52997 * a2_14 = (word32) a0->b002F;
	struct Eq_52996 * a5_101 = **((char *) g_a4201ECBC + (word32) a0->b0030);
	*a1 = 0x00;
	struct Eq_6750 * s0_113 = null;
	if (a5_101 != null)
	{
		int32 a2_26 = a2_14->dw42020B14;
		struct Eq_53025 * a2_27 = a2_26 & 0x02;
		if ((a2_26 & 0x02) != 0x00)
		{
			uint32 a2_29 = (word32) a0->w0020;
			s0_113 = null;
			a2_27 = (word32) g_a4201EC48[(word32) a0->b0030];
			if (a2_27 == (word32) ((word16) (a2_29 << 0x08 | a2_29 >> 8)))
				goto l23012A3E;
		}
		union Eq_2 * a4_43;
		word32 a4_41 = (word32) a5_101->t0060;
		if (a4_41 != 0x01)
		{
			if (a4_41 == 0x00)
			{
l23012A10:
				*(union Eq_2 *) 0x04 = a1;
				ui32 a4_86 = (word32) a0->w0032;
				s0_113 = (struct Eq_6750 *) 0x04;
				if ((a4_86 & 0x01) == 0x00)
				{
					struct Eq_53082 * a3_93 = (a4_86 & 0x01) + 1;
					word32 a5_91 = a2_27->dw004C;
					a3_93->dw0048 = a5_91;
					(a2_27 + (word32) (a3_93 < (a4_86 & 0x01)) / 80)->dw004C = a5_91;
					word32 a7_204;
					word32 a6_203;
					word32 a4_202;
					word32 a3_201;
					word32 a2_200;
					word32 a1_199;
					memcpy(&a0->t0022, a5_91 + 72, 0x04, out a1_199, out a2_200, out a3_201, out a4_202, out a5_101, out a6_203, out a7_204);
				}
				goto l23012A3E;
			}
			if (a4_41 != 0x02)
			{
				s0_113 = null;
				if (a4_41 == 0x03)
					goto l23012A10;
				goto l23012A3E;
			}
			a4_43 = (union Eq_2 *) 0x08;
		}
		else
			a4_43 = (union Eq_2 *) 0x0C;
		*a4_43 = (union Eq_2 *) a1;
		ui32 a4_52 = (word32) a0->w0032;
		if ((a4_52 & 0x01) == 0x00)
		{
			struct Eq_53133 * a3_59 = (a4_52 & 0x01) + 1;
			word32 a5_57 = a2_27->dw004C;
			a3_59->dw0048 = a5_57;
			(a2_27 + (word32) (a3_59 < (a4_52 & 0x01)) / 80)->dw004C = a5_57;
			word32 a7_210;
			word32 a6_209;
			word32 a4_208;
			word32 a3_207;
			word32 a2_206;
			word32 a1_205;
			memcpy(&a0->t0022, a5_57 + 72, 0x06, out a1_205, out a2_206, out a3_207, out a4_208, out a5_101, out a6_209, out a7_210);
		}
		s0_113 = (struct Eq_6750 *) 0x08;
	}
l23012A3E:
	a5Out = a5_101;
	return s0_113;
}

// 23012A7C: Register (ptr32 Eq_6750) txu_cntrl_frame_build(Register (ptr32 Eq_6750) a0, Register (ptr32 Eq_6750) a1, Register out ptr32 a2Out)
// Called from:
//      txl_buffer_alloc
struct Eq_6750 * txu_cntrl_frame_build(struct Eq_6750 * a0, struct Eq_6750 * a1, ptr32 & a2Out)
{
	uint32 a4_9 = (word32) a0->w0020;
	if ((word32) (word16) (a4_9 << 0x08 | a4_9 >> 8) > 0x05FF)
	{
		a1->wFFFFFFF8 = ~0x0555;
		a1->wFFFFFFFA = 0x03;
		a1->wFFFFFFFC = 0x00;
		a1->wFFFFFFFE = (word16) (word32) a0->w0020;
		a1 = (struct Eq_6750 *) &a1->wFFFFFFF8;
	}
	word32 a0_31 = txu_cntrl_sec_hdr_append(a0, a1, 0x01);
	struct Eq_53193 * a3_41 = (word32) a0->b0030;
	int32 t1_46 = (word32) a0->b002E;
	struct Eq_53203 * a6_47 = (word32) a0->b002F;
	struct Eq_6750 * a1_276 = &g_t4201EA60;
	int32 a7_52 = *a3_41->ptr4201ECBC;
	struct Eq_53217 * a5_53 = a0_31 + -26;
	if (t1_46 == 0x00FF)
		a5_53 = a0_31 + -24;
	uint16 * a0_59 = &a5_53->w0018;
	struct Eq_53217 * a2_184 = null;
	if (((word32) a0->w0032 & 0x0100) != 0x00)
	{
		a5_53 = (struct Eq_53217 *) ((char *) a5_53 - 6);
		a2_184 = a5_53;
	}
	if (t1_46 != 0x00FF)
	{
		a5_53->b0000 = 0x80;
		a5_53->b0001 = 0x00;
		*a0_59 = (word16) (word32) a0->b002E;
		uint32 a4_82 = (word32) a0->w002A << 20 >> 16;
		a5_53->b0016 = (byte) a4_82;
		a5_53->b0017 = (byte) (a4_82 >> 8);
		if (((word32) a0->w0032 & 0x0200) != 0x00)
			*a0_59 = (word16) ((word32) *a0_59 | 16);
	}
	else
	{
		a5_53->b0000 = 0x00;
		a5_53->b0001 = 0x00;
		a5_53->b0016 = 0x00;
		a5_53->b0017 = 0x00;
	}
	uint32 a4_115;
	ui32 a4_96 = (word32) a5_53->b0001 << 8 | (word32) a5_53->b0000;
	a5_53->b0000 = (byte) (a4_96 | 8);
	a5_53->b0001 = (byte) ((a4_96 | 8) >> 8);
	ui32 t1_102 = (word32) a0->w0032;
	if (t1_102 << 0x14 < 0x00)
		a4_115 = a4_96 & -769 | 8;
	else if ((t1_102 & 0x0100) != 0x00)
		a4_115 = a4_96 | 776;
	else
	{
		word32 t1_113 = (word32) a6_47->b420205A6;
		if (t1_113 == 0x00)
			a4_115 = a4_96 | 264;
		else
		{
			if (t1_113 != 0x02)
			{
l23012B96:
				if (((word32) a0->w0032 & 0x04) != 0x00)
				{
					ui32 a4_134 = (word32) a5_53->b0001 << 8 | (word32) a5_53->b0000;
					a5_53->b0000 = (byte) (a4_134 | 0x02000000);
					a5_53->b0001 = (byte) ((a4_134 | 0x02000000) >> 8);
				}
				word32 a4_215;
				a5_53->w000A = (word16) (word32) a6_47->w420205A0;
				a5_53->w000C = (word16) (word32) a6_47->w420205A2;
				a5_53->w000E = (word16) (word32) a6_47->w420205A4;
				int32 t1_161 = (word32) a5_53->b0001 << 8 & 0x0300;
				if (t1_161 == 0x0100)
				{
					a5_53->w0004 = (word16) (word32) a3_41->w4201EC2E;
					a5_53->w0006 = (word16) (word32) a3_41->w4201EC30;
					a5_53->w0008 = (word16) (word32) a3_41->w4201EC32;
					a5_53->w0010 = (word16) (word32) a0->w0014;
					a5_53->w0012 = (word16) (word32) a0->w0016;
					a4_215 = (word32) a0->w0018;
				}
				else if (t1_161 == 0x0200)
				{
					a5_53->w0004 = (word16) (word32) a0->w0014;
					a5_53->w0006 = (word16) (word32) a0->w0016;
					a5_53->w0008 = (word16) (word32) a0->w0018;
					a5_53->w0010 = (word16) (word32) a0->w001A;
					a5_53->w0012 = (word16) (word32) a0->w001C;
					a4_215 = (word32) a0->w001E;
				}
				else
				{
					if (t1_161 != 0x00)
					{
						a2_184->w0004 = (word16) (word32) a3_41->w4201EC2E;
						a2_184->w0006 = (word16) (word32) a3_41->w4201EC30;
						a2_184->w0008 = (word16) (word32) a3_41->w4201EC32;
						a2_184->w0010 = (word16) (word32) a0->w0014;
						a2_184->w0012 = (word16) (word32) a0->w0016;
						a2_184->w0014 = (word16) (word32) a0->w0018;
						a2_184->w0018 = (word16) (word32) a0->w001A;
						a2_184->w001A = (word16) (word32) a0->w001C;
						a2_184->w001C = (word16) (word32) a0->w001E;
l23012C30:
						if (a7_52 != 0x00)
						{
							if ((a6_47->dw42020B14 & 0x02) == 0x00)
							{
l23012C6C:
								ui32 a4_284 = (word32) a5_53->b0001 << 8 | (word32) a5_53->b0000;
								a5_53->b0000 = (byte) (a4_284 | 0x04000000);
								a5_53->b0001 = (byte) ((a4_284 | 0x04000000) >> 8);
								goto l23012C86;
							}
							struct Eq_53514 * a3_270 = (word32) a0->b0030;
							uint32 a3_265 = (word32) a0->w0020;
							a1_276 = (struct Eq_6750 *) ((char *) a3_270 + 1107422224);
							if ((word32) a3_270->w4201EC48 != (word32) ((word16) (a3_265 << 0x08 | a3_265 >> 8)))
								goto l23012C6C;
						}
l23012C86:
						a2Out = dwArg10;
						return a1_276;
					}
					a5_53->w0004 = (word16) (word32) a0->w0014;
					a5_53->w0006 = (word16) (word32) a0->w0016;
					a5_53->w0008 = (word16) (word32) a0->w0018;
					a5_53->w0010 = (word16) (word32) a6_47->w420208C8;
					a5_53->w0012 = (word16) (word32) a6_47->w420208CA;
					a4_215 = (word32) a6_47->w420208CC;
				}
				a5_53->w0014 = (word16) a4_215;
				goto l23012C30;
			}
			a4_115 = a4_96 | 520;
		}
	}
	a5_53->b0000 = (byte) a4_115;
	a5_53->b0001 = (byte) (a4_115 >> 8);
	goto l23012B96;
}

// 23012D96: Register Eq_2 txu_cntrl_push(Register Eq_2 ra, Register (ptr32 Eq_6667) s0, Register (ptr32 Eq_6750) a0, Register Eq_2 a1, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgCC, Stack word32 dwArgDC, Stack word32 dwArg0128, Stack word32 dwArg0168, Register out ptr32 s0Out, Register out Eq_6769 s1Out, Register out ptr32 a4Out, Register out Eq_6771 s2Out, Register out Eq_2 s3Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out (ptr32 Eq_6775) s7Out, Register out ptr32 s8Out)
// Called from:
//      ipc_emb_tx_evt
Eq_2 txu_cntrl_push(Eq_2 ra, struct Eq_6667 * s0, struct Eq_6750 * a0, Eq_2 a1, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg98, Eq_2 dwArgCC, word32 dwArgDC, word32 dwArg0128, word32 dwArg0168, ptr32 & s0Out, union Eq_6769 & s1Out, ptr32 & a4Out, union Eq_6771 & s2Out, union Eq_2 & s3Out, ptr32 & s5Out, union Eq_2 & s6Out, struct Eq_6775 & s7Out, ptr32 & s8Out)
{
	ptr32 a4_278;
	Eq_6769 s1_283;
	Eq_2 s3_212 = a1;
	word32 a3_571;
	struct Eq_32691 * a4_29;
	Eq_2 a0_25 = txl_cntrl_tx_check((word32) a0->b002F + 0x42020550, out a3_571, out a4_29);
	if (a0_25 != 0x00)
	{
		Eq_2 a5_189;
		Eq_2 s0_211;
		ui32 a4_30 = (word32) a0->w0032;
		if ((a4_30 & 8) != 0x00)
		{
			struct Eq_53811 * a5_222;
			if ((a4_30 & 0x10) != 0x00 || (word32) (a4_30 & 8)->b0004 != 0x00)
				a5_222 = (struct Eq_53811 *) &g_dw42045A2C;
			else
				a5_222 = (struct Eq_53811 *) &g_dw420450B4;
			a5_222->ptr0054 = a0;
			word32 a4_574;
			word32 a1_572;
			word32 a3_573;
			Eq_2 a0_239 = tpc_get_vif_tx_power_vs_rate(ra, a0_25, fflags, frm, out a1_572, out a3_573, out a4_574, out a5_189);
			*((word32) a0_239 + 36) = a5_189;
			*((word32) a0_239 + 40) = a5_189;
			*((word32) a0_239 + 44) = a5_189;
			s0_211 = *((word32) a5_189 + 84);
			*((word32) a0_239 + 48) = a5_189;
			*((word32) s0_211 + 94) = 0x00;
			*((word32) s0_211 + 96) = 0x00;
			goto l23012DFE;
		}
		struct Eq_53782 * a5_32 = (word32) a0->b0030;
		uint32 a1_34 = (word32) a0->w0020;
		s2.u0 = 1107421792;
		word32 a6_42 = (word32) a5_32->b4201EC41;
		if ((word32) a5_32->w4201EC48 == (word32) ((word16) (a1_34 << 0x08 | a1_34 >> 8)))
			a0->w0032 = (word16) (a4_30 & -0x0101);
		else
			a0_25.u0 = 0x00;
		if (a6_42 == 0x02)
		{
l23012E72:
			struct Eq_53873 * a3_79 = (word32) a0->b002E;
			word32 s1_105 = 0x18;
			if (a3_79 != (struct Eq_53873 *) 0x00FF)
			{
				s1_105 = 0x1A;
				if (((word32) a0->w0032 & 0x01) == 0x00)
				{
					word32 a5_91 = a5_32 + 0x00D8 + a3_79 + 0x0078 << 1;
					word32 a3_95 = (word32) a5_91->w4201EA68;
					a5_91->w4201EA68 = (word16) (word32) (word12) (a3_95 + 1);
					a0->w002A = (word16) a3_95;
				}
			}
			if (((word32) a0->w0032 & 0x0100) != 0x00)
				s1_105 += 0x06;
			word32 a5_575;
			word32 a0_114 = txu_cntrl_sechdr_len_compute(a0, fp + -36, out a5_575);
			uint32 a4_129 = (word32) a0->w0020;
			word32 a0_132 = a0_114 + s1_105;
			word32 a4_138 = 0x00;
			if ((word32) (word16) (a4_129 << 0x08 | a4_129 >> 8) > 0x0600)
			{
				a0_132 += 0x08;
				a4_138 = 0x08;
			}
			word32 a5_143 = (word32) a0->w000C;
			a0->b005E = (byte) a0_132;
			struct Eq_38458 * a0_146 = (word32) a0->b0030;
			a0->w005C = (word16) a5_143;
			a0->b005F = (byte) a4_138;
			a0->b0060 = (byte) a5_143;
			struct Eq_53984 * s0_173;
			word32 s2_177;
			ra = me_check_rc(ra, a0_146, s6, s0, dwLoc08, dwArg00, dwArg28, dwArgDC, out s0_173, out s2_177);
			struct Eq_53992 * a0_208;
			word32 s4_576;
			word32 s8_577;
			s0_211 = me_update_buffer_control(ra, (word32) s0_173->b0030 + 432 + s2_177, fflags, frm, mstatus, dwArg0168, out a0_208, out s3_212, out s4_576, out s8_577);
			a0_208->t0054 = s0_211;
			a5_189.u0 = 432;
l23012DFE:
			ra = txl_cntrl_push(ra, s0_211, s3_212, a5_189, mstatus, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg68, dwArg6C, dwArg98, dwArgCC, out s1_283, out a4_278, out s2, out s3_212, out s5, out s6, out s7, out s8);
l23012E06:
			0x00 = dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_283;
			a4Out = a4_278;
			s2Out = s2;
			s3Out = s3_212;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = s8;
			return ra;
		}
		a4_29 = (struct Eq_32691 *) 0x01;
		if (a6_42 == 0x01 && a0_25 != 0x00)
			goto l23012E72;
	}
	Eq_2 a5_56 = txl_cntrl_inc_pck_cnt(a4_29);
	__csrrc(mstatus, 0x08);
	s1_283 = txl_cfm_push((struct Eq_31995 *) 0xC0000000, a1, a5_56, mstatus, out a4_278);
	__csrrs(mstatus, 0x08);
	goto l23012E06;
}

// 23012F3A: Register Eq_2 txu_cntrl_tkip_mic_append(Register Eq_2 s0, Register (ptr32 Eq_32820) a0, Register Eq_2 a1, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out Eq_2 a1Out, Register out Eq_33100 a3Out, Register out Eq_33101 a4Out, Register out (ptr32 Eq_33102) s2Out, Register out (ptr32 Eq_33103) s3Out, Register out (ptr32 Eq_33104) s4Out, Register out Eq_33105 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      txl_payload_handle_backup
Eq_2 txu_cntrl_tkip_mic_append(Eq_2 s0, struct Eq_32820 * a0, Eq_2 a1, Eq_2 dwArgF8, Eq_2 dwArg0128, union Eq_2 & a1Out, union Eq_33100 & a3Out, union Eq_33101 & a4Out, struct Eq_33102 & s2Out, struct Eq_33103 & s3Out, struct Eq_33104 & s4Out, union Eq_33105 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_33100 a3_106 = 432;
	Eq_33101 a4_107 = (word32) a0->b0030 + 432;
	if (a1 != 0x00)
	{
		word32 a5_27 = (word32) *((word32) a1 + 96);
		Eq_33101 a4_157 = 0x01;
		Eq_2 a0_29 = *((word32) s0 + 0x0068);
		if (a5_27 != 0x01)
		{
			if (a5_27 != 0x00)
			{
				a4_157.u0 = 0x03;
				if (a5_27 != 0x03)
					goto l23013044;
			}
			do
			{
				Eq_2 a5_166 = *((word32) a4_157 + 4);
			} while (a4_157 != 0x00);
			*((word32) s0 + 304) = a5_166;
			*((word32) s0 + 308) = (word32) s0 + 320;
			*((word32) s0 + 312) = (word32) s0 + 323;
			((word32) s0 + 300)->u0 = ~0x35010521;
			*((word32) s0 + 316) = 0x00;
			((word32) s0 + 304)->u0 = 0x00;
			a4_157 = (word32) s0 + 300;
l23013044:
			0x00 = (int8) dwArg0128;
			a1Out = a1;
			a3Out = a3_106;
			a4Out = a4_157;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			s8Out = dwArg58;
			s9Out = s9;
			s10Out = s10;
			return s1;
		}
		do
		{
			Eq_2 a5_33 = *(union Eq_2 *) 0x05;
		} while (true);
		*((word32) s0 + 304) = a5_33;
		*((word32) s0 + 308) = (word32) s0 + 320;
		*((word32) s0 + 312) = (word32) s0 + 331;
		((word32) s0 + 300)->u0 = ~0x35010521;
		*((word32) s0 + 316) = 0x00;
		((word32) s0 + 304)->u0 = 0x00;
		struct Eq_54129 * s1_67;
		word32 s3_69;
		word32 s4_70;
		word32 s8_374;
		word32 a3_375;
		word32 s2_373;
		word32 a2_113;
		int32 a1_115;
		me_mic_calc(fp + -48, &me_mic_init(fp + -48, (word32) a0_29 + 20, (word32) a0_29 + 26, (word32) *((word32) a0_29 + 46), out s1_67, out s2_373, out s3_69, out s4_70, out s8_374)->b0008 + 0x0144 - s4_70 + s3_69, (word32) s1_67->b005F, dwLoc14, dwArgF8, out s1, out a1_115, out a2_113, out a3_375, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10);
		int32 s0_140 = s2->dw003C;
		while (s0_140 != 0x00)
		{
			if (s1 == 0x00)
			{
				word32 a2_144;
				word32 a4_380;
				word32 a5_381;
				word32 a3_379;
				a1 = me_mic_end(s1, fp + -48, out a2_144, out a3_379, out a4_380, out a5_381);
				do
				{
					a3_106 = (word32) *((word32) s1 + (fp + -48));
					a4_157 = (word32) s1 + a2_144;
					*a4_157 = (byte) a3_106;
					s1 = (word32) s1 + 1;
				} while (s1 != 0x08);
				goto l23013044;
			}
			word32 a3_378;
			s0_140 = me_mic_calc(fp + -48, a1_115, a2_113 + 0x01 - a1_115, dwLoc14, dwArgF8, out s1, out a1_115, out a2_113, out a3_378, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10)->dw0004;
		}
		word32 a5_377;
		word32 a2_376;
		a1 = me_mic_end(s1, fp + -48, out a2_376, out a3_106, out a4_107, out a5_377);
		__ebreak();
	}
	a1Out = a1;
	a3Out = a3_106;
	a4Out = a4_107;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	return s1;
}

// 2301307C: Register Eq_2 txu_cntrl_cfm(Register (ptr32 Eq_32068) a5, Stack Eq_2 dwArg38, Register out Eq_32070 s1Out, Register out Eq_2 a1Out, Register out (ptr32 Eq_32072) a4Out, Register out Eq_32073 a5Out, Register out (ptr32 int32) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 mstatusOut)
// Called from:
//      txl_cfm_evt
//      txl_cfm_flush
Eq_2 txu_cntrl_cfm(struct Eq_32068 * a5, Eq_2 dwArg38, union Eq_32070 & s1Out, union Eq_2 & a1Out, struct Eq_32072 & a4Out, union Eq_32073 & a5Out, int32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & mstatusOut)
{
	struct Eq_54250 * a5_19;
	struct Eq_54251 * a0_13 = a5->ptr006C;
	ui32 a5_17 = (word32) a0_13->w0032;
	struct Eq_54251 * s0_14 = a0_13;
	int32 * s2_15 = a0_13->ptr0010;
	struct Eq_32072 * a4_18 = a5_17 & 8;
	if ((a5_17 & 8) != 0x00)
	{
		if ((a5_17 & 32) != 0x00)
		{
			a4_18 = (a5_17 & 32) << 0x08;
			if (a4_18 >= null)
				rxu_cntrl_get_pm();
		}
		ui32 a5_27 = (word32) a0_13->w0032;
		a5_19 = a5_27 & 0x0200;
		if ((a5_27 & 0x0200) == 0x00)
		{
l2301310C:
			struct Eq_54311 * s1_67 = a5_19->ptr0010;
			(a5_19 | 1)->ptr0010 = s1_67;
			s1_67->w000C = 0x0101;
			s0_14->dw0FAC = 0x00;
			Eq_32070 s1_74 = *(union Eq_32070 *) 0x0111;
			*s2_15 = 0x0101;
			0x00 = (int8) dwArg38;
			s1Out = s1_74;
			a1Out.u0 = <invalid>;
			a4Out = a4_18;
			a5Out.u0 = 0x0101;
			s2Out = s2_15;
			s3Out.u0 = <invalid>;
			s4Out.u0 = <invalid>;
			s5Out.u0 = <invalid>;
			mstatusOut.u0 = <invalid>;
			return <invalid>;
		}
		if ((word32) a0_13->b0030 == 0x00FF)
			assert_err();
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg172 = <invalid>;
		Eq_2 stackArg408 = <invalid>;
		word32 s1_135;
		word32 a0_136;
		word32 a1_137;
		word32 a2_138;
		word32 a3_139;
		word32 a5_140;
		word32 s3_141;
		word32 s4_142;
		word32 s5_143;
		word32 s6_144;
		word32 s7_145;
		word32 s9_146;
		word32 s10_147;
		word32 s11_148;
		txl_frame_send_qosnull_frame(s9, s10, fflags, frm, mstatus, stackArg120, stackArg172, stackArg408, out s0_14, out s1_135, out a0_136, out a1_137, out a2_138, out a3_139, out a5_140, out s2_15, out s3_141, out s4_142, out s5_143, out s6_144, out s7_145, out s9_146, out s10_147, out s11_148);
	}
	else
	{
		a5_19 = a5_17 & 0x0200;
		if ((a5_17 & 0x0200) == 0x00)
			goto l2301310C;
	}
	struct Eq_54298 * a4_58 = (word32) s0_14->b0030;
	a4_58->dw4201EC44 = 0x00;
	a4_18 = (struct Eq_32072 *) ((char *) a4_58 + 432);
	a5_19 = (struct Eq_54250 *) ((char *) a4_58 + 1107422224);
	goto l2301310C;
}

// 23013132: Register word32 txu_cntrl_protect_mgmt_frame(Register (ptr32 Eq_6750) a0, Register (ptr32 Eq_51373) a1, Register word32 a2, Register out (ptr32 Eq_51373) s1Out)
// Called from:
//      sm_auth_send
word32 txu_cntrl_protect_mgmt_frame(struct Eq_6750 * a0, struct Eq_51373 * a1, word32 a2, struct Eq_51373 & s1Out)
{
	word32 a0_16;
	word32 a1_13 = (word32) a0->b005E;
	if (a1_13 == 0x00)
	{
		word32 a5_24;
		a0_16 = txu_cntrl_sechdr_len_compute(a0, fp + -20, out a5_24);
		a0->b005E = (byte) a0_16;
		a0->b0060 = (byte) a5_24;
	}
	else
		a0_16 = a1_13;
	ui32 a5_46 = (word32) a1->b0001 << 8 | (word32) a1->b0000;
	a1->b0000 = (byte) (a5_46 | 0x04000000);
	a1->b0001 = (byte) ((a5_46 | 0x04000000) >> 8);
	txu_cntrl_sec_hdr_append(a0, a1 + a2 / 2 + a0_16 / 2, 0x00);
	s1Out = a1;
	return dwArgE4;
}

// 23013194: Register Eq_2 _aid_list_delete(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArgA8, Register out ptr32 s0Out, Register out ptr32 s1Out)
// Called from:
//      apm_tx_cfm_handler
//      apm_sta_remove
Eq_2 _aid_list_delete(Eq_2 ra, Eq_2 a0, Eq_2 dwArgA8, ptr32 & s0Out, ptr32 & s1Out)
{
	struct Eq_54445 * s2_23 = &g_ptr42021760;
	byte * s0_24 = g_a42021785;
	do
	{
		if ((word32) s2_23->b001E != 0x00)
		{
			Eq_2 s4_30 = (char *) s2_23 + 24;
			word32 a1_153;
			word32 a3_155;
			word32 a2_154;
			word32 a5_157;
			word32 a4_156;
			if (memcmp(s4_30, a0, 0x06, out a1_153, out a2_154, out a3_155, out a4_156, out a5_157) == 0x00)
			{
				word32 t1_158;
				word32 a0_159;
				word32 a1_160;
				word32 a2_161;
				word32 a3_162;
				word32 a4_163;
				word32 a5_164;
				ra = memset(ra, s4_30, 0x00, 0x06, out t1_158, out a0_159, out a1_160, out a2_161, out a3_162, out a4_163, out a5_164);
				*s0_24 = 0x00;
				break;
			}
		}
		++s0_24;
		++s2_23;
	} while (s0_24 != (byte *) 3187533957);
	0x00 = (int8) dwArgA8;
	s0Out = s1;
	s1Out = 0x42021760;
	return ra;
}

