pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23013208: Register Eq_2 apm_sta_delete(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      apm_sta_fw_delete
//      apm_auth_handler
//      apm_deauth_handler
//      apm_disassoc_handler
//      apm_sta_remove
Eq_2 apm_sta_delete(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArgF8, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a4_29;
	Eq_2 s3_60;
	word32 s1_74;
	word32 s0_175;
	word32 s1_176;
	word32 a0_177;
	word32 a1_178;
	word32 a2_179;
	word32 a3_180;
	word32 a5_181;
	word32 a6_182;
	word32 s2_183;
	word32 s3_184;
	word32 s4_185;
	word32 s8_186;
	word32 s0_187;
	word32 s1_188;
	word32 a0_189;
	word32 a1_190;
	word32 a2_191;
	word32 a3_192;
	word32 a4_193;
	word32 a5_194;
	word32 a6_195;
	word32 s2_196;
	word32 s4_197;
	word32 s8_198;
	word32 s0_199;
	Eq_2 ra_86 = _aid_list_delete(ke_msg_alloc(ke_msg_alloc(ra, 0x01000409, 0x05, 0x02, a4, mstatus, dwLoc08, out s0_175, out s1_176, out a0_177, out a1_178, out a2_179, out a3_180, out a4_29, out a5_181, out a6_182, out s2_183, out s3_184, out s4_185, out s8_186), 0x01FFFC09, 0x0D, 0x01, a4_29, mstatus, dwLoc08, out s0_187, out s1_188, out a0_189, out a1_190, out a2_191, out a3_192, out a4_193, out a5_194, out a6_195, out s2_196, out s3_60, out s4_197, out s8_198), s3_60, dwArg88, out s0_199, out s1_74);
	Eq_2 s2_100;
	word32 a2_200;
	word32 a4_201;
	word32 s3_202;
	word32 s6_203;
	Eq_2 s1_99 = mm_sec_machwkey_del(s1_74 + 8 & 0x00FF, dwArgF8, out a2_200, out a4_201, out s2_100, out s3_202, out s6_203);
	g_t42021776 = (byte) ((word32) g_t42021776 + ~0x00);
	*s2_100 = (byte) s1_99;
	word32 s1_123;
	word32 a0_204;
	word32 a1_205;
	word32 a2_206;
	word32 a3_207;
	word32 a4_208;
	word32 a5_209;
	word32 s2_210;
	word32 s3_211;
	word32 s4_212;
	word32 s8_213;
	Eq_2 s0_122 = ke_msg_send(s2_100, mstatus, out s1_123, out a0_204, out a1_205, out a2_206, out a3_207, out a4_208, out a5_209, out s2_210, out s3_211, out s4_212, out s8_213);
	*s0_122 = (byte) s1_123;
	*((word32) s0_122 + 1) = 0x00;
	ptr32 a3_142;
	ptr32 a4_143;
	ptr32 s1_147;
	ptr32 s2_148;
	ptr32 s3_149;
	ptr32 s4_150;
	word32 a0_214;
	word32 a1_215;
	word32 a2_216;
	word32 a5_217;
	word32 s8_218;
	s0Out = ke_msg_send(s0_122, mstatus, out s1_147, out a0_214, out a1_215, out a2_216, out a3_142, out a4_143, out a5_217, out s2_148, out s3_149, out s4_150, out s8_218);
	s1Out = s1_147;
	a3Out = a3_142;
	a4Out = a4_143;
	s2Out = s2_148;
	s3Out = s3_149;
	s4Out = s4_150;
	return ra_86;
}

// 23013284: void apm_tx_cfm_handler(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C)
void apm_tx_cfm_handler(Eq_2 ra, Eq_2 a0, ui32 a1, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C)
{
	if (a1 << 0x08 >= 0x00)
	{
		word32 s0_17;
		word32 s1_167;
		Eq_2 ra_30 = _aid_list_delete(ra, a0, dwArg88, out s0_17, out s1_167);
		Eq_2 a3_36;
		word32 s1_168;
		word32 a4_169;
		word32 a5_170;
		word32 s2_171;
		word32 s4_172;
		ke_msg_free(s0_17 + -0x0C, mstatus, out s1_168, out a3_36, out a4_169, out a5_170, out s2_171, out s4_172);
		word32 s1_173;
		word32 a0_174;
		word32 a1_175;
		word32 a2_176;
		word32 a3_177;
		word32 a4_178;
		word32 a5_179;
		word32 a7_180;
		word32 s2_181;
		word32 s3_182;
		word32 s4_183;
		word32 s5_184;
		word32 s6_185;
		word32 s7_186;
		word32 s8_187;
		word32 s9_188;
		word32 s10_189;
		word32 s11_190;
		word32 t4_191;
		printf(ra_30, &g_t230AC94C, a3_36, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_173, out a0_174, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179, out a7_180, out s2_181, out s3_182, out s4_183, out s5_184, out s6_185, out s7_186, out s8_187, out s9_188, out s10_189, out s11_190, out t4_191);
		g_t42021776 = (byte) ((word32) g_t42021776 + ~0x00);
	}
	else if ((word32) *((word32) a0 + 0x0044) == 0x00)
	{
		word32 s1_203;
		word32 a3_204;
		word32 a4_205;
		word32 a5_206;
		word32 s2_207;
		word32 s4_208;
		ke_msg_free((word32) a0 - 0x0C, mstatus, out s1_203, out a3_204, out a4_205, out a5_206, out s2_207, out s4_208);
	}
	else
	{
		word32 s1_192;
		word32 a0_193;
		word32 a1_194;
		word32 a2_195;
		word32 a3_196;
		word32 a4_197;
		word32 a5_198;
		word32 s2_199;
		word32 s3_200;
		word32 s4_201;
		word32 s8_202;
		ke_msg_send(a0, mstatus, out s1_192, out a0_193, out a1_194, out a2_195, out a3_196, out a4_197, out a5_198, out s2_199, out s3_200, out s4_201, out s8_202);
	}
}

// 230132EA: Register Eq_2 apm_init(Register Eq_2 ra, Register ptr32 mstatus)
// Called from:
//      me_init
Eq_2 apm_init(Eq_2 ra, ptr32 mstatus)
{
	word32 t1_48;
	word32 a0_49;
	word32 a1_50;
	word32 a2_51;
	word32 a3_52;
	word32 a4_53;
	word32 a5_54;
	Eq_2 ra_18 = memset(ra, 0x42021760, 0x00, 96, out t1_48, out a0_49, out a1_50, out a2_51, out a3_52, out a4_53, out a5_54);
	g_b4202176C = 0x00;
	g_t42021776.u1 = 0xFC00;
	word32 s1_55;
	word32 a0_56;
	word32 a1_57;
	word32 a4_58;
	word32 a5_59;
	word32 s2_60;
	word32 s3_61;
	word32 s4_62;
	ke_state_set(0x07, 0x00, mstatus, out s1_55, out a0_56, out a1_57, out a4_58, out a5_59, out s2_60, out s3_61, out s4_62);
	return ra_18;
}

// 23013322: void apm_start_cfm(Register Eq_2 ra, Register word32 a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgD8, Stack word32 dwArg0128)
// Called from:
//      mm_bcn_change_cfm_handler
void apm_start_cfm(Eq_2 ra, word32 a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgD8, word32 dwArg0128)
{
	struct Eq_54859 * a0_35;
	word32 s0_282;
	word32 s1_283;
	word32 a1_284;
	word32 a2_285;
	word32 a5_286;
	word32 a6_287;
	word32 s3_288;
	word32 s4_289;
	word32 s8_290;
	Eq_2 s2_153;
	Eq_2 a4_141;
	Eq_2 a3_140;
	Eq_2 ra_161 = ke_msg_alloc(ra, 0x01FFFC01, 0x0D, 0x04, a4, mstatus, dwLoc18, out s0_282, out s1_283, out a0_35, out a1_284, out a2_285, out a3_140, out a4_141, out a5_286, out a6_287, out s2_153, out s3_288, out s4_289, out s8_290);
	struct Eq_54859 * s3_151 = a0_35;
	if (a0 == 0x00)
	{
		struct Eq_54957 * s5_56 = (word32) *((word32) s2_153 + 0x0033);
		Eq_2 a0_60;
		word32 s0_306;
		word32 s1_307;
		word32 a1_308;
		word32 a2_309;
		word32 a3_310;
		word32 a4_311;
		word32 a5_312;
		word32 a6_313;
		word32 s2_314;
		word32 s3_315;
		word32 s4_316;
		word32 s8_317;
		ra_161 = ke_msg_alloc(ra_161, 0x1E, 0x00, 0x04, a4_141, mstatus, dwLoc18, out s0_306, out s1_307, out a0_60, out a1_308, out a2_309, out a3_310, out a4_311, out a5_312, out a6_313, out s2_314, out s3_315, out s4_316, out s8_317);
		*((word32) a0_60 + 2) = 0x01;
		*((word32) a0_60 + 3) = (byte) (word32) s5_56->b420205A7;
		struct Eq_55005 * s1_97;
		word32 s8_101;
		word32 a0_318;
		word32 a1_319;
		word32 a2_320;
		word32 a3_321;
		word32 a4_322;
		word32 a5_323;
		word32 s4_324;
		Eq_2 s0_96 = ke_msg_send(a0_60, mstatus, out s1_97, out a0_318, out a1_319, out a2_320, out a3_321, out a4_322, out a5_323, out s2_153, out s3_151, out s4_324, out s8_101);
		s1_97->t05C4 = *((word32) s2_153 + 44);
		struct Eq_55034 * a5_109 = (word32) *((word32) s2_153 + 48);
		s1_97->b034A = 0x00;
		s1_97->w034C = (word16) a5_109;
		s3_151->b0002 = (byte) (word32) a5_109->b0017;
		s3_151->b0003 = (byte) ((word32) *((word32) s2_153 + 0x0033) + 0x0A);
		word32 s0_120 = s0_96 + (s5_56 + 442);
		word32 a1_325;
		word32 a2_326;
		word32 a3_327;
		word32 a4_328;
		word32 a5_329;
		word32 a6_330;
		word32 a7_331;
		memcpy(&s0_120->b00B0, s2_153, 0x0D, out a1_325, out a2_326, out a3_327, out a4_328, out a5_329, out a6_330, out a7_331);
		s0_120->b0031 = 0x02;
		a3_140 = me_init_bcmc_rate(s0_120, out a4_141);
		ui32 a5_143 = (word32) s0_120->b011A;
		s0_120->w001E = (word16) s8_101;
		s0_120->b011A = (byte) (a5_143 | 16);
		s0_120->b001B = (byte) ((word32) *((word32) s2_153 + 0x0033) + 0x0A);
	}
	s3_151->t0000 = (byte) a0;
	s3_151->b0001 = (byte) (word32) *((word32) s2_153 + 0x0033);
	word32 s2_193;
	word32 s1_291;
	word32 a0_292;
	word32 a1_293;
	word32 a2_294;
	word32 a3_295;
	word32 a4_296;
	word32 a5_297;
	word32 s3_298;
	word32 s4_299;
	word32 s8_300;
	ke_msg_send(ke_timer_set(ra_161, 0x01FFFC0A, 0x07, 5000000, a3_140, a4_141, mstatus, dwLoc18, dwArg78, dwArgD8), mstatus, out s1_291, out a0_292, out a1_293, out a2_294, out a3_295, out a4_296, out a5_297, out s2_193, out s3_298, out s4_299, out s8_300);
	word32 * s4_210;
	word32 s1_301;
	word32 a3_302;
	word32 a4_303;
	word32 a5_304;
	word32 s2_305;
	ke_msg_free(s2_193 + -0x0C, mstatus, out s1_301, out a3_302, out a4_303, out a5_304, out s2_305, out s4_210);
	*s4_210 = 0x00;
	0x00 = dwArg0128;
	word32 s1_332;
	word32 a0_333;
	word32 a1_334;
	word32 a4_335;
	word32 a5_336;
	word32 s2_337;
	word32 s3_338;
	word32 s4_339;
	ke_state_set(0x07, 0x00, mstatus, out s1_332, out a0_333, out a1_334, out a4_335, out a5_336, out s2_337, out s3_338, out s4_339);
}

