pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23013450: Register word32 apm_send_next_bss_param(Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
// Called from:
//      apm_set_bss_param
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
word32 apm_send_next_bss_param(Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	word32 a5_43;
	Eq_2 a0_12 = co_list_pop_front(a4, a5, out a5_43);
	if (a0_12 != 0x00)
	{
		word32 a3_27;
		word32 s1_44;
		word32 a0_45;
		word32 a1_46;
		word32 a2_47;
		word32 a4_48;
		word32 a5_49;
		word32 s2_50;
		word32 s3_51;
		word32 s4_52;
		word32 s8_53;
		ke_msg_send((word32) a0_12 + 0x0C, mstatus, out s1_44, out a0_45, out a1_46, out a2_47, out a3_27, out a4_48, out a5_49, out s2_50, out s3_51, out s4_52, out s8_53);
		return a3_27;
	}
	else
		assert_err();
}

// 2301348C: Register Eq_2 apm_set_bss_param(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_55188) s5Out)
// Called from:
//      apm_start_req_handler
Eq_2 apm_set_bss_param(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_55188 & s5Out)
{
	struct Eq_55189 * s7_31 = (word32) g_ptr42021760->b0033;
	Eq_2 a4_38;
	Eq_2 a0_57;
	Eq_2 a4_61;
	Eq_2 a4_84;
	Eq_2 a4_107;
	word32 s1_112;
	struct Eq_38256 * s0_134;
	struct Eq_55203 * s2_136;
	struct Eq_55204 * s3_137;
	word32 s0_293;
	word32 s1_294;
	word32 a0_295;
	word32 a1_296;
	word32 a2_297;
	word32 a3_298;
	word32 a5_299;
	word32 a6_300;
	word32 s2_301;
	word32 s3_302;
	word32 s4_303;
	word32 s8_304;
	word32 s0_305;
	word32 s1_306;
	word32 a1_307;
	word32 a2_308;
	word32 a3_309;
	word32 a5_310;
	word32 a6_311;
	word32 s2_312;
	word32 s3_313;
	word32 s4_314;
	word32 s8_315;
	word32 s0_316;
	word32 s1_317;
	word32 a0_318;
	word32 a1_319;
	word32 a2_320;
	word32 a3_321;
	word32 a5_322;
	word32 a6_323;
	word32 s2_324;
	word32 s3_325;
	word32 s4_326;
	word32 s8_327;
	word32 s0_328;
	word32 a0_329;
	word32 a1_330;
	word32 a2_331;
	word32 a3_332;
	word32 a5_333;
	word32 a6_334;
	word32 s2_335;
	word32 s3_336;
	word32 s4_337;
	word32 s8_338;
	word32 s1_339;
	word32 a0_340;
	word32 a1_341;
	word32 a2_342;
	word32 a3_343;
	word32 a4_344;
	word32 a5_345;
	word32 a6_346;
	word32 s4_347;
	word32 s8_348;
	Eq_2 ra_133 = ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, a4, mstatus, dwLoc18, out s0_293, out s1_294, out a0_295, out a1_296, out a2_297, out a3_298, out a4_38, out a5_299, out a6_300, out s2_301, out s3_302, out s4_303, out s8_304), 0x18, 0x00, 0x07, a4_38, mstatus, dwLoc18, out s0_305, out s1_306, out a0_57, out a1_307, out a2_308, out a3_309, out a4_61, out a5_310, out a6_311, out s2_312, out s3_313, out s4_314, out s8_315), 22, 0x00, 0x08, a4_61, mstatus, dwLoc18, out s0_316, out s1_317, out a0_318, out a1_319, out a2_320, out a3_321, out a4_84, out a5_322, out a6_323, out s2_324, out s3_325, out s4_326, out s8_327), 0x14, 0x00, 0x04, a4_84, mstatus, dwLoc18, out s0_328, out s1_112, out a0_329, out a1_330, out a2_331, out a3_332, out a4_107, out a5_333, out a6_334, out s2_335, out s3_336, out s4_337, out s8_338), s1_112 + 0x0411, 0x05, 0x02, a4_107, mstatus, dwLoc18, out s0_134, out s1_339, out a0_340, out a1_341, out a2_342, out a3_343, out a4_344, out a5_345, out a6_346, out s2_136, out s3_137, out s4_347, out s8_348);
	s2_136->b0000 = 0x01;
	Eq_2 a5_153 = (word32) s7_31->b420205A7;
	s2_136->b0001 = (byte) a5_153;
	word32 a1_349;
	word32 a2_350;
	word32 a3_351;
	word32 a4_352;
	word32 a5_353;
	word32 a6_354;
	word32 a7_355;
	memcpy(a0_57, (word32) co_list_push_back((char *) s2_136 - 0x0C, a5_153) + 80, 0x06, out a1_349, out a2_350, out a3_351, out a4_352, out a5_353, out a6_354, out a7_355);
	Eq_2 a5_176 = (word32) s0_134->b0033;
	*((word32) a0_57 + 6) = (byte) a5_176;
	co_list_push_back((word32) a0_57 - 0x0C, a5_176);
	s3_137->b0005 = (byte) (word32) s0_134->b0010;
	word32 a0_187;
	Eq_2 a4_190;
	struct Eq_55413 * s3_196;
	struct Eq_55414 * s4_197;
	struct Eq_55188 * s5_198;
	word32 s8_201;
	word32 s1_356;
	word32 s2_357;
	word32 s6_358;
	word32 s7_359;
	Eq_2 s0_193 = me_legacy_rate_bitfield_build(s0_134, 0x01, dwArgF8, out s1_356, out a0_187, out a4_190, out s2_357, out s3_196, out s4_197, out s5_198, out s6_358, out s7_359, out s8_201);
	s3_196->dw0000 = a0_187;
	Eq_2 a5_205 = (word32) *((word32) s0_193 + 0x0033);
	s3_196->b0004 = (byte) a5_205;
	co_list_push_back((char *) s3_196 - 0x0C, a5_205);
	s5_198->w0000 = (word16) (word32) *((word32) s0_193 + 40);
	Eq_2 a5_216 = (word32) *((word32) s0_193 + 0x0033);
	s5_198->b0002 = (byte) a5_216;
	co_list_push_back((char *) s5_198 - 0x0C, a5_216);
	s4_197->b0000 = (byte) s8_201;
	Eq_2 a5_222 = (word32) *((word32) s0_193 + 0x0033);
	s4_197->b0001 = (byte) a5_222;
	co_list_push_back((char *) s4_197 - 0x0C, a5_222);
	ptr32 a3_232 = apm_send_next_bss_param(a4_190, a5_222, mstatus);
	0x00 = (int8) dwArg0128;
	ptr32 s2_263;
	ptr32 s3_264;
	word32 s1_360;
	word32 a0_361;
	word32 a1_362;
	word32 a4_363;
	word32 a5_364;
	word32 s4_365;
	ke_state_set(0x07, 0x01, mstatus, out s1_360, out a0_361, out a1_362, out a4_363, out a5_364, out s2_263, out s3_264, out s4_365);
	a3Out = a3_232;
	s2Out = s2_263;
	s3Out = s3_264;
	s5Out = s5_198;
	return ra_133;
}

// 230135C8: Register Eq_2 apm_stop(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 a4Out, Register out ptr32 s2Out)
// Called from:
//      apm_stop_req_handler
Eq_2 apm_stop(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & a4Out, ptr32 & s2Out)
{
	Eq_2 a4_25;
	word32 s1_30;
	Eq_2 s0_52;
	struct Eq_55531 * s0_76;
	Eq_2 s2_77;
	word32 s0_256;
	word32 a0_257;
	word32 a1_258;
	word32 a2_259;
	word32 a3_260;
	word32 a5_261;
	word32 a6_262;
	word32 s2_263;
	word32 s3_264;
	word32 s4_265;
	word32 s8_266;
	word32 s1_267;
	word32 a0_268;
	word32 a1_269;
	word32 a2_270;
	word32 a3_271;
	word32 a4_272;
	word32 a5_273;
	word32 a6_274;
	word32 s2_275;
	word32 s3_276;
	word32 s4_277;
	word32 s8_278;
	word32 s1_279;
	word32 a3_280;
	Eq_2 ra_113 = ke_timer_clear(ke_msg_alloc(ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, a4, mstatus, dwArg08, out s0_256, out s1_30, out a0_257, out a1_258, out a2_259, out a3_260, out a4_25, out a5_261, out a6_262, out s2_263, out s3_264, out s4_265, out s8_266), s1_30 + 0x0411, 0x05, 0x02, a4_25, mstatus, dwArg08, out s0_52, out s1_267, out a0_268, out a1_269, out a2_270, out a3_271, out a4_272, out a5_273, out a6_274, out s2_275, out s3_276, out s4_277, out s8_278), s0_52, 0x01FFFC0A, 0x07, mstatus, dwArg0108, out s0_76, out s1_279, out a3_280, out s2_77);
	*s2_77 = 0x00;
	*((word32) s2_77 + 1) = (byte) (word32) s0_76->b0057;
	Eq_2 a4_89;
	word32 a0_281;
	word32 a1_282;
	word32 a2_283;
	word32 a5_284;
	word32 s2_285;
	word32 s3_286;
	word32 s4_287;
	word32 s8_288;
	Eq_2 a3_129;
	Eq_2 s1_134;
	struct Eq_55627 * a5_101 = (word32) *((word32) ke_msg_send(s2_77, mstatus, out s1_134, out a0_281, out a1_282, out a2_283, out a3_129, out a4_89, out a5_284, out s2_285, out s3_286, out s4_287, out s8_288) + 88);
	if (a5_101 != null)
	{
		Eq_2 a0_106;
		struct Eq_55654 * s0_114;
		word32 s1_289;
		word32 a1_290;
		word32 a2_291;
		word32 a3_292;
		word32 a4_293;
		word32 a5_294;
		word32 a6_295;
		word32 s2_296;
		word32 s3_297;
		word32 s4_298;
		word32 s8_299;
		ra_113 = ke_msg_alloc(ra_113, 0x1E, 0x00, 0x04, a4_89, mstatus, dwArg08, out s0_114, out s1_289, out a0_106, out a1_290, out a2_291, out a3_292, out a4_293, out a5_294, out a6_295, out s2_296, out s3_297, out s4_298, out s8_299);
		*((word32) a0_106 + 2) = 0x00;
		*((word32) a0_106 + 3) = (byte) (word32) s0_114->b0057;
		word32 a0_300;
		word32 a1_301;
		word32 a2_302;
		word32 a4_303;
		word32 s2_304;
		word32 s3_305;
		word32 s4_306;
		word32 s8_307;
		ke_msg_send(a0_106, mstatus, out s1_134, out a0_300, out a1_301, out a2_302, out a3_129, out a4_303, out a5_101, out s2_304, out s3_305, out s4_306, out s8_307);
	}
	Eq_2 s0_144 = a5_101->t0040;
	if (a5_101 != null)
	{
		word32 a4_308;
		word32 s6_309;
		word32 s10_310;
		ra_113 = chan_ctxt_unlink(ra_113, s0_144, (word32) *((word32) s0_144 + 87), a3_129, mstatus, dwLoc08, dwArg18, dwArg28, dwArg88, dwArgF8, dwArg0158, out s1_134, out a4_308, out s6_309, out s10_310);
	}
	*s1_134 = 0x00;
	*((word32) s1_134 + 1) = (byte) (word32) *((word32) s0_144 + 87);
	0x00 = (int8) dwArg38;
	ptr32 a4_189;
	ptr32 s2_194;
	word32 s1_311;
	word32 a0_312;
	word32 a1_313;
	word32 a2_314;
	word32 a3_315;
	word32 a5_316;
	word32 s3_317;
	word32 s4_318;
	word32 s8_319;
	s0Out = ke_msg_send(s1_134, mstatus, out s1_311, out a0_312, out a1_313, out a2_314, out a3_315, out a4_189, out a5_316, out s2_194, out s3_317, out s4_318, out s8_319);
	a4Out = a4_189;
	s2Out = s2_194;
	return ra_113;
}

