pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23014488: void co_list_init(Register (ptr32 Eq_24073) a0)
// Called from:
//      mm_init
//      mm_timer_init
//      rxl_init
//      rxl_reset
//      sta_mgmt_init
//      txl_cfm_init
//      txl_cntrl_init
//      txl_reset
//      txl_frame_init
//      vif_mgmt_init
//      sm_set_bss_param
//      hal_dma_init
void co_list_init(struct Eq_24073 * a0)
{
	a0->dw0000 = 0x00;
	a0->dw0004 = 0x00;
}

// 23014492: Register Eq_2 co_list_push_back(Register Eq_2 a1, Register Eq_2 a5)
// Called from:
//      mm_tim_update
//      rxl_timer_int_handler
//      sta_mgmt_init
//      sta_mgmt_register
//      sta_mgmt_unregister
//      txl_cfm_push
//      txl_cntrl_push_int
//      txl_cntrl_push
//      txl_frame_init
//      txl_frame_push_force
//      txl_frame_cfm
//      txl_frame_release
//      txl_frame_evt
//      vif_mgmt_init
//      vif_mgmt_register
//      vif_mgmt_unregister
//      rxu_mpdu_upload_and_indicate.constprop.11
//      rxu_cntrl_frame_handle
//      scanu_start
//      sm_set_bss_param
//      apm_set_bss_param
//      apm_tx_int_ps_postpone
//      apm_bcn_set
//      ke_task_schedule
//      chan_tbtt_insert
//      chan_init
//      chan_ctxt_del
//      chan_ctxt_link
Eq_2 co_list_push_back(Eq_2 a1, Eq_2 a5)
{
	if (a1 != 0x00)
	{
		Eq_2 s1_20 = *a5;
		if (a5 == 0x00)
			*a1 = s1_20;
		else
		{
			s1_20 = *((word32) a5 + 4);
			*a1 = a5;
		}
		*((word32) a1 + 4) = s1_20;
		a1->u0 = 0x00;
		return s1_20;
	}
	else
		assert_err();
}

// 230144D4: Register Eq_2 co_list_push_front(Register Eq_2 a1, Register Eq_2 a5)
// Called from:
//      co_list_insert_after
Eq_2 co_list_push_front(Eq_2 a1, Eq_2 a5)
{
	if (a1 != 0x00)
	{
		Eq_2 s1_20 = *a5;
		if (a5 == 0x00)
			*((word32) a1 + 4) = s1_20;
		*a5 = a1;
		*a1 = s1_20;
		return s1_20;
	}
	else
		assert_err();
}

// 2301450E: Register Eq_2 co_list_pop_front(Register Eq_2 a4, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      mm_bcn_transmitted
//      mm_timer_schedule
//      rxl_cntrl_evt
//      sta_mgmt_entry_init
//      sta_mgmt_register
//      sta_mgmt_send_postponed_frame
//      txl_cfm_evt
//      txl_cfm_flush
//      txl_transmit_trigger
//      txl_frame_get
//      txl_frame_evt
//      vif_mgmt_register
//      rxu_swdesc_upload_evt
//      sm_send_next_bss_param
//      apm_send_next_bss_param
//      ke_task_schedule
//      ke_timer_clear
//      ke_timer_schedule
//      chan_upd_ctxt_status
//      chan_tbtt_schedule
//      chan_ctxt_add
//      hal_dma_evt
Eq_2 co_list_pop_front(Eq_2 a4, Eq_2 a5, union Eq_2 & a5Out)
{
	Eq_2 a0_5 = *a5;
	if (a5 != 0x00)
	{
		a5 = *a4;
		*a4 = a0_5;
	}
	a5Out = a5;
	return a5;
}

// 2301451A: Register Eq_2 co_list_extract(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      sta_mgmt_unregister
//      vif_mgmt_unregister
//      chan_tbtt_insert
//      chan_upd_ctxt_status
//      chan_tbtt_switch_update
//      chan_bcn_to_evt
//      chan_ctxt_unlink
Eq_2 co_list_extract(Eq_2 a0, Eq_2 a1, Eq_2 a4, Eq_2 a5, union Eq_2 & a5Out)
{
	Eq_2 s1_13 = a1;
	if (a0 != 0x00)
	{
		Eq_2 s0_20 = *a5;
		if (a5 != 0x00)
		{
			if (a5 == a1)
			{
				s1_13 = *a5;
				*a5 = s0_20;
			}
			else
			{
				do
				{
					a5 = *a4;
					if (a4 == 0x00)
						goto l2301454C;
				} while (a4 != a1);
				word32 s0_26 = *((word32) a4 + 4);
				if (a4 == a1)
					*((word32) a5 + 4) = s0_26;
				s1_13 = *a4;
				*a4 = a5;
			}
		}
l2301454C:
		a5Out = a5;
		return s1_13;
	}
	else
		assert_err();
}

// 2301456E: Register word32 co_list_cnt(Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      rxl_cntrl_dump
//      txl_cfm_dump
//      txl_cntrl_env_dump
//      txl_frame_get
//      txl_frame_dump
word32 co_list_cnt(Eq_2 a5, union Eq_2 & a5Out)
{
	word32 a0_6 = 0x00;
	while (a5 != 0x00)
	{
		++a0_6;
		a5 = *a5;
	}
	a5Out = a5;
	return a0_6;
}

// 2301457C: Register Eq_2 co_list_insert(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register (ptr32 code) a2, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out)
// Called from:
//      ke_timer_set
//      chan_upd_ctxt_status
Eq_2 co_list_insert(Eq_2 ra, Eq_2 s0, Eq_2 a1, <anonymous> * a2, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & s2Out, union Eq_2 & s3Out)
{
	struct Eq_58558 * sp_26 = fp + -48;
	Eq_2 s2_15 = *s0;
	Eq_2 s1_17 = a1;
	Eq_2 s3_18 = 0x00;
	while (s0 != 0x00)
	{
		sp_26->ptr0084 = a2;
		word32 a0_36;
		word32 a2_38;
		a2();
		if (a0_36 != 0x00)
			goto l230145A8;
		s3_18 = s0;
		a2 = sp_26->ptr0084;
		s0 = *s0;
	}
	*((word32) s2_15 + 4) = s1_17;
l230145A8:
	*s0 = s1_17;
	if (s3_18 != 0x00)
		*s3_18 = s1_17;
	else
		*s2_15 = s1_17;
	0x00 = (int8) dwArg0128;
	s1Out = s1_17;
	s2Out = s2_15;
	s3Out = s3_18;
	return dwArgE4;
}

// 230145C6: Register word32 co_list_insert_after(Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      chan_tbtt_insert
word32 co_list_insert_after(word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if (a1 != 0x00)
	{
		while (a5 != 0x00)
		{
			if (a5 == a1)
			{
				Eq_2 a5_13 = *a3;
				*a3 = a2;
				*a2 = a5_13;
				struct Eq_58628 * a2_17 = *a5_13;
				if (a5_13 == 0x00)
				{
					a2_17->dw0004 = a0;
					a0Out.u0 = <invalid>;
					a1Out = a1;
					a4Out.u0 = <invalid>;
					a5Out = a5_13;
					return s1;
				}
				else
				{
					a0Out.u0 = <invalid>;
					a1Out = a1;
					a4Out.u0 = <invalid>;
					a5Out = a5_13;
					return s1;
				}
			}
			a5 = *a5;
		}
		a0Out.u0 = <invalid>;
		a1Out = a1;
		a4Out.u0 = <invalid>;
		a5Out = a5;
		return s1;
	}
	else
	{
		word32 s1_24 = co_list_push_front(a2, a5);
		a0Out.u0 = <invalid>;
		a1Out = a2;
		a4Out.u0 = <invalid>;
		a5Out = a5;
		return s1_24;
	}
}

// 230145EC: Register Eq_2 co_list_remove(Register (ptr32 Eq_56037) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack word32 dwArg38, Register out Eq_2 a5Out, Register out (ptr32 Eq_56037) s2Out)
// Called from:
//      apm_tx_int_ps_get_postpone
Eq_2 co_list_remove(struct Eq_56037 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, word32 dwArg38, union Eq_2 & a5Out, struct Eq_56037 & s2Out)
{
	Eq_2 s1_15 = a1;
	if (a0 == null)
		assert_err();
	Eq_2 s0_35;
	if (a1 != 0x00)
	{
		s1_15 = *a5;
		if (a5 != a2)
			assert_err();
		if (a2 != 0x00)
		{
			s0_35 = *a5;
			*a5 = s1_15;
			a5 = a0->t0004;
			if (a5 == s0_35)
				a0->t0004 = s1_15;
l2301466C:
			*s0_35 = 0x00;
			0x00 = dwArg38;
			a5Out = a5;
			s2Out = a0;
			return s1_15;
		}
	}
	else if (a2 != 0x00)
	{
		s0_35 = *a5;
		a0->dw0000 = (int32) a5;
		goto l2301466C;
	}
	assert_err();
}

// 2301467C: Register (ptr32 Eq_23033) co_crc32(Register (ptr32 Eq_23033) a0, Register Eq_23037 a1, Register (ptr32 Eq_23033) a2, Register out Eq_23037 a4Out)
// Called from:
//      mm_check_beacon
struct Eq_23033 * co_crc32(struct Eq_23033 * a0, Eq_23037 a1, struct Eq_23033 * a2, union Eq_23037 & a4Out)
{
	Eq_23037 a4_20 = 0x00;
	while (a4_20 != a1)
	{
		a4_20 = (word32) a4_20.u1 + 1;
		a2 = a2 << 0x08 ^ 0x230ACACC[(a2 >>u 24 ^ CONVERT(Mem0[a4_20 + a0:byte], byte, word32)) * 0x04];
	}
	a4Out = a4_20;
	return a2;
}

// 230146AC: Register Eq_2 dbg_init(Register Eq_2 ra)
// Called from:
//      bl_init
Eq_2 dbg_init(Eq_2 ra)
{
	word32 t1_32;
	word32 a0_33;
	word32 a1_34;
	word32 a2_35;
	word32 a3_36;
	word32 a4_37;
	word32 a5_38;
	Eq_2 ra_18 = memset(ra, 0x420217C0, 0x00, 0x08, out t1_32, out a0_33, out a1_34, out a2_35, out a3_36, out a4_37, out a5_38);
	((union Eq_2 *) ~0x00)->u0 = 0x420217C0;
	((union Eq_2 *) 0x06)->u0 = 0x420217C0;
	return ra_18;
}

// 230146D6: Register Eq_2 ke_evt_set(Register Eq_5849 a0, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a5Out)
// Called from:
//      assert_rec
//      ipc_emb_tx_irq
//      ipc_emb_tx_evt
//      ipc_emb_cfmback_irq
//      ipc_emb_msg_irq
//      bl_irq_handler
//      hal_machw_gen_handler
//      rxl_timer_int_handler
//      rxl_cntrl_evt
//      txl_cfm_push
//      txl_frame_cfm
//      rxu_cntrl_frame_handle
//      rxu_cntrl_evt
//      scanu_start
//      apm_tx_int_ps_postpone
//      apm_bcn_set
//      bl60x_fw_dump_statistic
//      ke_timer_set
//      chan_upd_ctxt_status
Eq_2 ke_evt_set(Eq_5849 a0, Eq_2 a4, ptr32 mstatus, ptr32 & a5Out)
{
	__csrrc(mstatus, 0x08);
	ptr32 a5_7 = *a4;
	Eq_2 a4_9 = a4 | a0;
	*a4_9 = a5_7;
	__csrrs(mstatus, 0x08);
	a5Out = a5_7;
	return a4_9;
}

// 230146EE: Register word32 ke_evt_clear(Register Eq_5849 a0, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      ipc_emb_tx_evt
//      ipc_emb_msg_evt
//      mm_tbtt_evt
//      mm_hw_idle_evt
//      mm_timer_schedule
//      bl_reset_evt
//      rxl_dma_evt
//      rxl_cntrl_evt
//      txl_cfm_evt
//      txl_reset
//      txl_frame_evt
//      rxu_cntrl_evt
//      rxu_swdesc_upload_evt
//      bl_event_handle
//      bl60x_fw_dump_statistic
//      ke_init
//      ke_task_schedule
//      ke_timer_schedule
//      hal_dma_evt
word32 ke_evt_clear(Eq_5849 a0, Eq_2 a4, ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	word32 a5_7 = *a4;
	*(~a0 & a4) = a5_7;
	__csrrs(mstatus, 0x08);
	return a5_7;
}

// 2301470A: void bl_event_handle(Register Eq_2 ra, Register ptr32 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register word32 s4, Register Eq_58767 s6, Register ptr32 mstatus, Stack word32 dwArg08, Stack (ptr32 Eq_58770) dwArg10, Stack ptr32 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack word32 dwArg88, Stack Eq_2 dwArg8C)
void bl_event_handle(Eq_2 ra, ptr32 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, word32 s4, Eq_58767 s6, ptr32 mstatus, word32 dwArg08, struct Eq_58770 * dwArg10, ptr32 dwArg28, word32 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, word32 dwArg88, Eq_2 dwArg8C)
{
	ke_evt_clear(0x40000000, a4, mstatus);
	bl_main_event_handle(ra, s0, dwArg10, a3, a4, s2, s4, s6, mstatus, dwArg08, dwArg10, dwArg28, dwArg38, dwArg40, dwArg44, dwArg68, dwArg88, dwArg8C);
}

// 2301471E: Register Eq_2 bl_fw_statistic_dump(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArg0118)
// Called from:
//      bl60x_fw_dump_statistic
Eq_2 bl_fw_statistic_dump(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArg0118)
{
	Eq_2 a5_10 = ke_evt_clear(32, a4, mstatus);
	__csrrc(mstatus, 0x08);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg8 = <invalid>;
	Eq_2 stackArg80 = <invalid>;
	Eq_2 stackArg84 = <invalid>;
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg156 = <invalid>;
	bl_utils_dump(ra, a3, s2, stackArg8, stackArg80, stackArg84, stackArg120, stackArg156);
	Eq_2 a5_13 = txl_frame_dump(a5_10);
	ipc_emb_dump();
	txl_cfm_dump(txl_cntrl_env_dump(a5_13));
	rxl_cntrl_dump(rxl_hwdesc_dump(ra, a3, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118));
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg24 = <invalid>;
	Eq_2 stackArg96 = <invalid>;
	Eq_2 stackArg100 = <invalid>;
	Eq_2 stackArg136 = <invalid>;
	Eq_2 stackArg172 = <invalid>;
	word32 s1_80;
	word32 a0_81;
	word32 s10_82;
	hal_mib_dump(ra, a3, stackArg24, stackArg96, stackArg100, stackArg136, stackArg172, out s1_80, out a0_81, out s10_82);
	__csrrs(mstatus, 0x08);
	return a3_35;
}

// 23014758: Register Eq_2 bl60x_fw_dump_statistic(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArg0118)
// Called from:
//      cmd_wifi_dump
Eq_2 bl60x_fw_dump_statistic(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArg0118)
{
	if (a0 != 0x00)
		return bl_fw_statistic_dump(ra, a3, a4, mstatus, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118);
	word32 a5_89;
	ke_evt_set(32, a4, mstatus, out a5_89);
	return a3;
}

// 23014768: Register word32 ke_evt_schedule(Register word32 ra, Register Eq_2 a0, Stack word32 dwArgA8, Register out ptr32 s6Out)
// Called from:
//      wifi_main
word32 ke_evt_schedule(word32 ra, Eq_2 a0, word32 dwArgA8, ptr32 & s6Out)
{
	word32 s0_24 = 1107433416;
	Eq_582584 s1_25[] = g_a230ACECC;
	Eq_2 s4_26 = 0x1A;
	word32 s5_27 = 0x230AA000;
	ptr32 s6_28 = 0x230AD000;
	while (a0 != 0x00)
	{
		word32 a5_108;
		word32 a4_107;
		Eq_2 a0_30 = __clzsi2(a0, out a4_107, out a5_108);
		<anonymous> * s3_37 = s1_25[a0_30].ptr0000;
		if (s4_26 < a0_30 || s3_37 == null)
			assert_err();
		ui32 s2_46 = &(s1_25 + (a0_30 << 0x03) / 8)->ptr0000;
		word32 a1_68;
		s3_37();
		s0_24 = (word32) *a0;
	}
	0x00 = dwArgA8;
	s6Out = s6_28;
	return s5_27;
}

// 230147E4: void ke_init(Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      bl_init
void ke_init(Eq_2 a4, ptr32 mstatus)
{
	ke_mem_init(mstatus)->dw001C = 1107433416;
	g_dw420217D4 = 0x00;
	g_dw420217D8 = 0x00;
	g_dw420217CC = 0x00;
	g_dw420217D0 = 0x00;
	g_ptr420217DC = null;
	g_dw420217E0 = 0x00;
	ke_evt_clear(~0x00, a4, mstatus);
}

// 23014816: Register word32 ke_mem_init(Register ptr32 mstatus)
// Called from:
//      ke_init
word32 ke_mem_init(ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	*(word32 *) 5252 = 1107433448;
	g_dw420217E8 = 0x00;
	__csrrs(mstatus, 0x08);
	return 1107433448;
}

// 2301483C: Register uint32 ke_malloc(Register (ptr32 Eq_6885) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out Eq_2 a5Out, Register out (ptr32 (ptr32 Eq_60113)) s2Out)
// Called from:
//      ipc_emb_msg_evt
//      ke_msg_alloc
//      ke_timer_set
//      GetTxEAPOLBuffer
//      apm_start_req_handler
uint32 ke_malloc(struct Eq_6885 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, ptr32 & a0Out, union Eq_2 & a5Out, struct Eq_60113 & s2Out)
{
	uint32 s1_8 = (char *) a0 + 3 & -4;
	if (s1_8 > ~0x02)
	{
		Eq_2 a5_23 = g_t420217E4;
		__csrrc(mstatus, 0x08);
		union Eq_2 * s0_25 = null;
		while (a5_23 != 0x00)
		{
			union Eq_2 * a5_30 = *((word32) a4 + 4);
			if (a4 >= s1_8 + 0x0C)
			{
				if (s0_25 != null)
				{
					s0_25 = (union Eq_2 *) *((word32) a3 + 4);
					if (a4 >= a3)
						goto l230148C8;
				}
				s0_25 = a5_30;
			}
l230148C8:
			a5_23 = *a5_30;
		}
		if (s0_25 != null)
		{
			int32 s0_49 = a0->dw0007;
			struct Eq_59014 * a0_53 = (char *) a0 + 3 - (s1_8 + 4);
			a0_53->dw0004 = s0_49;
			uint32 * a0_55 = a0_53 + s0_49 / 8;
			*a0_55 = s1_8 + 4;
			__csrrs(mstatus, 0x08);
			0x00 = (int8) dwArg38;
			a0Out = a0_55 + 1;
			a5Out = a5_23;
			s2Out = s1_8 + 4;
			return s1_8 + 0x0C;
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 230148D0: Register word32 ke_free(Register Eq_2 a0, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a2Out, Register out (ptr32 word32) a3Out, Register out Eq_2 a4Out, Register out Eq_57047 a5Out, Register out (ptr32 Eq_57048) s2Out, Register out (ptr32 Eq_57049) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      apm_bcn_set
//      ke_msg_send
//      ke_msg_free
//      ke_timer_clear
//      ke_timer_schedule
//      UpdateEAPOLWcbLenAndTransmit
word32 ke_free(Eq_2 a0, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a2Out, word32 & a3Out, union Eq_2 & a4Out, union Eq_57047 & a5Out, struct Eq_57048 & s2Out, struct Eq_57049 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_57047 a5_118 = 0x42021000;
	Eq_2 s0_29 = g_t420217E4;
	struct Eq_57048 * s2_121 = (word32) a0 - 4;
	struct Eq_57049 * s3_21 = *((word32) a0 - 4);
	if (s0_29 < a0)
	{
		__csrrc(mstatus, 0x08);
		Eq_57047 s4_28 = 0x00;
		while (s0_29 != 0x00)
		{
			Eq_57047 s0_32 = g_t42021004;
			a4 = (word32) s0_32 + 0x42021000;
			if ((word32) s0_32 + 0x42021000 == (word32) a0 - 4)
			{
				Eq_2 s0_54 = *((word32) s0_32 + 0x42021000);
				s3_21->t42021004 = s0_54;
				a5_118 = (char *) s3_21 + 0x42021000;
				a3 = s0_54 + (s3_21 + 0x42021000);
				if ((word32) s0_32 + 0x42021000 == a3)
				{
					a5_118 = s3_21 + 0x42021000 + a3;
					*((word32) a5_118 + 4) = s0_54;
					a4 = *a5_118;
					*a5_118 = s0_54;
				}
				goto l23014940;
			}
			if ((word32) a0 - 4 < s0_32)
			{
				if (s4_28 == 0x00)
					assert_err();
				*s4_28 = (word32) a0 - 4;
				a5_118 = s3_21 + ((word32) a0 - 4) / 0x42021008;
				if (s0_32 != a5_118)
				{
					*((word32) a0 + 0x0FFC) = s0_32;
					goto l23014996;
				}
				else
				{
					*((word32) a0 + 0x0FFC) = a5_118;
					s2_121 = a5_118 - ((word32) a0 - 4);
					Mem53[Mem49[a5_118 + 4:word32] + s2_121:word32] = a0;
					goto l23014940;
				}
			}
			s4_28 = s0_32;
			s0_29 = *s0_32;
		}
		*s4_28 = (word32) a0 - 4;
		*((word32) a0 + 0x0FFC) = 0x00;
l23014996:
		*a0 = s3_21;
l23014940:
		__csrrs(mstatus, 0x08);
		s1Out = a0;
		a2Out = dwArg48;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_118;
		s2Out = s2_121;
		s3Out = s3_21;
		s4Out = dwArg04;
		s8Out = s4;
		return s1;
	}
	else
		assert_err();
}

// 230149A2: Register Eq_2 ke_msg_alloc(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_22344) a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_22348 a4Out, Register out (ptr32 Eq_22349) a5Out, Register out ptr32 a6Out, Register out (ptr32 Eq_22351) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_22354) s8Out)
// Called from:
//      mm_sta_del
//      mm_send_connection_loss_ind
//      mm_check_rssi
//      mm_send_csa_traffic_ind
//      mm_bcn_transmit
//      mm_ps_change_ind
//      rxl_cntrl_evt
//      scan_send_cancel_cfm
//      vif_mgmt_switch_channel
//      me_beacon_check
//      rxu_mgt_frame_check
//      rxu_cntrl_frame_handle
//      scanu_confirm
//      scanu_raw_send_cfm
//      scanu_scan_next
//      sm_delete_resources
//      sm_scan_bss
//      sm_join_bss
//      sm_set_bss_param
//      sm_disconnect
//      sm_assoc_done
//      apm_start_cfm
//      apm_set_bss_param
//      apm_stop
//      apm_tx_int_ps_postpone
//      apm_tx_int_ps_get_postpone
//      apm_tx_int_ps_clear
//      apm_sta_add
//      apm_bcn_set
//      apm_assoc_req_handler
//      apm_sta_remove
//      ke_msg_send_basic
//      chan_switch_start
//      chan_bcn_detect_start
//      mm_monitor_channel_req_handler
//      mm_monitor_enable_req_handler
//      mm_remain_on_channel_req_handler
//      mm_sta_add_req_handler
//      mm_key_add_req_handler
//      mm_set_power_req_handler
//      mm_version_req_handler
//      mm_hw_config_handler
//      scan_start_req_handler
//      me_rc_stats_req_handler
//      me_traffic_ind_req_handler
//      me_sta_del_req_handler
//      me_set_control_port_req_handler
//      me_config_req_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      me_sta_add_req_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      mm_set_vif_state_cfm_handler
//      apm_sta_del_req_handler
//      apm_start_cac_req_handler
//      apm_start_req_handler
//      cfg_start_req_handler
//      dbg_get_sys_stat_req_handler
//      dbg_mem_write_req_handler
//      dbg_mem_read_req_handler
Eq_2 ke_msg_alloc(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, ptr32 & s0Out, union Eq_2 & s1Out, struct Eq_22344 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_22348 & a4Out, struct Eq_22349 & a5Out, ptr32 & a6Out, struct Eq_22351 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, struct Eq_22354 & s8Out)
{
	struct Eq_59152 * a0_27;
	struct Eq_22351 * s2_31;
	word32 a5_89;
	Eq_2 s1_30 = ke_malloc((word32) a3 + 0x0C, a3, a4, mstatus, dwArg18, out a0_27, out a5_89, out s2_31);
	if (a0_27 != null)
	{
		a0_27->w0004 = (word16) a0;
		a0_27->w0006 = (word16) a1;
		a0_27->w0008 = (word16) s2_31;
		a0_27->w000A = (word16) s1_30;
		a0_27->dw0000 = 0x00;
		ptr32 a1_49;
		ptr32 a3_51;
		Eq_22348 a4_52;
		struct Eq_22349 * a5_53;
		word32 t1_90;
		word32 a0_91;
		word32 a2_92;
		Eq_2 ra_54 = memset(ra, &a0_27->w000A + 1, 0x00, s1_30, out t1_90, out a0_91, out a1_49, out a2_92, out a3_51, out a4_52, out a5_53);
		s0Out = s1;
		s1Out = s1_30;
		a0Out = (struct Eq_22344 *) (&a0_27->w000A + 1);
		a1Out = a1_49;
		a2Out = dwArg48;
		a3Out = a3_51;
		a4Out = a4_52;
		a5Out = a5_53;
		a6Out = dwArg28;
		s2Out = s2_31;
		s3Out = a1;
		s4Out = dwArg04;
		s8Out = s4;
		return ra_54;
	}
	else
		assert_err();
}

