pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23014A0E: Register Eq_2 ke_msg_send(Register Eq_2 a0, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_6999) a1Out, Register out Eq_7000 a2Out, Register out Eq_7001 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_7003) a5Out, Register out (ptr32 Eq_7004) s2Out, Register out (ptr32 Eq_7005) s3Out, Register out (ptr32 Eq_7006) s4Out, Register out ptr32 s8Out)
// Called from:
//      ipc_emb_msg_evt
//      mm_sta_del
//      mm_send_connection_loss_ind
//      mm_check_rssi
//      mm_send_csa_traffic_ind
//      mm_bcn_transmit
//      mm_ps_change_ind
//      rxl_cntrl_evt
//      scan_send_cancel_cfm
//      vif_mgmt_switch_channel
//      me_beacon_check
//      rxu_mgt_frame_check
//      rxu_cntrl_frame_handle
//      scanu_confirm
//      scanu_raw_send_cfm
//      scanu_scan_next
//      sm_delete_resources
//      sm_scan_bss
//      sm_join_bss
//      sm_send_next_bss_param
//      sm_disconnect
//      sm_connect_ind
//      sm_assoc_done
//      apm_tx_cfm_handler
//      apm_start_cfm
//      apm_send_next_bss_param
//      apm_stop
//      apm_tx_int_ps_postpone
//      apm_tx_int_ps_get_postpone
//      apm_tx_int_ps_clear
//      apm_sta_add
//      apm_bcn_set
//      apm_sta_remove
//      ke_msg_send_basic
//      ke_msg_forward_and_change_id
//      chan_switch_start
//      chan_bcn_detect_start
//      mm_monitor_channel_req_handler
//      mm_monitor_enable_req_handler
//      mm_remain_on_channel_req_handler
//      mm_sta_add_req_handler
//      mm_key_add_req_handler
//      mm_set_power_req_handler
//      mm_version_req_handler
//      mm_hw_config_handler
//      scan_start_req_handler
//      me_rc_stats_req_handler
//      me_traffic_ind_req_handler
//      me_sta_del_req_handler
//      me_set_control_port_req_handler
//      me_config_req_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      me_sta_add_req_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      mm_set_vif_state_cfm_handler
//      apm_sta_del_req_handler
//      apm_start_cac_req_handler
//      apm_start_req_handler
//      cfg_start_req_handler
//      dbg_get_sys_stat_req_handler
//      dbg_mem_write_req_handler
//      dbg_mem_read_req_handler
Eq_2 ke_msg_send(Eq_2 a0, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_6999 & a1Out, union Eq_7000 & a2Out, union Eq_7001 & a3Out, union Eq_2 & a4Out, struct Eq_7003 & a5Out, struct Eq_7004 & s2Out, struct Eq_7005 & s3Out, struct Eq_7006 & s4Out, ptr32 & s8Out)
{
	Eq_2 a5_11 = (word32) *((word32) a0 - 6);
	if (a5_11 <= 0x0E)
	{
		if (a5_11 > 0x0C)
		{
			bl_rx_e2a_handler(a0, a2);
			Eq_7000 a2_41;
			Eq_2 a4_42;
			struct Eq_7003 * a5_43;
			Eq_2 s1_46;
			struct Eq_7004 * s2_47;
			struct Eq_7005 * s3_48;
			struct Eq_7006 * s4_49;
			ptr32 s8_50;
			Eq_7001 a3_52;
			Eq_2 s0_45 = ke_free((word32) a0 - 0x0C, mstatus, out s1_46, out a2_41, out a3_52, out a4_42, out a5_43, out s2_47, out s3_48, out s4_49, out s8_50);
			s1Out = s1_46;
			a0Out = (word32) a0 - 0x0C;
			a1Out = a1;
			a2Out = a2_41;
			a3Out = a3_52;
			a4Out = a4_42;
			a5Out = a5_43;
			s2Out = s2_47;
			s3Out = s3_48;
			s4Out = s4_49;
			s8Out = s8_50;
			return s0_45;
		}
		else
		{
			Eq_2 s1_20 = co_list_push_back((word32) a0 - 0x0C, a5_11);
			struct Eq_7003 * a5_29;
			Eq_2 a4_28 = ke_evt_set(0x01000000, 0x0C, mstatus, out a5_29);
			s1Out = s1_20;
			a0Out = 0x01000000;
			a1Out = (word32) a0 - 0x0C;
			a2Out = dwArg10;
			a3Out = a3;
			a4Out = a4_28;
			a5Out = a5_29;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s8Out = s8;
			return s0;
		}
	}
	else
		assert_err();
}

// 23014A78: Register Eq_2 ke_msg_send_basic(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out (ptr32 Eq_23701) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_23706) s4Out, Register out ptr32 s8Out)
// Called from:
//      mm_tim_update
//      mm_bcn_change
//      ps_enable_cfm
//      ps_disable_cfm
//      ke_timer_schedule
//      chan_tx_cfm
//      chan_ctxt_op_evt
//      mm_set_ps_options_req_handler
//      mm_sta_del_req_handler
//      mm_key_del_req_handler
//      mm_set_idle_req_handler
//      mm_reset_req_handler
//      mm_start_req_handler
//      mm_set_ps_mode_req_handler
//      mm_hw_config_handler
//      mm_scan_channel_end_ind_handler
//      me_traffic_ind_req_handler
//      me_sta_del_req_handler
//      me_set_control_port_req_handler
//      me_chan_config_req_handler
//      mm_set_ps_mode_cfm_handler
//      mm_set_idle_cfm_handler
//      me_config_req_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      sm_disconnect_req_handler
//      apm_stop_cac_req_handler
//      apm_conf_max_sta_req_handler
//      apm_stop_req_handler
//      dbg_set_sev_filter_req_handler
//      dbg_set_mod_filter_req_handler
Eq_2 ke_msg_send_basic(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, struct Eq_23701 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_23706 & s4Out, ptr32 & s8Out)
{
	Eq_2 a0_11;
	word32 s0_57;
	word32 s1_58;
	word32 a1_59;
	word32 a2_60;
	word32 a3_61;
	word32 a4_62;
	word32 a5_63;
	word32 a6_64;
	word32 s2_65;
	word32 s3_66;
	word32 s4_67;
	word32 s8_68;
	Eq_2 ra_18 = ke_msg_alloc(ra, a0, a1, 0x00, a4, mstatus, dwArg08, out s0_57, out s1_58, out a0_11, out a1_59, out a2_60, out a3_61, out a4_62, out a5_63, out a6_64, out s2_65, out s3_66, out s4_67, out s8_68);
	ptr32 a0_31;
	ptr32 a3_33;
	struct Eq_23701 * s1_38;
	ptr32 s2_39;
	ptr32 s3_40;
	struct Eq_23706 * s4_41;
	ptr32 s8_42;
	word32 a1_69;
	word32 a2_70;
	word32 a4_71;
	word32 a5_72;
	s0Out = ke_msg_send(a0_11, mstatus, out s1_38, out a0_31, out a1_69, out a2_70, out a3_33, out a4_71, out a5_72, out s2_39, out s3_40, out s4_41, out s8_42);
	s1Out = s1_38;
	a0Out = a0_31;
	a3Out = a3_33;
	s2Out = s2_39;
	s3Out = s3_40;
	s4Out = s4_41;
	s8Out = s8_42;
	return ra_18;
}

