pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23014A8A: void ke_msg_forward_and_change_id(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_46618) a2, Register (ptr32 byte) a3, Register ptr32 mstatus)
// Called from:
//      rxu_mgt_ind_handler
void ke_msg_forward_and_change_id(Eq_2 a0, byte * a1, struct Eq_46618 * a2, byte * a3, ptr32 mstatus)
{
	*((word32) a0 + 0x0FF8) = (word16) a1;
	*((word32) a0 + 0x0FFA) = (word16) a2;
	*((word32) a0 + 0x0FFC) = (word16) a3;
	word32 s1_26;
	word32 a0_27;
	word32 a1_28;
	word32 a2_29;
	word32 a3_30;
	word32 a4_31;
	word32 a5_32;
	word32 s2_33;
	word32 s3_34;
	word32 s4_35;
	word32 s8_36;
	ke_msg_send(a0, mstatus, out s1_26, out a0_27, out a1_28, out a2_29, out a3_30, out a4_31, out a5_32, out s2_33, out s3_34, out s4_35, out s8_36);
}

// 23014A9A: Register Eq_2 ke_msg_free(Register Eq_2 a0, Register ptr32 mstatus, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      mm_tim_update
//      mm_bcn_change
//      scanu_confirm
//      sm_connect_ind
//      apm_tx_cfm_handler
//      apm_start_cfm
//      ke_task_schedule
//      mm_scan_channel_end_ind_handler
Eq_2 ke_msg_free(Eq_2 a0, ptr32 mstatus, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out)
{
	ptr32 a4_6;
	ptr32 a5_7;
	ptr32 s1_10;
	ptr32 s2_11;
	ptr32 s4_13;
	ptr32 a3_16;
	word32 a2_23;
	word32 s3_24;
	word32 s8_25;
	Eq_2 s0_9 = ke_free(a0, mstatus, out s1_10, out a2_23, out a3_16, out a4_6, out a5_7, out s2_11, out s3_24, out s4_13, out s8_25);
	s1Out = s1_10;
	a3Out = a3_16;
	a4Out = a4_6;
	a5Out = a5_7;
	s2Out = s2_11;
	s4Out = s4_13;
	return s0_9;
}

// 23014A9E: void cmp_dest_id()
void cmp_dest_id()
{
}

// 23014AAA: Register Eq_2 ke_task_local(Register Eq_2 a0)
// Called from:
//      apm_bcn_set
//      ke_state_get
//      ke_task_schedule
Eq_2 ke_task_local(Eq_2 a0)
{
	if (a0 <= 0x0E)
		return (word32) (a0 < 0x0D);
	assert_err();
}

// 23014ADC: Register ui32 ke_handler_search(Register ptr32 a0, Register Eq_59397 a1, Register Eq_2 a4, Register out ptr32 a0Out, Register out Eq_59397 a1Out, Register out Eq_2 a4Out)
// Called from:
//      ke_task_schedule
ui32 ke_handler_search(ptr32 a0, Eq_59397 a1, Eq_2 a4, ptr32 & a0Out, union Eq_59397 & a1Out, union Eq_2 & a4Out)
{
	word32 a5_5 = (word32) *((word32) a1 + 4);
	struct Eq_59407 * a5_18 = a5_5 + ~0x00;
	if (a5_5 != 0x00)
	{
		do
		{
			ui32 s1_19 = a5_18 << 0x03;
			a4 = (word32) a4 + s1_19;
			Eq_59397 a1_17 = *a4;
			if ((word32) *a4 == a0)
			{
				a4 = a5_18[4];
				if (a5_18 != null)
					goto l23014B32;
				assert_err();
			}
			a5_18 = (struct Eq_59407 *) ((char *) a5_18 - 1);
		} while (a5_18 != (struct Eq_59407 *) ~0x00);
		a0 = 0x00;
l23014B32:
		a0Out = a0;
		a1Out = a1_17;
		a4Out = a4;
		return s1_19;
	}
	else
	{
		a0Out = 0x00;
		a1Out = a1;
		a4Out = a4;
		return s1;
	}
}

// 23014B3C: Register Eq_2 ke_state_set(Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Register out (ptr32 Eq_20705) s1Out, Register out Eq_20706 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_20710) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      mm_active
//      mm_reset
//      mm_hw_idle_evt
//      mm_force_idle_req
//      scan_init
//      scan_set_channel_request
//      me_init
//      scanu_confirm
//      scanu_init
//      scanu_start
//      sm_init
//      sm_scan_bss
//      sm_join_bss
//      sm_set_bss_param
//      sm_disconnect
//      sm_connect_ind
//      sm_auth_send
//      sm_assoc_req_send
//      sm_assoc_done
//      apm_init
//      apm_start_cfm
//      apm_set_bss_param
//      apm_bcn_set
//      chan_ctxt_op_evt
//      mm_set_idle_req_handler
//      mm_reset_req_handler
//      mm_start_req_handler
//      mm_force_idle_req_handler
//      mm_hw_config_handler
//      mm_scan_channel_end_ind_handler
//      mm_scan_channel_start_ind_handler
//      bam_init
//      mm_set_ps_mode_cfm_handler
//      mm_set_idle_cfm_handler
//      me_config_req_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      mm_connection_loss_ind_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      rxu_mgt_ind_handler
//      me_set_active_cfm_handler
Eq_2 ke_state_set(Eq_2 a0, Eq_2 a1, ptr32 mstatus, struct Eq_20705 & s1Out, union Eq_20706 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_20710 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	if ((a0 & 0x00FF) <= 0x0D)
	{
		ke_task_local(a0);
		Eq_20706 a0_106 = a0 & 0x00FF;
		if ((a0 & 0x00FF) != 0x00)
		{
			struct Eq_20705 * s1_111 = (a0 & 0x00FF) << 4;
			Eq_2 a4_108 = (word32) s1_111->w230AD07A;
			if (a0 >> 0x08 < a4_108)
			{
				struct Eq_20710 * s2_112 = a0 >> 0x08 << 1;
				if (s2_112 != &g_t230AD06C)
				{
					Eq_2 a5_109 = (word32) s2_112->w230AD06C;
					if (a5_109 != a1)
					{
						s2_112->w230AD06C = (word16) a1;
						s1_111 = &g_t23015000;
						s2_112 = &g_t42021000;
						while (true)
						{
							// Failed to bind call argument.
							// Please report this issue at https://github.com/uxmal/reko
							Eq_2 stackArg296 = <invalid>;
							word32 s0_124;
							word32 s1_125;
							word32 a0_126;
							word32 s2_127;
							ke_queue_extract(ra, s0, a1, a2, stackArg296, out s0_124, out s1_125, out a0_126, out s2_127);
							a0_106.u0 = 0x420217D4;
							a1.u0 = 0x420217D4;
							if (false)
								break;
							__csrrc(mstatus, 0x08);
							co_list_push_back(a1, a5);
							__csrrs(mstatus, 0x08);
							a4_108 = ke_evt_set(0x01000000, a4_108, mstatus, out a5_109);
						}
					}
					s1Out = s1_111;
					a0Out = a0_106;
					a1Out = a1;
					a4Out = a4_108;
					a5Out = a5_109;
					s2Out = s2_112;
					s3Out = a0;
					s4Out = dwArg04;
					return s1;
				}
				else
					assert_err();
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 23014C3C: Register word32 ke_state_get(Register Eq_2 a0, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_20736 a4Out, Register out (ptr32 uint16) s2Out)
// Called from:
//      mm_reset
//      bl_sleep
//      rxu_mgt_frame_check
//      sm_frame_tx_cfm_handler
//      chan_ctxt_op_evt
//      mm_set_idle_req_handler
//      mm_start_req_handler
//      mm_force_idle_req_handler
//      mm_hw_config_handler
//      scan_cancel_req_handler
//      scan_start_req_handler
//      mm_scan_channel_end_ind_handler
//      mm_scan_channel_start_ind_handler
//      mm_set_ps_mode_cfm_handler
//      mm_set_idle_cfm_handler
//      me_set_ps_disable_req_handler
//      me_set_active_req_handler
//      rxu_mgt_ind_handler
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
//      sm_rsp_timeout_ind_handler
//      scanu_start_cfm_handler
//      mm_connection_loss_ind_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      rxu_mgt_ind_handler
//      mm_set_vif_state_cfm_handler
//      me_set_active_cfm_handler
//      mm_sta_add_cfm_handler
//      sm_disconnect_req_handler
//      apm_stop_cac_req_handler
//      apm_start_cac_req_handler
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
//      mm_bcn_change_cfm_handler
//      apm_stop_req_handler
//      apm_start_req_handler
//      me_set_active_cfm_handler
//      hostapd_mgt_ind_handler
word32 ke_state_get(Eq_2 a0, Eq_2 dwArg38, ptr32 & a0Out, ptr32 & a2Out, union Eq_20736 & a4Out, uint16 & s2Out)
{
	if ((a0 & 0x00FF) <= 0x0D)
	{
		if (ke_task_local(a0 & 0x00FF) != 0x00)
		{
			Eq_20736 a4_34 = (word32) ((char *) &g_t230AD06C + 0x0E)[(a0 & 0x00FF) * 0x10];
			if (a0 >> 0x08 < a4_34)
			{
				struct Eq_59553 * s2_44 = a0 >> 0x08 << 1;
				ptr32 a0_46 = (word32) s2_44->w230AD000;
				0x00 = (int8) dwArg38;
				a0Out = a0_46;
				a2Out = dwArg10;
				a4Out = a4_34;
				s2Out = &s2_44->w230AD000;
				return 0x230AD06C;
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 23014CD4: void ke_task_schedule(Register word32 ra, Register Eq_59397 a1, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus)
void ke_task_schedule(word32 ra, Eq_59397 a1, Eq_2 a4, Eq_2 a5, ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	word32 a5_245;
	Eq_2 a0_21 = co_list_pop_front(a4, a5, out a5_245);
	__csrrs(mstatus, 0x08);
	if (a0_21 == 0x00)
	{
l23014DA2:
		__csrrc(mstatus, 0x08);
		if (g_dw420217CC == 0x00)
			ke_evt_clear(0x01000000, a4, mstatus);
		__csrrs(mstatus, 0x08);
		return;
	}
	uint32 s2_23 = (word32) *((word32) a0_21 + 6);
	Eq_2 s0_116 = a0_21;
	ptr32 s4_27 = (word32) *((word32) a0_21 + 4);
	uint32 s2_104 = s2_23 >> 0x08;
	if ((s2_23 & 0x00FF) > 0x0D)
		assert_err();
	if (ke_task_local(s2_23 & 0x00FF) == 0x00)
		assert_err();
	struct Eq_59624 * s3_45 = (s2_23 & 0x00FF) << 4;
	Eq_2 a4_111 = (word32) s3_45->w230AD07A;
	if (s2_23 >> 0x08 >= a4_111)
		assert_err();
	if (s3_45 == &g_t230AD06C)
		assert_err();
	word32 s1_103;
	<anonymous> * a5_100;
	if (a1 != 0x00)
	{
		struct Eq_59647 * s2_63 = s2_23 >> 0x08 << 1;
		s2_104 = &s2_63->w230AD000;
		<anonymous> * a0_69;
		s1_103 = ke_handler_search(s4_27, (word32) a1 + ((word32) s2_63->w230AD000 << 3), a4_111, out a0_69, out a1, out a4_111);
		a5_100 = a0_69;
		if (a0_69 != null)
			goto l23014DE4;
	}
	if (a1 == 0x00)
		goto l23014D9C;
	<anonymous> * a0_84;
	word32 a1_246;
	s1_103 = ke_handler_search(s4_27, a1, a4_111, out a0_84, out a1_246, out a4_111);
	a5_100 = a0_84;
	if (a0_84 == null)
	{
l23014D9C:
		word32 s2_250;
		word32 s4_251;
		word32 s1_247;
		word32 a5_249;
		word32 a3_248;
		ke_msg_free(s0_116, mstatus, out s1_247, out a3_248, out a4, out a5_249, out s2_250, out s4_251);
		goto l23014DA2;
	}
l23014DE4:
	word32 a0_122;
	word32 tp_131;
	a5_100();
	if (a0_122 != 0x01)
	{
		if (a0_122 != 0x02)
		{
			if (a0_122 != 0x00)
				assert_err();
			goto l23014D9C;
		}
		co_list_push_back(s0_116, 0x02);
	}
	goto l23014DA2;
}

// 23014E3A: void ke_msg_discard()
void ke_msg_discard()
{
}

// 23014E3E: void ke_msg_save()
void ke_msg_save()
{
}

// 23014E42: Register Eq_2 ke_timer_hw_set(Register int32 a0, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      ke_timer_set
//      ke_timer_clear
//      ke_timer_schedule
Eq_2 ke_timer_hw_set(int32 a0, Eq_2 a4, ptr32 mstatus, union Eq_2 & a5Out)
{
	Eq_2 a5_14;
	__csrrc(mstatus, 0x08);
	if (a0 != 0x00)
	{
		*(union Eq_2 *) 0x44B00148 = a4;
		a5_14 = *(union Eq_2 *) 0x44B0808C;
		if ((a5_14 & 0x0100) != 0x00)
			goto l23014E70;
		((union Eq_19267 *) 0x44B08088)->u0 = 0x0100;
		a5_14 |= 0x0100;
	}
	else
		a5_14 = *(union Eq_2 *) 0x44B0808C & -0x0101;
	*(union Eq_2 *) 0x44B0808C = a5_14;
l23014E70:
	__csrrs(mstatus, 0x08);
	a5Out = a5_14;
	return 0x44B08000;
}

// 23014E84: void cmp_abs_time()
void cmp_abs_time()
{
}

// 23014E9C: void cmp_timer_id(Register (ptr32 Eq_59738) a0, Register uint32 a1)
void cmp_timer_id(struct Eq_59738 * a0, uint32 a1)
{
	if ((word32) a0->w0004 != a1 >> 0x10)
		;
}

