pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23014EBC: Register word32 ke_timer_set(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0108)
// Called from:
//      sm_auth_send
//      sm_assoc_req_send
//      apm_start_cfm
//      apm_sta_connect_timeout_ind_handler
word32 ke_timer_set(Eq_2 ra, Eq_2 a0, ui32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgA8, Eq_2 dwArg0108)
{
	if (a2 != 0x00 && a2 <= 299999999)
	{
		struct Eq_58960 * a5_40 = g_ptr420217DC;
		if (a5_40 != null)
			a4 = (word32) a5_40->w0004;
		Eq_2 a0_59;
		word32 s0_61;
		word32 s1_243;
		word32 s2_244;
		Eq_2 ra_69 = ke_queue_extract(ra, a2, 587288220, a0 << 0x10 | a1, dwArg0108, out s0_61, out s1_243, out a0_59, out s2_244);
		Eq_2 s1_70 = a0_59;
		if (a0_59 == 0x00)
		{
			Eq_2 a0_78;
			word32 s2_246;
			word32 a5_245;
			ke_malloc((struct Eq_6885 *) 0x0C, a3, a4, mstatus, dwArg18, out a0_78, out a5_245, out s2_246);
			s1_70 = a0_78;
			if (a0_78 == 0x00)
				assert_err();
			*((word32) a0_78 + 4) = (word16) a0;
			*((word32) a0_78 + 6) = (word16) a1;
		}
		Eq_2 s0_98 = (word32) *(union Eq_2 *) 0x44B00120 + s0_61;
		*((word32) s0_98 + 8) = s1_70;
		int32 s1_109;
		word32 s2_110;
		struct Eq_59791 * s3_111;
		int32 s0_108 = co_list_insert(ra_69, s0_98, s1_70, &g_t23014E84, dwArg0108, out s1_109, out s2_110, out s3_111);
		if (s2_110 != 0x00 || s3_111->dw0014 == s1_109)
		{
			word32 a5_247;
			a4 = ke_timer_hw_set(s3_111->dw0014, a4, mstatus, out a5_247);
		}
		if (s0_108 - *((union Eq_2 *) 0x44B00120) >= 0x00)
		{
			0x00 = (int8) dwArgA8;
			return;
		}
		else
		{
			0x00 = (int8) dwArgA8;
			word32 a5_248;
			ke_evt_set(0x04000000, a4, mstatus, out a5_248);
			return;
		}
	}
	else
		assert_err();
}

// 23014FF0: Register Eq_2 ke_timer_clear(Register Eq_2 ra, Register Eq_2 s0, Register ui32 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out (ptr32 Eq_51944) s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      sm_auth_handler
//      sm_assoc_rsp_handler
//      apm_stop
Eq_2 ke_timer_clear(Eq_2 ra, Eq_2 s0, ui32 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg0118, union Eq_2 & s0Out, struct Eq_51944 & s1Out, ptr32 & a3Out, ptr32 & s2Out)
{
	struct Eq_51944 * s1_11 = *((word32) s0 + 20);
	if (s0 != 0x00)
	{
		if ((word32) *((word32) s0 + 4) == a0)
		{
			Eq_2 a4_15 = (word32) *((word32) s0 + 6);
			if (a4_15 == a1)
			{
				word32 a5_155;
				co_list_pop_front(a4_15, 0x42021000, out a5_155);
				int32 s1_50 = s1_11->dw0014;
				word32 a5_156;
				ke_timer_hw_set(s1_50, a4_15, mstatus, out a5_156);
				if (s1_50 != 0x00 && *((union Eq_2 *) 0x44B00120) > 0x44B00000)
					assert_err();
l23015052:
				word32 a2_157;
				struct Eq_51944 * s1_81;
				ptr32 s2_82;
				ptr32 a3_87;
				word32 a4_158;
				word32 a5_159;
				word32 s3_160;
				word32 s4_161;
				word32 s8_162;
				s0Out = ke_free(s0, mstatus, out s1_81, out a2_157, out a3_87, out a4_158, out a5_159, out s2_82, out s3_160, out s4_161, out s8_162);
				s1Out = s1_81;
				a3Out = a3_87;
				s2Out = s2_82;
				return ra;
			}
		}
		Eq_2 a0_29;
		word32 s0_154;
		ra = ke_queue_extract(ra, s0, 587288220, a0 << 0x10 | a1, dwArg0118, out s0_154, out s1_11, out a0_29, out s2);
		s0 = a0_29;
		if (a0_29 != 0x00)
			goto l23015052;
	}
	s0Out = s0;
	s1Out = s1_11;
	a3Out = a3;
	s2Out = s2;
	return ra;
}

Eq_20705 g_t23015000 = 
	{
		?? /* Can't read address 460C207A */
,
	};
// 23015084: void ke_timer_schedule(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus)
void ke_timer_schedule(Eq_2 ra, Eq_2 s0, Eq_2 a4, Eq_2 s2, ptr32 mstatus)
{
	struct Eq_59925 * s2_16 = (struct Eq_59925 *) 0x44B00000;
	while (true)
	{
		Eq_2 a5_22 = ke_evt_clear(0x04000000, a4, mstatus);
		if (s0 == 0x00)
			break;
		Eq_2 a4_27 = s2_16->dw0120;
		int32 a5_29 = a5_22 - a4_27;
		int32 s0_28 = *((word32) a5_22 + 8);
		Eq_2 a5_30 = a5_29 + -50;
		if (a5_29 >= ~0x31)
		{
			word32 a5_33;
			ke_timer_hw_set(s0_28, a4_27, mstatus, out a5_33);
			a4_27 = s2_16->dw0120;
			a5_30 = a5_33 - a4_27;
			if (a5_30 >= 0x00)
				return;
		}
		word32 a5_156;
		Eq_2 a0_51 = co_list_pop_front(a4_27, a5_30, out a5_156);
		word32 s3_161;
		Eq_2 s0_70;
		word32 s4_162;
		word32 s2_160;
		word32 a3_159;
		word32 a0_158;
		word32 s1_157;
		word32 s8_163;
		ra = ke_msg_send_basic(ra, (word32) *((word32) a0_51 + 4), (word32) *((word32) a0_51 + 6), a4_27, mstatus, s2, out s0_70, out s1_157, out a0_158, out a3_159, out s2_160, out s3_161, out s4_162, out s8_163);
		word32 s1_164;
		word32 a2_165;
		word32 a3_166;
		word32 a5_167;
		word32 s3_168;
		word32 s4_169;
		word32 s8_170;
		s0 = ke_free(s0_70, mstatus, out s1_164, out a2_165, out a3_166, out a4, out a5_167, out s2_16, out s3_168, out s4_169, out s8_170);
	}
	word32 a5_155;
	ke_timer_hw_set(0x00, a4, mstatus, out a5_155);
}

// 23015110: Register Eq_2 bl60x_current_time_us(Register ptr32 a0, Register out (ptr32 Eq_21405) a5Out)
// Called from:
//      mm_check_rssi
Eq_2 bl60x_current_time_us(ptr32 a0, struct Eq_21405 & a5Out)
{
	Eq_2 a4_5 = *(union Eq_2 *) 0x44B080A4;
	struct Eq_21405 * a5_6 = *(struct Eq_21405 **) 0x44B080A8;
	*a4_5 = a0;
	a5_6->ptr0004 = a0;
	a5Out = a5_6;
	return a4_5;
}

// 23015122: Register Eq_2 mac_ie_find(Register Eq_2 a0, Register (ptr32 byte) a1, Register Eq_29797 a2, Register out Eq_29797 a5Out)
// Called from:
//      scan_search_ds
//      me_beacon_check
//      apm_probe_req_handler
//      apm_assoc_req_handler
//      me_extract_rate_set
//      me_extract_power_constraint
//      me_extract_country_reg
//      me_extract_mobility_domain
//      me_extract_csa
//      rxu_mgt_ind_handler
//      bl_rx_scanu_result_ind
Eq_2 mac_ie_find(Eq_2 a0, byte * a1, Eq_29797 a2, union Eq_29797 & a5Out)
{
	word32 a1_5 = a1 + a0;
	while (a0 < a1_5)
	{
		a5 = (word32) *a0;
		if (a5 == a2)
			goto l2301512A;
		word32 a5_11 = (word32) *((byte) a0.u0 + 1);
		a5 = a5_11 + 0x02;
		a0 = (byte) a0.u0 + (a5_11 + 0x02);
	}
	a0.u0 = 0x00;
l2301512A:
	a5Out = a5;
	return a0;
}

// 2301513E: Register Eq_2 mac_vsie_find(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_46618) a2, Register (ptr32 byte) a3, Register out Eq_2 a0Out, Register out (ptr32 Eq_46618) a2Out, Register out Eq_46684 a4Out, Register out ptr32 s4Out)
// Called from:
//      apm_assoc_req_handler
//      rxu_mgt_ind_handler
//      bl_rx_scanu_result_ind
Eq_2 mac_vsie_find(Eq_2 a0, byte * a1, struct Eq_46618 * a2, byte * a3, union Eq_2 & a0Out, struct Eq_46618 & a2Out, union Eq_46684 & a4Out, ptr32 & s4Out)
{
	word32 a1_5 = a1 + a0;
	while (a0 < a1_5)
	{
		if ((word32) *a0 == 0x00DD)
		{
			ptr32 a6_12 = (word32) a0 + 2;
			byte * a5_13 = null;
			do
			{
				if (a3 == a5_127)
				{
					a0Out = a0;
					a2Out = a2;
					a4Out.u0 = 0x00DD;
					s4Out = s4;
					return s1;
				}
				a5_13 = a5_127 + 1;
				a5_127 = a5_13;
			} while (CONVERT(Mem0[a2 + a5_13 + -1:byte], byte, word32) == CONVERT(Mem0[a6_12 + a5_127:byte], byte, word32));
		}
		a0 = (word32) a0 + ((word32) (*((word32) a0 + 1)) + 0x02);
	}
	if (a0 == a1_5)
	{
		a0Out.u0 = 0x00;
		a2Out = a2;
		a4Out.u0 = 0x00DD;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_46684 a4_47;
		ptr32 s4_49;
		word32 a2_124;
		word32 s8_126;
		word32 a5_125;
		word32 a1_123;
		word32 a0_122;
		Eq_2 s1_48 = puts(0x230AD23C, out a0_122, out a1_123, out a2_124, out a4_47, out a5_125, out s4_49, out s8_126);
		a0Out.u0 = 0x00;
		a2Out = dwArg10;
		a4Out = a4_47;
		s4Out = s4_49;
		return s1_48;
	}
}

// 2301519C: Register Eq_2 GetTxEAPOLBuffer(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_60113) a5Out, Register out ptr32 s5Out)
// Called from:
//      GeneratePWKMsg2
//      GenerateGrpMsg2
//      GeneratePWKMsg4
//      PrepDefaultEapolMsg
Eq_2 GetTxEAPOLBuffer(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg0158, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a4Out, struct Eq_60113 & a5Out, ptr32 & s5Out)
{
	Eq_2 s1_156;
	Eq_2 s0_102;
	word32 s3_38;
	word32 s1_183;
	word32 a2_184;
	word32 a6_185;
	word32 s4_186;
	word32 s6_187;
	word32 s7_188;
	word32 s8_189;
	struct Eq_60113 ** s2_37;
	struct Eq_60113 * a5_151;
	ptr32 s5_162;
	if (dbg_test_print(&g_b230AD254, dwArg0158, out s1_183, out a2_184, out a5_151, out a6_185, out s2_37, out s3_38, out s4_186, out s5_162, out s6_187, out s7_188, out s8_189) == 0x00)
	{
		Eq_2 a0_46;
		word32 s2_198;
		s1_156 = ke_malloc((struct Eq_6885 *) 0x0C, a3, a4, mstatus, dwArg18, out a0_46, out a5_151, out s2_198);
		if (a0_46 == 0x00)
		{
l230151DE:
			s0_102.u0 = 0x00;
l230151E0:
			s1Out = s1_156;
			a0Out = s0_102;
			a4Out = a4;
			a5Out = a5_151;
			s5Out = s5_162;
			return ra;
		}
		Eq_2 a3_58;
		word32 t1_199;
		word32 a0_200;
		word32 a1_201;
		word32 a2_202;
		word32 a5_203;
		ra = memset(ra, a0_46, 0x00, 0x0C, out t1_199, out a0_200, out a1_201, out a2_202, out a3_58, out a4, out a5_203);
		struct Eq_60216 * a0_65;
		s1_156 = ke_malloc((struct Eq_6885 *) 0x0200, a3_58, a4, mstatus, dwArg18, out a0_65, out a5_151, out s2_37);
		a0_65->t0008 = a0_46;
		if (a0_65 == null)
			goto l230151DE;
	}
	*a5_151->ptr0008 = s3_38;
	*s2_37 = (struct Eq_60113 **) a5_151;
	word32 a2_190;
	word32 a6_191;
	word32 s2_192;
	word32 s3_193;
	word32 s4_194;
	word32 s6_195;
	word32 s7_196;
	word32 s8_197;
	s0_102 = dbg_test_print(&g_b230AD268, dwArg0158, out s1_156, out a2_190, out a5_151, out a6_191, out s2_192, out s3_193, out s4_194, out s5_162, out s6_195, out s7_196, out s8_197);
	goto l230151E0;
}

// 23015230: Register Eq_2 UpdateEAPOLWcbLenAndTransmit(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      GeneratePWKMsg2
//      GenerateGrpMsg2
//      GeneratePWKMsg4
//      GeneratePWKMsg1
//      GeneratePWKMsg3
Eq_2 UpdateEAPOLWcbLenAndTransmit(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s10Out)
{
	struct Eq_60247 * a5_29;
	word32 s4_33;
	word32 s1_156;
	word32 a2_157;
	word32 a6_158;
	word32 s2_159;
	word32 s3_160;
	word32 s5_161;
	word32 s6_162;
	word32 s7_163;
	word32 s8_164;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_156, out a2_157, out a5_29, out a6_158, out s2_159, out s3_160, out s4_33, out s5_161, out s6_162, out s7_163, out s8_164);
	Eq_2 a0_53;
	ptr32 s10_79;
	Eq_2 ra_61 = txl_frame_send_eapol_frame(ra, (word32) a5_29->b0001, null, s4_33 + 4, fflags, frm, mstatus, dwLoc08, dwArg28, dwArg54, dwArg5C, dwArg78, dwArg98, dwArgB8, out a0_53, out s10_79);
	ptr32 a4_95;
	word32 s1_165;
	word32 a2_166;
	word32 a3_167;
	word32 a4_168;
	word32 a5_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s8_173;
	word32 s1_174;
	word32 a2_175;
	word32 a3_176;
	word32 a5_177;
	word32 s2_178;
	word32 s3_179;
	word32 s4_180;
	word32 s8_181;
	ke_free(ke_free(a0_53, mstatus, out s1_165, out a2_166, out a3_167, out a4_168, out a5_169, out s2_170, out s3_171, out s4_172, out s8_173), mstatus, out s1_174, out a2_175, out a3_176, out a4_95, out a5_177, out s2_178, out s3_179, out s4_180, out s8_181);
	ptr32 s1_122;
	ptr32 s3_128;
	ptr32 s5_129;
	ptr32 s7_131;
	word32 a2_182;
	word32 a5_183;
	word32 a6_184;
	word32 s2_185;
	word32 s4_186;
	word32 s6_187;
	word32 s8_188;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_122, out a2_182, out a5_183, out a6_184, out s2_185, out s3_128, out s4_186, out s5_129, out s6_187, out s7_131, out s8_188);
	s1Out = s1_122;
	a4Out = a4_95;
	s3Out = s3_128;
	s5Out = s5_129;
	s7Out = s7_131;
	s10Out = s10_79;
	return ra_61;
}

// 230152AE: Register word32 keyMgmtProcessMsgExt(Stack Eq_2 dwArg38, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s7Out)
// Called from:
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
word32 keyMgmtProcessMsgExt(Eq_2 dwArg38, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s7Out)
{
	word32 s1_69;
	word32 a2_70;
	word32 a5_71;
	word32 a6_72;
	word32 s2_73;
	word32 s3_74;
	word32 s4_75;
	word32 s5_76;
	word32 s6_77;
	word32 s7_78;
	word32 s8_79;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_69, out a2_70, out a5_71, out a6_72, out s2_73, out s3_74, out s4_75, out s5_76, out s6_77, out s7_78, out s8_79);
	word32 s1_43;
	ptr32 s2_48;
	ptr32 s7_52;
	word32 a2_80;
	word32 a5_81;
	word32 a6_82;
	word32 s3_83;
	word32 s4_84;
	word32 s5_85;
	word32 s6_86;
	word32 s8_87;
	dbg_test_print(&g_b230AD268, dwArg0168, out s1_43, out a2_80, out a5_81, out a6_82, out s2_48, out s3_83, out s4_84, out s5_85, out s6_86, out s7_52, out s8_87);
	0x00 = (int8) dwArg38;
	a0Out = 0x01;
	s2Out = s2_48;
	s7Out = s7_52;
	return s1_43;
}

