pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23015302: Register word32 KeyMgmtInitSta(Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out, Register out ptr32 s5Out)
// Called from:
//      supplicantInitSession
word32 KeyMgmtInitSta(Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out, ptr32 & s5Out)
{
	word32 s1_96;
	word32 a2_97;
	word32 a5_98;
	word32 a6_99;
	word32 s2_100;
	word32 s3_101;
	word32 s4_102;
	word32 s5_103;
	word32 s6_104;
	word32 s7_105;
	word32 s8_106;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_96, out a2_97, out a5_98, out a6_99, out s2_100, out s3_101, out s4_102, out s5_103, out s6_104, out s7_105, out s8_106);
	word32 s2_107;
	KeyMgmtSta_InitSession(dwArg0138, dwArg0158, out s2_107);
	ptr32 s2_76;
	ptr32 s5_78;
	word32 s1_108;
	word32 a2_109;
	word32 a5_110;
	word32 a6_111;
	word32 s3_112;
	word32 s4_113;
	word32 s6_114;
	word32 s7_115;
	word32 s8_116;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_108, out a2_109, out a5_110, out a6_111, out s2_76, out s3_112, out s4_113, out s5_78, out s6_114, out s7_115, out s8_116);
	s2Out = s2_76;
	s5Out = s5_78;
	return 587911784;
}

// 23015364: void keyMgmtSta_StartSession(Register ptr32 mstatus, Stack word32 dwArgA8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
// Called from:
//      supplicantInitSession
void keyMgmtSta_StartSession(ptr32 mstatus, word32 dwArgA8, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	Eq_2 s5_45;
	Eq_2 s6_46;
	word32 s1_148;
	word32 a2_149;
	word32 a5_150;
	word32 a6_151;
	word32 s2_152;
	word32 s3_153;
	word32 s4_154;
	word32 s7_155;
	word32 s8_156;
	Eq_2 s0_37 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_148, out a2_149, out a5_150, out a6_151, out s2_152, out s3_153, out s4_154, out s5_45, out s6_46, out s7_155, out s8_156);
	*((word32) *((word32) s0_37 + 8) + 364) = s0_37;
	word32 a1_157;
	word32 a2_158;
	word32 a3_159;
	word32 a4_160;
	word32 a5_161;
	word32 a6_162;
	word32 a7_163;
	memcpy(587911808, s6_46, 0x06, out a1_157, out a2_158, out a3_159, out a4_160, out a5_161, out a6_162, out a7_163);
	Eq_2 a4_71;
	word32 a1_164;
	word32 a2_165;
	word32 a3_166;
	word32 a5_167;
	word32 a6_168;
	word32 a7_169;
	memcpy(0x230AD2A6, s5_45, 0x06, out a1_164, out a2_165, out a3_166, out a4_71, out a5_167, out a6_168, out a7_169);
	word32 s3_170;
	keyMgmtSta_StartSession_internal(a4_71, mstatus, dwArg0138, dwArg0158, out s3_170);
	0x00 = dwArgA8;
	word32 s1_171;
	word32 a2_172;
	word32 a5_173;
	word32 a6_174;
	word32 s2_175;
	word32 s3_176;
	word32 s4_177;
	word32 s5_178;
	word32 s6_179;
	word32 s7_180;
	word32 s8_181;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_171, out a2_172, out a5_173, out a6_174, out s2_175, out s3_176, out s4_177, out s5_178, out s6_179, out s7_180, out s8_181);
}

// 230153FE: Register Eq_2 init_customApp_mibs(Register Eq_2 ra, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      supplicantDisable
//      supplicantInit
Eq_2 init_customApp_mibs(Eq_2 ra, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & s3Out, ptr32 & s4Out)
{
	word32 s1_105;
	word32 a2_106;
	word32 a5_107;
	word32 a6_108;
	word32 s2_109;
	word32 s3_110;
	word32 s4_111;
	word32 s5_112;
	word32 s6_113;
	word32 s7_114;
	word32 s8_115;
	Eq_2 s0_27 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_105, out a2_106, out a5_107, out a6_108, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115);
	word32 t1_116;
	word32 a0_117;
	word32 a1_118;
	word32 a2_119;
	word32 a3_120;
	word32 a4_121;
	word32 a5_122;
	word32 t1_123;
	word32 a0_124;
	word32 a1_125;
	word32 a2_126;
	word32 a3_127;
	word32 a4_128;
	word32 a5_129;
	Eq_2 ra_59 = memset(memset(ra, (word32) s0_27 + 50, 0x00, 0x03, out t1_116, out a0_117, out a1_118, out a2_119, out a3_120, out a4_121, out a5_122), (word32) s0_27 + 53, 0x00, 0x1C, out t1_123, out a0_124, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129);
	*((word32) s0_27 + 54) = (word16) ((word32) *((word32) s0_27 + 54) | 1);
	ptr32 s1_79;
	ptr32 s4_80;
	ptr32 s3_85;
	word32 a2_130;
	word32 a5_131;
	word32 a6_132;
	word32 s2_133;
	word32 s5_134;
	word32 s6_135;
	word32 s7_136;
	word32 s8_137;
	s0Out = dbg_test_print(&g_b230AD268, dwArg0178, out s1_79, out a2_130, out a5_131, out a6_132, out s2_133, out s3_85, out s4_80, out s5_134, out s6_135, out s7_136, out s8_137);
	s1Out = s1_79;
	s3Out = s3_85;
	s4Out = s4_80;
	return ra_59;
}

// 23015478: Register word32 supplicantIsEnabled(Stack Eq_2 dwArg0158, Register out ptr32 s2Out)
// Called from:
//      supplicantInitSession
//      supplicantDisable
word32 supplicantIsEnabled(Eq_2 dwArg0158, ptr32 & s2Out)
{
	word32 a5_25;
	word32 s1_99;
	word32 a2_100;
	word32 a6_101;
	word32 s3_102;
	word32 s4_103;
	word32 s5_104;
	word32 s6_105;
	word32 s7_106;
	word32 s8_107;
	ptr32 s2_33;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_99, out a2_100, out a5_25, out a6_101, out s2_33, out s3_102, out s4_103, out s5_104, out s6_105, out s7_106, out s8_107);
	if (a5_25 != 0x00)
	{
		word32 s1_108;
		word32 a2_109;
		word32 a5_110;
		word32 a6_111;
		word32 s3_112;
		word32 s4_113;
		word32 s5_114;
		word32 s6_115;
		word32 s7_116;
		word32 s8_117;
		dbg_test_print(&g_b230AD268, dwArg0158, out s1_108, out a2_109, out a5_110, out a6_111, out s2_33, out s3_112, out s4_113, out s5_114, out s6_115, out s7_116, out s8_117);
	}
	s2Out = s2_33;
	return 0x00;
}

// 230154DE: void supplicantInitSession(Register ptr32 mstatus, Stack word32 dwArg88, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
// Called from:
//      sm_assoc_rsp_handler
void supplicantInitSession(ptr32 mstatus, word32 dwArg88, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	word32 s1_201;
	word32 a2_202;
	word32 a5_203;
	word32 a6_204;
	word32 s2_205;
	word32 s3_206;
	word32 s4_207;
	word32 s5_208;
	word32 s6_209;
	word32 s7_210;
	word32 s8_211;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_201, out a2_202, out a5_203, out a6_204, out s2_205, out s3_206, out s4_207, out s5_208, out s6_209, out s7_210, out s8_211);
	word32 s2_212;
	if (supplicantIsEnabled(dwArg0138, out s2_212) != 0x00)
	{
		Eq_2 s2_75;
		Eq_2 s5_78;
		struct Eq_60783 * a5_89;
		word32 a1_213;
		word32 a2_214;
		word32 a3_215;
		word32 a4_216;
		word32 a6_217;
		word32 a7_218;
		memcpy(KeyMgmtInitSta(dwArg0118, dwArg0138, dwArg0158, out s2_75, out s5_78) + 0x06, s5_78, s2_75, out a1_213, out a2_214, out a3_215, out a4_216, out a5_89, out a6_217, out a7_218);
		a5_89->b0005 = (byte) s2_75;
		keyMgmtSta_StartSession(mstatus, dwArg88, dwArg0118, dwArg0138, dwArg0158);
	}
	word32 s1_219;
	word32 a2_220;
	word32 a5_221;
	word32 a6_222;
	word32 s2_223;
	word32 s3_224;
	word32 s4_225;
	word32 s5_226;
	word32 s6_227;
	word32 s7_228;
	word32 s8_229;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_219, out a2_220, out a5_221, out a6_222, out s2_223, out s3_224, out s4_225, out s5_226, out s6_227, out s7_228, out s8_229);
}

