pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23015576: Register Eq_2 supplicantDisable(Register Eq_2 ra, Register Eq_2 a4, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      mm_sta_del
Eq_2 supplicantDisable(Eq_2 ra, Eq_2 a4, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 s1_158;
	word32 a2_159;
	word32 a5_160;
	word32 a6_161;
	word32 s2_162;
	word32 s3_163;
	word32 s4_164;
	word32 s5_165;
	word32 s6_166;
	word32 s7_167;
	word32 s8_168;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_158, out a2_159, out a5_160, out a6_161, out s2_162, out s3_163, out s4_164, out s5_165, out s6_166, out s7_167, out s8_168);
	ptr32 s2_46;
	word32 a0_39 = supplicantIsEnabled(dwArg0138, out s2_46);
	if (a0_39 == 0x00)
	{
		s2Out = s2_46;
		return ra;
	}
	else
	{
		word32 a2_169;
		word32 a5_170;
		mm_timer_clear(a0_39 + 348, a4, out a2_169, out a5_170);
		*((word32) a4 + 53) = (byte) ((word32) *((word32) a4 + 53) & ~0x01);
		word32 s0_171;
		word32 s1_172;
		word32 s3_173;
		word32 s4_174;
		Eq_2 ra_80 = init_customApp_mibs(ra, dwArg0138, dwArg0158, out s0_171, out s1_172, out s3_173, out s4_174);
		ptr32 s2_114;
		word32 s1_175;
		word32 a2_176;
		word32 a5_177;
		word32 a6_178;
		word32 s3_179;
		word32 s4_180;
		word32 s5_181;
		word32 s6_182;
		word32 s7_183;
		word32 s8_184;
		dbg_test_print(&g_b230AD268, dwArg0178, out s1_175, out a2_176, out a5_177, out a6_178, out s2_114, out s3_179, out s4_180, out s5_181, out s6_182, out s7_183, out s8_184);
		s2Out = s2_114;
		return ra_80;
	}
}

// 230155FE: Register Eq_2 supplicantEnable(Register (ptr32 Eq_21793) a4, Stack (ptr32 Eq_21638) dwArgA8, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_21814) s1Out, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out)
// Called from:
//      mm_sta_add
Eq_2 supplicantEnable(struct Eq_21793 * a4, struct Eq_21638 * dwArgA8, Eq_2 dwArg0158, Eq_2 dwArg0178, struct Eq_20979 & s1Out, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out)
{
	Eq_2 a1_102;
	word32 s4_44;
	up32 s2_48;
	Eq_2 s3_49;
	Eq_2 s5_50;
	up32 s6_51;
	word32 a6_277;
	word32 s7_278;
	word32 s8_279;
	word32 s1_274;
	word32 a2_275;
	word32 a5_276;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_274, out a2_275, out a5_276, out a6_277, out s2_48, out s3_49, out s4_44, out s5_50, out s6_51, out s7_278, out s8_279);
	a4->b0035 = (byte) ((word32) a4->b0035 | 1);
	if (s2_48 >= s6_51 + -4)
	{
		a4->w0036 = (word16) ((word32) a4->w0036 | 32);
		a4->b0035 = (byte) ((word32) a4->b0035 | 4);
		a4->w004E = (word16) ((word32) a4->w004E | 1);
		word32 a1_280;
		word32 a2_281;
		word32 a3_282;
		word32 a4_283;
		word32 a5_284;
		word32 a6_285;
		word32 a7_286;
		memcpy(0x230AD28C, s5_50, 0x01, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284, out a6_285, out a7_286);
		struct Eq_61015 * a5_137;
		word32 a1_287;
		word32 a2_288;
		word32 a3_289;
		word32 a4_290;
		word32 a6_291;
		word32 a7_292;
		memcpy(587911877, s3_49, 0x01, out a1_287, out a2_288, out a3_289, out a4_290, out a5_137, out a6_291, out a7_292);
		if (s4_44 != 0x00)
			a5_137->b003D = 0x06;
		else
			a5_137->b003D = (byte) s2_48;
		a1_102.u0 = 588036248;
	}
	else
	{
		if (s6_51 != 0x03)
			goto l230156BC;
		a4->w0036 = (word16) ((word32) a4->w0036 | 8);
		word32 a1_300;
		word32 a2_301;
		word32 a3_302;
		word32 a4_303;
		word32 a5_304;
		word32 a6_305;
		word32 a7_306;
		memcpy(0x230AD28C, s5_50, 0x01, out a1_300, out a2_301, out a3_302, out a4_303, out a5_304, out a6_305, out a7_306);
		struct Eq_61098 * a5_85;
		word32 a1_307;
		word32 a2_308;
		word32 a3_309;
		word32 a4_310;
		word32 a6_311;
		word32 a7_312;
		memcpy(587911877, s3_49, 0x01, out a1_307, out a2_308, out a3_309, out a4_310, out a5_85, out a6_311, out a7_312);
		a5_85->b003D = (byte) s2_48;
		a1_102.u0 = 588036276;
	}
	word32 a1_313;
	word32 a2_314;
	word32 a3_315;
	word32 a4_316;
	word32 a5_317;
	word32 a6_318;
	word32 a7_319;
	memcpy(0x230AD2FF, a1_102, 0x03, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out a6_318, out a7_319);
l230156BC:
	null = dwArgA8;
	struct Eq_20979 * s1_203;
	ptr32 s4_204;
	ptr32 s2_208;
	byte * s3_209;
	word32 a2_293;
	word32 a5_294;
	word32 a6_295;
	word32 s5_296;
	word32 s6_297;
	word32 s7_298;
	word32 s8_299;
	Eq_2 s0_202 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_203, out a2_293, out a5_294, out a6_295, out s2_208, out s3_209, out s4_204, out s5_296, out s6_297, out s7_298, out s8_299);
	s1Out = s1_203;
	s2Out = s2_208;
	s3Out = s3_209;
	s4Out = s4_204;
	return s0_202;
}

// 23015738: Register word32 keyMgmtFormatWpaRsnIe(Stack Eq_2 dwArg04, Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 a4Out)
// Called from:
//      GeneratePWKMsg2
word32 keyMgmtFormatWpaRsnIe(Eq_2 dwArg04, Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & a4Out)
{
	word32 s1_97;
	word32 a2_98;
	word32 a5_99;
	word32 a6_100;
	word32 s2_101;
	word32 s3_102;
	word32 s4_103;
	word32 s5_104;
	word32 s6_105;
	word32 s7_106;
	word32 s8_107;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_97, out a2_98, out a5_99, out a6_100, out s2_101, out s3_102, out s4_103, out s5_104, out s6_105, out s7_106, out s8_107);
	struct Eq_61170 * s3_57;
	word32 s1_108;
	word32 a2_109;
	word32 a5_110;
	word32 a6_111;
	word32 s2_112;
	word32 s4_113;
	word32 s5_114;
	word32 s6_115;
	word32 s7_116;
	word32 s8_117;
	dbg_test_print(&g_b230AD268, dwArg0158, out s1_108, out a2_109, out a5_110, out a6_111, out s2_112, out s3_57, out s4_113, out s5_114, out s6_115, out s7_116, out s8_117);
	struct Eq_23616 * a0_62 = (word32) s3_57->b0001;
	ptr32 a4_74;
	a0Out = mm_get_rsn_wpa_ie(a0_62, dwArg04, out a4_74);
	a4Out = a4_74;
	return s1;
}

// 2301579E: Register Eq_2 GeneratePWKMsg2(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0198, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
Eq_2 GeneratePWKMsg2(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0198, ptr32 & a0Out, ptr32 & a4Out, ptr32 & s10Out)
{
	ptr32 a0_242;
	word32 s1_339;
	word32 a2_340;
	word32 a5_341;
	word32 a6_342;
	word32 s2_343;
	word32 s3_344;
	word32 s4_345;
	word32 s5_346;
	word32 s6_347;
	word32 s7_348;
	word32 s8_349;
	dbg_test_print(&g_b230AD254, dwArg0138, out s1_339, out a2_340, out a5_341, out a6_342, out s2_343, out s3_344, out s4_345, out s5_346, out s6_347, out s7_348, out s8_349);
	word32 a0_57;
	word32 a5_350;
	word32 s5_351;
	Eq_2 s1_232;
	ptr32 a4_197;
	Eq_2 ra_75 = GetTxEAPOLBuffer(ra, a3, a4, mstatus, s2, dwArg0118, out s1_232, out a0_57, out a4_197, out a5_350, out s5_351);
	if (a0_57 != 0x00)
	{
		struct Eq_61270 * s0_91;
		word32 a4_352;
		Eq_2 ra_105 = KeyMgmtSta_PrepareEAPOLFrame(ra_75, dwArgF8, dwArg0118, dwArg0138, out s0_91, out a4_352);
		ui32 a4_113 = (word32) s0_91->b0012;
		if (a4_113 != 0x01)
		{
			uint32 a0_121;
			struct Eq_61339 * s0_129 = keyMgmtFormatWpaRsnIe(dwLoc3C, dwArg0118, out a0_121, out a4_113);
			s0_129->b006F = (byte) a0_121;
			s0_129->b0070 = (byte) (a0_121 >> 8);
		}
		word32 s1_353;
		word32 s3_354;
		word32 s5_355;
		word32 s7_356;
		UpdateEAPOLWcbLenAndTransmit(KeyMgmtSta_PopulateEAPOLLengthMic(ra_105, a4_113, dwArgE8, dwArg0108), fflags, frm, mstatus, dwLoc18, dwArg14, dwArg1C, dwArg38, s1, dwArg78, dwArg0118, dwArg0138, out s1_353, out a4_197, out s3_354, out s5_355, out s7_356, out s10);
		word32 a2_357;
		word32 a5_358;
		word32 a6_359;
		word32 s2_360;
		word32 s3_361;
		word32 s4_362;
		word32 s5_363;
		word32 s6_364;
		word32 s7_365;
		word32 s8_366;
		dbg_test_print(&g_b230AD268, dwArg0138, out s1_232, out a2_357, out a5_358, out a6_359, out s2_360, out s3_361, out s4_362, out s5_363, out s6_364, out s7_365, out s8_366);
		a0_242 = 0x00;
	}
	else
		a0_242 = 0x01;
	0x00 = (int8) dwArg0198;
	a0Out = a0_242;
	a4Out = a4_197;
	s10Out = s10;
	return s1_232;
}

// 23015882: Register word32 KeyMgmtStaHsk_Recvd_PWKMsg1(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s10Out)
// Called from:
//      ProcessKeyMgmtDataSta
word32 KeyMgmtStaHsk_Recvd_PWKMsg1(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s10Out)
{
	word32 s1_449;
	word32 a2_450;
	word32 a5_451;
	word32 a6_452;
	word32 s2_453;
	word32 s3_454;
	word32 s4_455;
	word32 s5_456;
	word32 s7_458;
	word32 s6_457;
	word32 s8_459;
	dbg_test_print(&g_b230AD254, dwArg0138, out s1_449, out a2_450, out a5_451, out a6_452, out s2_453, out s3_454, out s4_455, out s5_456, out s6_457, out s7_458, out s8_459);
	word32 a0_57;
	word32 a3_461;
	word32 s1_460;
	word32 s7_463;
	word32 s2_462;
	word32 s9_464;
	ptr32 s10_234;
	word32 a4_113;
	Eq_2 ra_65 = GetKeyMsgNonceFromEAPOL(ra, dwLoc40, dwLoc3C, dwLoc18, dwLoc08, dwArg0C, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_460, out a0_57, out a3_461, out a4_113, out s2_462, out s7_463, out s9_464, out s10_234);
	if (a0_57 != 0x00)
	{
		Eq_2 a0_88;
		word32 s3_465;
		word32 s4_466;
		Eq_2 s2_160;
		Eq_2 a4_186;
		supplicantAkmIsWpaWpa2(dwArg0118, out a0_88, out a4_186, out s2_160, out s3_465, out s4_466);
		Eq_2 s1_106 = a0_88;
		if (a0_88 != 0x00)
		{
			if (supplicantAkmIsWpaWpa2Psk(dwArgF8, dwArg0118, out a4_113) == 0x00 || pmkCacheFindPSK(ra_65, mstatus, s2, dwArg18, s1, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out a4_113) == 0x00)
				goto l230158D8;
			s2_160 = supplicantAkmUsesKdf(dwArg0108, dwArg0128);
			a4_186 = KeyMgmtSta_DeriveKeys(ra_65);
			s1_106.u0 = 0x01;
		}
		word32 a0_212;
		word32 s1_221 = GeneratePWKMsg2(ra_65, s1_106, 0x00, a4_186, s2_160, fflags, frm, mstatus, s4, s0, dwLoc08, dwArg38, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0158, out a0_212, out a4_113, out s10_234);
		if (a0_212 == 0x00 && s1_221 == 0x01)
		{
			word32 s3_478;
			word32 s5_479;
			updateApReplayCounter(dwArg44, dwArg0118, out a4_113, out s3_478, out s5_479)->dw00CC = 0x00;
		}
		word32 s1_467;
		word32 a2_468;
		word32 a5_469;
		word32 a6_470;
		word32 s2_471;
		word32 s3_472;
		word32 s4_473;
		word32 s5_474;
		word32 s6_475;
		word32 s7_476;
		word32 s8_477;
		dbg_test_print(&g_b230AD268, dwArg0138, out s1_467, out a2_468, out a5_469, out a6_470, out s2_471, out s3_472, out s4_473, out s5_474, out s6_475, out s7_476, out s8_477);
l230158DA:
		0x00 = (int8) dwArg0198;
		s10Out = s10_234;
		return a4_113;
	}
	else
	{
l230158D8:
		goto l230158DA;
	}
}

