pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301599E: Register Eq_2 supplicantInit(Register Eq_2 ra, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      allocSupplicantData
Eq_2 supplicantInit(Eq_2 ra, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out)
{
	word32 s1_151;
	word32 a2_152;
	word32 a5_153;
	word32 a6_154;
	word32 s2_155;
	word32 s3_156;
	word32 s4_157;
	word32 s5_158;
	word32 s6_159;
	word32 s7_160;
	word32 s8_161;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_151, out a2_152, out a5_153, out a6_154, out s2_155, out s3_156, out s4_157, out s5_158, out s6_159, out s7_160, out s8_161);
	struct Eq_61604 * s0_50;
	Eq_2 s4_54;
	ptr32 a3_81;
	word32 s1_162;
	word32 s3_163;
	word32 t1_164;
	word32 a0_165;
	word32 a1_166;
	word32 a2_167;
	word32 a3_168;
	word32 a4_169;
	word32 a5_170;
	word32 t1_171;
	word32 a0_172;
	word32 a1_173;
	word32 a2_174;
	word32 a4_175;
	word32 a5_176;
	Eq_2 ra_84 = memset(memset(init_customApp_mibs(ra, dwArg0138, dwArg0158, out s0_50, out s1_162, out s3_163, out s4_54), &s0_50->dw0158 + 16, 0x00FF, 0x04, out t1_164, out a0_165, out a1_166, out a2_167, out a3_168, out a4_169, out a5_170), s4_54, 0x00, 0x0144, out t1_171, out a0_172, out a1_173, out a2_174, out a3_81, out a4_175, out a5_176);
	s0_50->dw0158 = 0x00;
	s0_50->dw0154 = 0x01;
	s0_50->b0150 = 0x00;
	word32 s3_177;
	KeyMgmtResetCounter(dwArg0148, dwArg0158, out s3_177);
	ptr32 s1_124;
	ptr32 s2_129;
	word32 a2_178;
	word32 a5_179;
	word32 a6_180;
	word32 s3_181;
	word32 s4_182;
	word32 s5_183;
	word32 s6_184;
	word32 s7_185;
	word32 s8_186;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_124, out a2_178, out a5_179, out a6_180, out s2_129, out s3_181, out s4_182, out s5_183, out s6_184, out s7_185, out s8_186);
	s1Out = s1_124;
	a3Out = a3_81;
	s2Out = s2_129;
	return ra_84;
}

// 23015A30: Register Eq_2 allocSupplicantData(Register Eq_2 ra, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_27529) s2Out, Register out ptr32 s3Out)
// Called from:
//      bl_init
Eq_2 allocSupplicantData(Eq_2 ra, Eq_2 dwArg38, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_27529 & s2Out, ptr32 & s3Out)
{
	struct Eq_27529 * s2_31;
	ptr32 s3_32;
	word32 s1_149;
	word32 a2_150;
	word32 a5_151;
	word32 a6_152;
	word32 s4_153;
	word32 s5_154;
	word32 s6_155;
	word32 s7_156;
	word32 s8_157;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_149, out a2_150, out a5_151, out a6_152, out s2_31, out s3_32, out s4_153, out s5_154, out s6_155, out s7_156, out s8_157);
	if (s2_31->dw0008 != 0x00)
	{
		0x00 = (int8) dwArg38;
		s0Out = s0;
		a0Out = 0x230AD254;
		a2Out = dwArg10;
		a3Out = a3;
		s2Out = s2_31;
		s3Out = s3_32;
		return ra;
	}
	else
	{
		union Eq_2 * a5_41 = (word32) s2_31->b0000;
		if (a5_41 == null)
		{
			Eq_2 s1_43 = *a5_41;
			if (a5_41 == null)
			{
				*(union Eq_2 *) 0x01 = s1_43;
				word32 s1_56;
				struct Eq_61776 * s2_57;
				ra = supplicantInit(ra, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s1_56, out a3, out s2_57);
				s2_57->dw0008 = s1_56;
			}
		}
		0x00 = (int8) dwArg38;
		ptr32 a2_81;
		struct Eq_27529 * s2_90;
		ptr32 s3_91;
		word32 s1_158;
		word32 a5_159;
		word32 a6_160;
		word32 s4_161;
		word32 s5_162;
		word32 s6_163;
		word32 s7_164;
		word32 s8_165;
		s0Out = dbg_test_print(&g_b230AD268, dwArg0178, out s1_158, out a2_81, out a5_159, out a6_160, out s2_90, out s3_91, out s4_161, out s5_162, out s6_163, out s7_164, out s8_165);
		a0Out = 587911784;
		a2Out = a2_81;
		a3Out = a3;
		s2Out = s2_90;
		s3Out = s3_91;
		return ra;
	}
}

// 23015AC0: Register word32 keyMgmtGetKeySize(Stack word32 dwArg38, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out (ptr32 byte) s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out)
// Called from:
//      add_key_to_mac
//      add_mfp_key_to_mac
word32 keyMgmtGetKeySize(word32 dwArg38, Eq_2 dwArg0158, Eq_2 dwArg0168, byte & s1Out, ptr32 & a0Out, ptr32 & s2Out)
{
	word32 s1_103;
	word32 a2_104;
	word32 a5_105;
	word32 a6_106;
	word32 s2_107;
	word32 s3_108;
	word32 s4_109;
	word32 s5_110;
	word32 s6_111;
	word32 s7_112;
	word32 s8_113;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_103, out a2_104, out a5_105, out a6_106, out s2_107, out s3_108, out s4_109, out s5_110, out s6_111, out s7_112, out s8_113);
	word32 s1_114;
	word32 a2_115;
	word32 a5_116;
	word32 a6_117;
	word32 s2_118;
	word32 s3_119;
	word32 s4_120;
	word32 s5_121;
	word32 s6_122;
	word32 s7_123;
	word32 s8_124;
	dbg_test_print(&g_b230AD268, dwArg0158, out s1_114, out a2_115, out a5_116, out a6_117, out s2_118, out s3_119, out s4_120, out s5_121, out s6_122, out s7_123, out s8_124);
	ptr32 a0_71;
	ptr32 s2_78;
	s1Out = keyMgmtGetKeySize_internal(dwArg38, dwArg0168, out a0_71, out s2_78);
	a0Out = a0_71;
	s2Out = s2_78;
	return s1;
}

// 23015B2A: Register Eq_2 add_key_to_mac(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg01B4, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      keyMgmtKeyGroupTxDone.isra.1
//      keyMgmtPlumbPairwiseKey
//      ProcessPWKMsg4
//      InitGroupKey
Eq_2 add_key_to_mac(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg01B4, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s10Out)
{
	Eq_2 s1_14 = a0;
	word32 s2_16 = a1;
	Eq_2 s0_17 = 0x10;
	if ((word32) *a0 == 0x00)
	{
		ui32 a0_18;
		keyMgmtGetKeySize(dwLoc08, dwArg0118, dwArg0128, out s1_14, out a0_18, out s2_16);
		s0_17 = a0_18 & 0x00FF;
	}
	Eq_2 a1_66;
	struct Eq_61885 * a1_42;
	word32 a4_302;
	word32 a5_303;
	word32 t1_298;
	word32 a2_300;
	word32 a3_301;
	word32 a0_299;
	Eq_2 ra_47 = memset(ra, fp + -60, 0x00, 44, out t1_298, out a0_299, out a1_42, out a2_300, out a3_301, out a4_302, out a5_303);
	word32 a5_55 = (word32) *s1_14;
	if (s2_16 != 0x00)
	{
		if (a5_55 == 0x00)
			a1_66 = (char *) a1_42 + 0x00D8;
		else
			a1_66 = (word32) s1_14 + 0x00C4;
	}
	else if (a5_55 == 0x00)
	{
		a1_66 = (char *) a1_42 + 0x0100;
		bLoc3C = (byte) (word32) a1_42->w0126;
	}
	else
	{
		word32 a5_326;
		word32 a4_325;
		struct Eq_62008 * a0_60 = cm_GetApInfo(s1_14, out a4_325, out a5_326);
		a1_66 = &a0_60->dw00B8 + 5;
		bLoc3C = (byte) (word32) a0_60->w00F2;
	}
	word32 a4_330;
	word32 a6_332;
	word32 a7_333;
	word32 a5_331;
	word32 a2_328;
	word32 a3_329;
	word32 a1_327;
	memcpy(fp + -52, a1_66, s0_17, out a1_327, out a2_328, out a3_329, out a4_330, out a5_331, out a6_332, out a7_333);
	byte bLoc38_201 = (byte) s0_17;
	if (s0_17 != 0x10)
	{
		if (s0_17 == 32)
		{
			if (s2_16 != 0x00)
				0x00 = (int8) dwArg01B4;
			goto l23015BF4;
		}
		if (s0_17 != 0x0D)
		{
			if (s0_17 != 0x05)
				assert_err();
			goto l23015BF4;
		}
	}
l23015BF4:
	ptr32 s10_147;
	ptr32 a0_160;
	ptr32 a3_163;
	ptr32 a4_164;
	ptr32 a5_165;
	ptr32 s1_170;
	ptr32 s2_171;
	ptr32 s5_174;
	word32 s0_322;
	word32 s4_324;
	word32 s3_323;
	word32 s8_318;
	word32 s11_320;
	word32 t4_321;
	word32 s9_319;
	word32 s4_314;
	word32 s6_316;
	word32 s7_317;
	word32 s5_315;
	word32 a5_310;
	word32 s2_312;
	word32 s3_313;
	word32 a7_311;
	word32 a1_306;
	word32 a3_308;
	word32 a4_309;
	word32 a2_307;
	word32 s1_304;
	word32 a0_305;
	Eq_2 ra_168 = mm_sec_machwkey_wr(printf(ra_47, &g_t230AD4D4, (word32) bLoc3C, SEQ(nLoc37, bLoc38_201), dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_304, out a0_305, out a1_306, out a2_307, out a3_308, out a4_309, out a5_310, out a7_311, out s2_312, out s3_313, out s4_314, out s5_315, out s6_316, out s7_317, out s8_318, out s9_319, out s10_147, out s11_320, out t4_321), fp + -60, dwArgC8, out s0_322, out s1_170, out a0_160, out a3_163, out a4_164, out a5_165, out s2_171, out s3_323, out s4_324, out s5_174);
	s1Out = s1_170;
	a0Out = a0_160;
	a3Out = a3_163;
	a4Out = a4_164;
	a5Out = a5_165;
	s2Out = s2_171;
	s5Out = s5_174;
	s10Out = s10_147;
	return ra_168;
}

