pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23015C56: Register Eq_2 keyMgmtKeyGroupTxDone.isra.1(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg01A4, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s10Out)
// Called from:
//      GenerateGrpMsg2
//      GeneratePWKMsg4
Eq_2 keyMgmtKeyGroupTxDone.isra.1(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0168, Eq_2 dwArg01A4, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s10Out)
{
	word32 s8_242;
	word32 s7_241;
	word32 s6_240;
	word32 s5_239;
	word32 s4_238;
	word32 s3_237;
	word32 s2_236;
	word32 a6_235;
	word32 a5_234;
	word32 a2_233;
	Eq_2 s1_24;
	Eq_2 s0_34 = *dbg_test_print(&g_b230AD254, dwArg0168, out s1_24, out a2_233, out a5_234, out a6_235, out s2_236, out s3_237, out s4_238, out s5_239, out s6_240, out s7_241, out s8_242);
	struct Eq_20265 * a0_36 = (word32) *((word32) s0_34 + 3);
	if (a0_36 != (struct Eq_20265 *) 0x00FF)
	{
		word32 a2_245;
		word32 a4_246;
		word32 s2_247;
		word32 s3_248;
		word32 s6_249;
		s1_24 = mm_sec_machwkey_del(a0_36, dwArg0108, out a2_245, out a4_246, out s2_247, out s3_248, out s6_249);
	}
	word32 a0_62;
	struct Eq_62126 * a5_67;
	Eq_2 s1_72;
	Eq_2 s2_75;
	Eq_2 s5_78;
	word32 a4_244;
	word32 a3_243;
	ptr32 s10_116;
	Eq_2 ra_113 = add_key_to_mac(ra, s1_24, s0_34, 0x00, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, dwArg01A4, out s1_72, out a0_62, out a3_243, out a4_244, out a5_67, out s2_75, out s5_78, out s10_116);
	a5_67->ptr0008->b0003 = (byte) a0_62;
	a5_67->dw00C8 = 0x01;
	ptr32 a4_109 = 0x01;
	struct Eq_62149 * s0_94 = a5_67->ptr0008;
	Eq_2 a3_95 = a5_67->t00CC;
	if (a3_95 == 0x00)
	{
		a5_67->t00CC.u0 = 0x01;
		ra_113 = sm_handle_supplicant_result(ra_113, s1_72, (word32) s0_94->b0001, 0x00, a3_95, s2_75, s5_78, fflags, frm, mstatus, dwLoc08, dwArg08, dwArg30, dwArg34, dwArg40, dwArg44, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgB8, dwArgBC, dwArgD8, dwArgF8, dwArg0118, out a4_109, out s10_116);
	}
	ptr32 s3_153;
	word32 s1_250;
	word32 a2_251;
	word32 a5_252;
	word32 a6_253;
	word32 s2_254;
	word32 s4_255;
	word32 s5_256;
	word32 s6_257;
	word32 s7_258;
	word32 s8_259;
	dbg_test_print(&g_b230AD268, dwArg0168, out s1_250, out a2_251, out a5_252, out a6_253, out s2_254, out s3_153, out s4_255, out s5_256, out s6_257, out s7_258, out s8_259);
	a4Out = a4_109;
	s3Out = s3_153;
	s10Out = s10_116;
	return ra_113;
}

// 23015CEC: Register word32 GenerateGrpMsg2(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0164, Stack Eq_2 dwArg0198, Register out ptr32 a4Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_GrpMsg1
word32 GenerateGrpMsg2(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0164, Eq_2 dwArg0198, ptr32 & a4Out, ptr32 & s10Out)
{
	word32 a0_220;
	word32 s1_316;
	word32 a2_317;
	word32 a5_318;
	word32 a6_319;
	word32 s2_320;
	word32 s3_321;
	word32 s4_322;
	word32 s5_323;
	word32 s6_324;
	word32 s7_325;
	word32 s8_326;
	dbg_test_print(&g_b230AD254, dwArg0138, out s1_316, out a2_317, out a5_318, out a6_319, out s2_320, out s3_321, out s4_322, out s5_323, out s6_324, out s7_325, out s8_326);
	word32 a0_54;
	word32 s1_327;
	word32 a5_328;
	word32 s5_329;
	ptr32 a4_177;
	Eq_2 ra_72 = GetTxEAPOLBuffer(ra, a3, a4, mstatus, s2, dwArg0118, out s1_327, out a0_54, out a4_177, out a5_328, out s5_329);
	if (a0_54 != 0x00)
	{
		ui32 a4_100;
		word32 s0_330;
		word32 a4_331;
		word32 s3_332;
		word32 s10_333;
		word32 s1_334;
		word32 s3_335;
		word32 s5_336;
		word32 s7_337;
		UpdateEAPOLWcbLenAndTransmit(keyMgmtKeyGroupTxDone.isra.1(KeyMgmtSta_PopulateEAPOLLengthMic(KeyMgmtSta_PrepareEAPOLFrame(ra_72, dwArgF8, dwArg0118, dwArg0138, out s0_330, out a4_100), a4_100, dwArgE8, dwArg0108), fflags, frm, mstatus, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg28, dwArg2C, dwArg3C, dwArg48, dwArg4C, s1, dwArg78, dwArg7C, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0128, dwArg0164, out a4_331, out s3_332, out s10_333), fflags, frm, mstatus, dwLoc18, dwArg14, dwArg1C, dwArg38, s1, dwArg78, dwArg0118, dwArg0138, out s1_334, out a4_177, out s3_335, out s5_336, out s7_337, out s10);
		word32 s1_338;
		word32 a2_339;
		word32 a5_340;
		word32 a6_341;
		word32 s2_342;
		word32 s3_343;
		word32 s4_344;
		word32 s5_345;
		word32 s6_346;
		word32 s7_347;
		word32 s8_348;
		dbg_test_print(&g_b230AD268, dwArg0138, out s1_338, out a2_339, out a5_340, out a6_341, out s2_342, out s3_343, out s4_344, out s5_345, out s6_346, out s7_347, out s8_348);
		a0_220 = 0x00;
	}
	else
		a0_220 = 0x01;
	0x00 = (int8) dwArg0198;
	a4Out = a4_177;
	s10Out = s10;
	return a0_220;
}

