pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23015DA2: Register Eq_2 KeyMgmtStaHsk_Recvd_GrpMsg1(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0144, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s10Out)
// Called from:
//      ProcessKeyMgmtDataSta
Eq_2 KeyMgmtStaHsk_Recvd_GrpMsg1(Eq_2 ra, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0144, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s10Out)
{
	word32 s1_263;
	word32 a2_264;
	word32 a5_265;
	word32 a6_266;
	word32 s2_267;
	word32 s3_268;
	word32 s4_269;
	word32 s5_270;
	word32 s6_271;
	word32 s7_272;
	word32 s8_273;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_263, out a2_264, out a5_265, out a6_266, out s2_267, out s3_268, out s4_269, out s5_270, out s6_271, out s7_272, out s8_273);
	Eq_2 a0_47;
	Eq_2 a3_50;
	Eq_2 s2_60;
	ptr32 s10_104;
	Eq_2 a4_117;
	Eq_2 ra_55 = ProcessRxEAPOL_GrpMsg1(ra, s2, dwLoc04, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a0_47, out a3_50, out a4_117, out s2_60, out s10_104);
	if (a0_47 != 0x00 && GenerateGrpMsg2(ra_55, a0_47, a3_50, a4_117, s2_60, fflags, frm, mstatus, dwLoc20, s4, dwLoc0C, dwLoc04, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg58, dwArg5C, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0144, dwArg0178, out a4_117, out s10_104) == 0x00)
	{
		word32 s3_274;
		word32 s5_275;
		updateApReplayCounter(s3, dwArg0138, out a4_117, out s3_274, out s5_275);
		word32 s1_276;
		word32 a2_277;
		word32 a5_278;
		word32 a6_279;
		word32 s2_280;
		word32 s3_281;
		word32 s4_282;
		word32 s5_283;
		word32 s6_284;
		word32 s7_285;
		word32 s8_286;
		dbg_test_print(&g_b230AD268, dwArg0158, out s1_276, out a2_277, out a5_278, out a6_279, out s2_280, out s3_281, out s4_282, out s5_283, out s6_284, out s7_285, out s8_286);
	}
	s10Out = s10_104;
	return a4_117;
}

// 23015E30: Register Eq_2 add_mfp_key_to_mac(Register Eq_2 ra, Register Eq_2 s1, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s10Out)
// Called from:
//      keyMgmtPlumbPairwiseKey
Eq_2 add_mfp_key_to_mac(Eq_2 ra, Eq_2 s1, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s10Out)
{
	Eq_2 a1_56;
	ui32 a0_16;
	word32 s2_24;
	word32 s1_227;
	byte * s0_22 = keyMgmtGetKeySize(dwLoc08, dwArg0118, dwArg0128, out s1_227, out a0_16, out s2_24);
	word32 a1_38;
	word32 a5_233;
	word32 a3_231;
	word32 a4_232;
	word32 a0_229;
	word32 a2_230;
	word32 t1_228;
	Eq_2 ra_43 = memset(ra, fp + -60, 0x00, 44, out t1_228, out a0_229, out a1_38, out a2_230, out a3_231, out a4_232, out a5_233);
	byte bLoc38_173 = (byte) (a0_16 & 0x00FF);
	word32 a5_53 = (word32) *s0_22;
	if (s2_24 != 0x00)
	{
		if (a5_53 != 0x00)
			goto l23015E84;
		a1_56 = a1_38 + 0x00D8;
	}
	else
	{
		if (a5_53 != 0x00)
			goto l23015E84;
		a1_56 = a1_38 + 0x0100;
	}
	word32 a1_279;
	word32 a2_280;
	word32 a3_281;
	word32 a4_282;
	word32 a5_283;
	word32 a6_284;
	word32 a7_285;
	memcpy(fp + -52, a1_56, a0_16 & 0x00FF, out a1_279, out a2_280, out a3_281, out a4_282, out a5_283, out a6_284, out a7_285);
l23015E84:
	Eq_2 dwLoc38_200 = SEQ(nLoc37, bLoc38_173);
	ptr32 a0_112;
	Eq_2 a3_115;
	ptr32 s10_148;
	word32 s11_251;
	word32 t4_252;
	word32 s9_249;
	word32 s10_250;
	word32 s7_247;
	word32 s8_248;
	word32 s5_245;
	word32 s6_246;
	word32 s3_243;
	word32 s4_244;
	word32 a7_241;
	word32 s2_242;
	word32 a4_239;
	word32 a5_240;
	word32 a2_237;
	word32 a3_238;
	word32 a0_235;
	word32 a1_236;
	word32 s1_234;
	word32 s0_253;
	word32 s1_254;
	word32 a4_255;
	word32 a5_256;
	word32 s2_257;
	word32 s3_258;
	word32 s4_259;
	word32 s5_260;
	word32 s1_261;
	word32 a0_262;
	word32 a1_263;
	word32 a2_264;
	word32 a3_265;
	word32 a4_266;
	word32 a5_267;
	word32 a7_268;
	word32 s2_269;
	word32 s3_270;
	word32 s4_271;
	word32 s5_272;
	word32 s6_273;
	word32 s7_274;
	word32 s8_275;
	word32 s9_276;
	word32 s11_277;
	word32 t4_278;
	Eq_2 ra_146 = printf(mm_sec_machwkey_wr(printf(ra_43, &g_t230AD520, 0x04, dwLoc38_200, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_240, out a7_241, out s2_242, out s3_243, out s4_244, out s5_245, out s6_246, out s7_247, out s8_248, out s9_249, out s10_250, out s11_251, out t4_252), fp + -60, dwArgC8, out s0_253, out s1_254, out a0_112, out a3_115, out a4_255, out a5_256, out s2_257, out s3_258, out s4_259, out s5_260), &g_t230AD570, a3_115, dwLoc38_200, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_261, out a0_262, out a1_263, out a2_264, out a3_265, out a4_266, out a5_267, out a7_268, out s2_269, out s3_270, out s4_271, out s5_272, out s6_273, out s7_274, out s8_275, out s9_276, out s10_148, out s11_277, out t4_278);
	s0Out = a0_112;
	s10Out = s10_148;
	return ra_146;
}

// 23015ED4: Register Eq_2 keyMgmtPlumbPairwiseKey(Register Eq_2 ra, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg01A4, Register out Eq_2 s0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s10Out)
// Called from:
//      keyMgmtKeyPairwiseTxDone.isra.2
Eq_2 keyMgmtPlumbPairwiseKey(Eq_2 ra, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C, Eq_2 dwArgB8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg01A4, union Eq_2 & s0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s10Out)
{
	Eq_2 s1_24;
	word32 a2_177;
	word32 a5_178;
	word32 a6_179;
	word32 s2_180;
	word32 s3_181;
	word32 s4_182;
	word32 s5_183;
	word32 s6_184;
	word32 s7_185;
	word32 s8_186;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_24, out a2_177, out a5_178, out a6_179, out s2_180, out s3_181, out s4_182, out s5_183, out s6_184, out s7_185, out s8_186);
	Eq_2 s0_34 = g_t230AD25C;
	word32 a1_187;
	word32 a2_188;
	word32 a3_189;
	word32 a4_190;
	word32 a5_191;
	word32 a6_192;
	word32 a7_193;
	memcpy(587911980, 0x230AD37C, 40, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a6_192, out a7_193);
	word32 a0_53;
	struct Eq_62748 * a5_58;
	Eq_2 s1_63;
	word32 a3_194;
	word32 a4_195;
	word32 s2_196;
	word32 s5_197;
	ptr32 s10_165;
	Eq_2 ra_164 = add_key_to_mac(ra, s1_24, s0_34, 0x01, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, dwArg01A4, out s1_63, out a0_53, out a3_194, out a4_195, out a5_58, out s2_196, out s5_197, out s10_165);
	struct Eq_62767 * s0_81 = a5_58->ptr0008;
	s0_81->b0004 = (byte) a0_53;
	if ((word32) a5_58->b003D == 0x06)
	{
		struct Eq_62781 * s0_95;
		ra_164 = add_mfp_key_to_mac(ra_164, s1_63, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, out s0_95, out s10_165);
		s0_95->b0005 = (byte) s0_81;
	}
	ptr32 s2_138;
	ptr32 s3_139;
	word32 s1_198;
	word32 a2_199;
	word32 a5_200;
	word32 a6_201;
	word32 s4_202;
	word32 s5_203;
	word32 s6_204;
	word32 s7_205;
	word32 s8_206;
	s0Out = dbg_test_print(&g_b230AD268, dwArg0178, out s1_198, out a2_199, out a5_200, out a6_201, out s2_138, out s3_139, out s4_202, out s5_203, out s6_204, out s7_205, out s8_206);
	s2Out = s2_138;
	s3Out = s3_139;
	s10Out = s10_165;
	return ra_164;
}

// 23015F60: Register Eq_2 keyMgmtKeyPairwiseTxDone.isra.2(Register Eq_2 ra, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0184, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s10Out)
// Called from:
//      GeneratePWKMsg4
Eq_2 keyMgmtKeyPairwiseTxDone.isra.2(Eq_2 ra, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg4C, Eq_2 dwArg98, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0184, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s10Out)
{
	word32 s1_117;
	word32 a2_118;
	word32 a5_119;
	word32 a6_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s5_124;
	word32 s6_125;
	word32 s7_126;
	word32 s8_127;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_117, out a2_118, out a5_119, out a6_120, out s2_121, out s3_122, out s4_123, out s5_124, out s6_125, out s7_126, out s8_127);
	ptr32 s10_51;
	struct Eq_62855 * s3_54;
	word32 s0_128;
	word32 s2_129;
	Eq_2 ra_48 = keyMgmtPlumbPairwiseKey(ra, dwArg00, dwArg04, dwArg4C, dwArg98, dwArgE8, dwArgF8, dwArg0148, dwArg0158, dwArg0184, out s0_128, out s2_129, out s3_54, out s10_51);
	s3_54->ptr0008->dw00D0 = 0x01;
	ptr32 s3_86;
	word32 s1_130;
	word32 a2_131;
	word32 a5_132;
	word32 a6_133;
	word32 s2_134;
	word32 s4_135;
	word32 s5_136;
	word32 s6_137;
	word32 s7_138;
	word32 s8_139;
	dbg_test_print(&g_b230AD268, dwArg0158, out s1_130, out a2_131, out a5_132, out a6_133, out s2_134, out s3_86, out s4_135, out s5_136, out s6_137, out s7_138, out s8_139);
	a4Out = 0x01;
	s3Out = s3_86;
	s10Out = s10_51;
	return ra_48;
}

// 23015FCE: Register word32 GeneratePWKMsg4(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0144, Stack Eq_2 dwArg0164, Stack Eq_2 dwArg0198, Register out ptr32 a4Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg3
word32 GeneratePWKMsg4(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s7, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0144, Eq_2 dwArg0164, Eq_2 dwArg0198, ptr32 & a4Out, ptr32 & s10Out)
{
	word32 a0_328;
	word32 s1_458;
	word32 a2_459;
	word32 a5_460;
	word32 a6_461;
	word32 s2_462;
	word32 s3_463;
	word32 s4_464;
	word32 s5_465;
	word32 s6_466;
	word32 s7_467;
	word32 s8_468;
	dbg_test_print(&g_b230AD254, dwArg0138, out s1_458, out a2_459, out a5_460, out a6_461, out s2_462, out s3_463, out s4_464, out s5_465, out s6_466, out s7_467, out s8_468);
	word32 a0_62;
	word32 s1_469;
	word32 a5_470;
	word32 s5_471;
	ptr32 a4_186;
	Eq_2 ra_80 = GetTxEAPOLBuffer(ra, a3, a4, mstatus, s2, dwArg0118, out s1_469, out a0_62, out a4_186, out a5_470, out s5_471);
	if (a0_62 != 0x00)
	{
		word32 s3_196;
		ui32 a4_108;
		word32 s5_168;
		word32 s7_170;
		word32 s0_472;
		word32 s1_473;
		word32 a4_474;
		word32 s3_475;
		word32 s10_476;
		Eq_2 ra_160 = UpdateEAPOLWcbLenAndTransmit(KeyMgmtSta_PopulateEAPOLLengthMic(KeyMgmtSta_PrepareEAPOLFrame(ra_80, dwArgF8, dwArg0118, dwArg0138, out s0_472, out a4_108), a4_108, dwArgE8, dwArg0108), fflags, frm, mstatus, dwLoc18, dwArg14, dwArg1C, dwArg38, s1, dwArg78, dwArg0118, dwArg0138, out s1_473, out a4_474, out s3_475, out s5_168, out s7_170, out s10_476);
		if (s7_170 != 0x00)
		{
			word32 s1_477;
			word32 a2_478;
			word32 a5_479;
			word32 a6_480;
			word32 s2_481;
			word32 s3_482;
			word32 s4_483;
			word32 s5_484;
			word32 s6_485;
			word32 s7_486;
			word32 s8_487;
			dbg_test_print(s5_168 + 596, dwArg0138, out s1_477, out a2_478, out a5_479, out a6_480, out s2_481, out s3_482, out s4_483, out s5_484, out s6_485, out s7_486, out s8_487);
			word32 s3_272;
			word32 a4_488;
			word32 s3_489;
			word32 s10_490;
			keyMgmtKeyGroupTxDone.isra.1(keyMgmtKeyPairwiseTxDone.isra.2(ra_160, dwLoc40, dwLoc3C, dwArg0C, s1, dwArgA8, dwArgB8, dwArg0108, dwArg0118, dwArg0144, out a4_488, out s3_489, out s10_490), fflags, frm, mstatus, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg28, dwArg2C, dwArg3C, s9, s7, s1, dwArg78, dwArg7C, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0128, dwArg0164, out a4_186, out s3_272, out s10);
			word32 s1_491;
			word32 a2_492;
			word32 a5_493;
			word32 a6_494;
			word32 s2_495;
			word32 s4_496;
			word32 s5_497;
			word32 s6_498;
			word32 s7_499;
			word32 s8_500;
			dbg_test_print(s3_272 + 616, dwArg0138, out s1_491, out a2_492, out a5_493, out a6_494, out s2_495, out s3_196, out s4_496, out s5_497, out s6_498, out s7_499, out s8_500);
		}
		else
			keyMgmtKeyPairwiseTxDone.isra.2(ra_160, dwLoc40, dwLoc3C, dwArg0C, s1, dwArgA8, dwArgB8, dwArg0108, dwArg0118, dwArg0144, out a4_186, out s3_196, out s10);
		word32 s1_501;
		word32 a2_502;
		word32 a5_503;
		word32 a6_504;
		word32 s2_505;
		word32 s3_506;
		word32 s4_507;
		word32 s5_508;
		word32 s6_509;
		word32 s7_510;
		word32 s8_511;
		dbg_test_print(s3_196 + 616, dwArg0138, out s1_501, out a2_502, out a5_503, out a6_504, out s2_505, out s3_506, out s4_507, out s5_508, out s6_509, out s7_510, out s8_511);
		a0_328 = 0x00;
	}
	else
		a0_328 = 0x01;
	0x00 = (int8) dwArg0198;
	a4Out = a4_186;
	s10Out = s10;
	return a0_328;
}

// 230160D6: Register Eq_2 KeyMgmtStaHsk_Recvd_PWKMsg3(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0144, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s10Out)
// Called from:
//      ProcessKeyMgmtDataSta
Eq_2 KeyMgmtStaHsk_Recvd_PWKMsg3(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0144, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s10Out)
{
	word32 s1_237;
	word32 a2_238;
	word32 a5_239;
	word32 a6_240;
	word32 s2_241;
	word32 s3_242;
	word32 s4_243;
	word32 s5_244;
	word32 s6_245;
	word32 s7_246;
	word32 s8_247;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_237, out a2_238, out a5_239, out a6_240, out s2_241, out s3_242, out s4_243, out s5_244, out s6_245, out s7_246, out s8_247);
	word32 a0_46;
	Eq_2 a3_49;
	Eq_2 s1_56;
	Eq_2 s2_59;
	Eq_2 s7_64;
	Eq_2 s9_66;
	Eq_2 a4_118;
	ptr32 s10_106;
	Eq_2 ra_54 = ProcessRxEAPOL_PwkMsg3(ra, s2, dwLoc08, dwArg0C, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_56, out a0_46, out a3_49, out a4_118, out s2_59, out s7_64, out s9_66, out s10_106);
	if (a0_46 != 0x00 && GeneratePWKMsg4(ra_54, s1_56, a3_49, a4_118, s2_59, s7_64, s9_66, fflags, frm, mstatus, dwLoc20, s4, s0, dwLoc0C, dwLoc04, dwArg08, dwArg0C, dwArg18, dwArg1C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0124, dwArg0144, dwArg0178, out a4_118, out s10_106) == 0x00)
	{
		word32 s3_248;
		word32 s5_249;
		updateApReplayCounter(s3, dwArg0138, out a4_118, out s3_248, out s5_249);
		word32 s1_250;
		word32 a2_251;
		word32 a5_252;
		word32 a6_253;
		word32 s2_254;
		word32 s3_255;
		word32 s4_256;
		word32 s5_257;
		word32 s6_258;
		word32 s7_259;
		word32 s8_260;
		dbg_test_print(&g_b230AD268, dwArg0158, out s1_250, out a2_251, out a5_252, out a6_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s7_259, out s8_260);
	}
	s10Out = s10_106;
	return a4_118;
}

// 2301616C: Register word32 ProcessKeyMgmtDataSta(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      ProcessEAPoLPkt
word32 ProcessKeyMgmtDataSta(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0124, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s5Out, ptr32 & s10Out)
{
	word32 a4_117;
	ptr32 s10_124;
	Eq_2 s1_35;
	Eq_2 s4_36;
	Eq_2 s2_40;
	Eq_2 s3_41;
	word32 a2_229;
	word32 a5_230;
	word32 a6_231;
	word32 s5_232;
	word32 s6_233;
	word32 s7_234;
	word32 s8_235;
	Eq_2 s0_34 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_35, out a2_229, out a5_230, out a6_231, out s2_40, out s3_41, out s4_36, out s5_232, out s6_233, out s7_234, out s8_235);
	if (((word32) *((word32) s2_40 + 6) & 0x08) != 0x00)
	{
		if (((word32) *((word32) s2_40 + 5) & 0x01) != 0x00)
			a4_117 = KeyMgmtStaHsk_Recvd_PWKMsg3(ra, s0_34, s2_40, s3_41, s4_36, fflags, frm, mstatus, s2, s0, dwLoc08, dwLoc04, dwArg38, dwArg3C, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0104, dwArg0108, dwArg0118, dwArg0124, dwArg0138, dwArg0158, out s10_124);
		else
			a4_117 = KeyMgmtStaHsk_Recvd_PWKMsg1(ra, s0_34, s1_35, s2_40, s4_36, fflags, frm, mstatus, s0, dwLoc08, dwArg18, dwArg24, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0178, out s10_124);
	}
	else
		a4_117 = KeyMgmtStaHsk_Recvd_GrpMsg1(ra, s2_40, s3_41, s4_36, fflags, frm, mstatus, s2, s0, dwLoc08, dwLoc04, dwArg08, dwArg0C, dwArg38, dwArg3C, dwArg58, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0124, dwArg0138, dwArg0158, out s10_124);
	ptr32 s5_169;
	word32 s1_236;
	word32 a2_237;
	word32 a5_238;
	word32 a6_239;
	word32 s2_240;
	word32 s3_241;
	word32 s4_242;
	word32 s6_243;
	word32 s7_244;
	word32 s8_245;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_236, out a2_237, out a5_238, out a6_239, out s2_240, out s3_241, out s4_242, out s5_169, out s6_243, out s7_244, out s8_245);
	s5Out = s5_169;
	s10Out = s10_124;
	return a4_117;
}

