pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23016200: Register word32 ProcessEAPoLPkt(Register Eq_2 ra, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0154, Register out (ptr32 Eq_44695) a1Out, Register out (ptr32 Eq_44696) a4Out, Register out (ptr32 Eq_44697) s5Out, Register out (ptr32 Eq_44698) s6Out, Register out (ptr32 Eq_44699) s7Out, Register out ptr32 s10Out)
// Called from:
//      rxu_cntrl_frame_handle
word32 ProcessEAPoLPkt(Eq_2 ra, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0154, struct Eq_44695 & a1Out, struct Eq_44696 & a4Out, struct Eq_42953 & s5Out, struct Eq_44698 & s6Out, struct Eq_44699 & s7Out, ptr32 & s10Out)
{
	struct Eq_63374 * a5_38;
	word32 s2_46;
	word32 s1_304;
	word32 a2_305;
	word32 a6_306;
	word32 s3_307;
	word32 s4_308;
	word32 s6_309;
	word32 s7_310;
	word32 s8_311;
	word32 s5_164;
	dbg_test_print(&g_b230AD254, dwArg0148, out s1_304, out a2_305, out a5_38, out a6_306, out s2_46, out s3_307, out s4_308, out s5_164, out s6_309, out s7_310, out s8_311);
	struct Eq_44696 * a4_117 = (word32) a5_38->b0001;
	if (a4_117 == (struct Eq_44696 *) 0x03)
	{
		word32 s5_129;
		union Eq_2 * a5_61;
		Eq_2 s2_69;
		word32 s1_312;
		word32 a2_313;
		word32 a6_314;
		word32 s3_315;
		word32 s4_316;
		word32 s5_317;
		word32 s6_318;
		word32 s7_319;
		word32 s8_320;
		Eq_2 s0_63 = dbg_test_print(s2_46 + 596, dwArg0148, out s1_312, out a2_313, out a5_61, out a6_314, out s2_69, out s3_315, out s4_316, out s5_317, out s6_318, out s7_319, out s8_320);
		Eq_2 s1_74 = *a5_61;
		if ((word32) *a5_61 == 0x02)
			a4_117 = ProcessKeyMgmtDataAp(ra, s0_63, s1_74, fflags, frm, mstatus, dwLoc30, dwLoc2C, s6, dwLoc18, dwLoc0C, dwLoc08, dwArg1C, dwArg68, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0128, dwArg0154, out s5_129, out s10);
		else
			a4_117 = ProcessKeyMgmtDataSta(ra, s0_63, s1_74, s2_69, fflags, frm, mstatus, s6, s4, dwLoc18, dwLoc0C, dwArg08, dwArg0C, dwArg28, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF4, dwArg0108, dwArg0128, dwArg0148, out s5_129, out s10);
		word32 s1_328;
		word32 a2_329;
		word32 a5_330;
		word32 a6_331;
		word32 s2_332;
		word32 s3_333;
		word32 s4_334;
		word32 s6_335;
		word32 s7_336;
		word32 s8_337;
		dbg_test_print(s5_129 + 616, dwArg0148, out s1_328, out a2_329, out a5_330, out a6_331, out s2_332, out s3_333, out s4_334, out s5_164, out s6_335, out s7_336, out s8_337);
	}
	struct Eq_44695 * a1_173 = *(union Eq_2 *) 0x44B00120 >> 1000;
	word32 s1_181;
	struct Eq_42953 * s5_188;
	struct Eq_44698 * s6_189;
	struct Eq_44699 * s7_190;
	word32 a2_321;
	word32 a5_322;
	word32 a6_323;
	word32 s2_324;
	word32 s3_325;
	word32 s4_326;
	word32 s8_327;
	dbg_test_print(s5_164 + 616, dwArg0148, out s1_181, out a2_321, out a5_322, out a6_323, out s2_324, out s3_325, out s4_326, out s5_188, out s6_189, out s7_190, out s8_327);
	0x00 = (int8) dwArg0128;
	a1Out = a1_173;
	a4Out = a4_117;
	s5Out = s5_188;
	s6Out = s6_189;
	s7Out = s7_190;
	s10Out = s10;
	return s1_181;
}

// 230162DA: Register word32 process_rsn_ie(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_46618) a2, Register (ptr32 byte) a3, Register (ptr32 Eq_47224) a4, Register word32 a5, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out Eq_47228 s1Out, Register out Eq_47229 a0Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      rxu_mgt_ind_handler
//      bl_rx_scanu_result_ind
word32 process_rsn_ie(Eq_2 a0, byte * a1, struct Eq_46618 * a2, byte * a3, struct Eq_47224 * a4, word32 a5, Eq_2 dwArg010C, ptr32 & s0Out, union Eq_47228 & s1Out, union Eq_47229 & a0Out, ptr32 & s3Out, ptr32 & s4Out)
{
	if (((word32) *((word32) a0 + 9) << 8 | (word32) (*((word32) a0 + 8))) == 0x02)
	{
		word32 a5_49 = (word32) *((word32) a0 + 1);
		*((word32) a0 + 9) = 0x00;
		*((word32) a0 + 1) = (byte) (a5_49 + ~0x03);
		*((word32) a0 + 8) = 0x01;
		word32 a1_746;
		word32 a2_747;
		word32 a3_748;
		word32 a4_749;
		word32 a5_750;
		if (memcmp((word32) a0 + 0x0E, 588036260, 0x04, out a1_746, out a2_747, out a3_748, out a4_749, out a5_750) == 0x00)
		{
			word32 a7_764;
			word32 a4_761;
			word32 a6_763;
			word32 a1_758;
			word32 a3_760;
			word32 a5_762;
			word32 a2_759;
			memcpy((word32) a0 + 0x0A, (word32) a0 + 0x0E, 0x04, out a1_758, out a2_759, out a3_760, out a4_761, out a5_762, out a6_763, out a7_764);
		}
		word32 a1_751;
		word32 a3_753;
		word32 a7_757;
		word32 a5_755;
		word32 a6_756;
		word32 a4_754;
		word32 a2_752;
		memcpy((word32) a0 + 0x0E, (word32) a0 + 18, 0x0C, out a1_751, out a2_752, out a3_753, out a4_754, out a5_755, out a6_756, out a7_757);
	}
	word32 a6_744;
	word32 a7_745;
	word32 a5_743;
	word32 a1_739;
	word32 a3_741;
	word32 a4_742;
	word32 a2_740;
	memcpy(fp + -66, (word32) a0 + 0x0E, 0x02, out a1_739, out a2_740, out a3_741, out a4_742, out a5_743, out a6_744, out a7_745);
	uint32 a5_118 = 0x00;
	while (true)
	{
		uint32 a4_123 = (word32) wLoc42;
		if (a5_118 >= a4_123)
			break;
		ui32 s3_125 = a5_118 + 1;
		Eq_2 s11_129 = (s3_125 << 0x02) + 0x02 + ((word32) a0 + 0x0A);
		word32 a1_765;
		word32 a2_766;
		word32 a4_768;
		word32 a5_769;
		word32 a3_767;
		if (memcmp(s11_129, 588036256, 0x04, out a1_765, out a2_766, out a3_767, out a4_768, out a5_769) == 0x00)
			a4->b0000 = (byte) ((word32) a4->b0000 | 32);
		else
		{
			word32 a3_793;
			word32 a1_791;
			word32 a2_792;
			word32 a4_794;
			word32 a5_795;
			if (memcmp(s11_129, 0x230CB8B0, 0x04, out a1_791, out a2_792, out a3_793, out a4_794, out a5_795) == 0x00)
				a4->b0001 = (byte) ((word32) a4->b0001 | 1);
		}
		a5_118 = s3_125 & 0x00FF;
	}
	if (a4_123 == 0x02)
	{
		Eq_2 a1_192;
		*((word32) a0 + 1) = 0x14;
		word32 a5_774;
		word32 a6_775;
		word32 a7_776;
		word32 a2_771;
		word32 a3_772;
		word32 a1_770;
		word32 a4_773;
		memcpy((word32) a0 + 0x0E, fp + -66, 0x02, out a1_770, out a2_771, out a3_772, out a4_773, out a5_774, out a6_775, out a7_776);
		if (a5 != 0x00)
			a1_192.u0 = 588036256;
		else
			a1_192.u0 = 0x230CB8B0;
		word32 a4_799;
		word32 a1_796;
		word32 a3_798;
		word32 a5_800;
		word32 a2_797;
		if (memcmp((word32) a0 + 20, a1_192, 0x04, out a1_796, out a2_797, out a3_798, out a4_799, out a5_800) == 0x00)
		{
			word32 a4_787;
			word32 a6_789;
			word32 a2_785;
			word32 a7_790;
			word32 a3_786;
			word32 a5_788;
			word32 a1_784;
			memcpy((word32) a0 + 16, (word32) a0 + 20, 0x06, out a1_784, out a2_785, out a3_786, out a4_787, out a5_788, out a6_789, out a7_790);
		}
		word32 a7_783;
		word32 a1_777;
		word32 a3_779;
		word32 a2_778;
		word32 a4_780;
		word32 a5_781;
		word32 a6_782;
		memcpy((word32) a0 + 20, (word32) a0 + 24, 0x02, out a1_777, out a2_778, out a3_779, out a4_780, out a5_781, out a6_782, out a7_783);
	}
	if (((word32) a4->b0001 & 0x01) != 0x00 && (((word32) a4->b0000 & 32) == 0x00 || a5 == 0x00))
	{
		*a3 = 0x01;
		*((word32) a0 + 20) = 0xC0;
		word32 a5_267 = (word32) *((word32) a0 + 1);
		*((word32) a0 + 22) = 0x00;
		*((word32) a0 + 1) = (byte) (a5_267 + 0x02);
		((word32) a0 + 23)->u0 = 0x00;
		word32 a6_811;
		word32 a7_812;
		word32 a1_806;
		word32 a4_809;
		word32 a5_810;
		word32 a3_808;
		word32 a2_807;
		memcpy((word32) a0 + 24, 588036268, 0x04, out a1_806, out a2_807, out a3_808, out a4_809, out a5_810, out a6_811, out a7_812);
		*((word32) a0 + 1) = (byte) ((word32) *((word32) a0 + 1) + 0x04);
	}
	ui32 a5_328;
	word32 a2_802;
	word32 a3_803;
	word32 a4_804;
	word32 a1_801;
	word32 a5_805;
	if (memcmp((word32) a0 + 0x0A, 588036260, 0x04, out a1_801, out a2_802, out a3_803, out a4_804, out a5_805) == 0x00)
		a5_328 = (word32) a2->b0000 | 8;
	else
	{
		word32 a3_815;
		word32 a5_817;
		word32 a1_813;
		word32 a2_814;
		word32 a4_816;
		if (memcmp((word32) a0 + 0x0A, 588036256, 0x04, out a1_813, out a2_814, out a3_815, out a4_816, out a5_817) != 0x00)
			goto l23016436;
		a5_328 = (word32) a2->b0000 | 4;
	}
	a2->b0000 = (byte) a5_328;
l23016436:
	ui32 a5_392;
	word32 a3_825;
	word32 a1_823;
	word32 a2_824;
	word32 a4_826;
	word32 a5_827;
	if (memcmp((word32) a0 + 4, 588036260, 0x04, out a1_823, out a2_824, out a3_825, out a4_826, out a5_827) == 0x00)
		a5_392 = (word32) *a1 | 8;
	else
	{
		word32 a1_818;
		word32 a4_821;
		word32 a3_820;
		word32 a2_819;
		word32 a5_822;
		if (memcmp((word32) a0 + 4, 588036256, 0x04, out a1_818, out a2_819, out a3_820, out a4_821, out a5_822) == 0x00)
			a5_392 = (word32) *a1 | 4;
		else
		{
			word32 a4_831;
			word32 a2_829;
			word32 a5_832;
			word32 a1_828;
			word32 a3_830;
			if (memcmp((word32) a0 + 4, 588036264, 0x04, out a1_828, out a2_829, out a3_830, out a4_831, out a5_832) == 0x00)
				a5_392 = (word32) *a1 | 2;
			else
			{
				word32 a2_834;
				word32 a1_833;
				word32 a4_836;
				word32 a3_835;
				word32 a5_837;
				if (memcmp((word32) a0 + 4, 588036252, 0x04, out a1_833, out a2_834, out a3_835, out a4_836, out a5_837) != 0x00)
				{
l23016454:
					word32 a0_405 = (word32) *((word32) a0 + 1);
					0x00 = (int8) dwArg010C;
					s0Out = dwArgCC;
					s1Out = dwLoc4C;
					a0Out = a0_405 + 0x02 & 0x00FF;
					s3Out = 0x230CC000;
					s4Out = dwArg0168;
					return dwLoc08;
				}
				a5_392 = (word32) *a1 | 1;
			}
		}
	}
	*a1 = (byte) a5_392;
	goto l23016454;
}

