pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301653E: Register word32 process_wpa_ie(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_46618) a2, Register out (ptr32 byte) s1Out, Register out Eq_47455 a2Out, Register out Eq_47456 a4Out, Register out (ptr32 Eq_47457) s2Out, Register out (ptr32 (ptr32 code)) s3Out, Register out ptr32 s4Out)
// Called from:
//      rxu_mgt_ind_handler
//      bl_rx_scanu_result_ind
word32 process_wpa_ie(Eq_2 a0, byte * a1, struct Eq_46618 * a2, byte & s1Out, union Eq_47455 & a2Out, union Eq_47456 & a4Out, struct Eq_47457 & s2Out, <anonymous> & s3Out, ptr32 & s4Out)
{
	if (((word32) *((word32) a0 + 0x0D) << 8 | (word32) (*((word32) a0 + 0x0C))) == 0x02)
	{
		*((word32) a0 + 1) = 22;
		*((word32) a0 + 0x0C) = 0x01;
		*((word32) a0 + 0x0D) = 0x00;
		word32 a2_314;
		word32 a4_316;
		word32 a5_317;
		word32 a3_315;
		word32 a1_313;
		if (memcmp((word32) a0 + 18, 588036288, 0x04, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317) == 0x00)
		{
			word32 a1_325;
			word32 a6_330;
			word32 a4_328;
			word32 a2_326;
			word32 a3_327;
			word32 a5_329;
			word32 a7_331;
			memcpy((word32) a0 + 0x0E, (word32) a0 + 18, 0x04, out a1_325, out a2_326, out a3_327, out a4_328, out a5_329, out a6_330, out a7_331);
		}
		word32 a5_322;
		word32 a4_321;
		word32 a2_319;
		word32 a3_320;
		word32 a6_323;
		word32 a7_324;
		word32 a1_318;
		memcpy((word32) a0 + 18, (word32) a0 + 22, 0x08, out a1_318, out a2_319, out a3_320, out a4_321, out a5_322, out a6_323, out a7_324);
	}
	ui32 a5_108;
	word32 a3_310;
	word32 a5_312;
	word32 a4_311;
	word32 a1_308;
	word32 a2_309;
	if (memcmp((word32) a0 + 0x0E, 588036288, 0x04, out a1_308, out a2_309, out a3_310, out a4_311, out a5_312) == 0x00)
		a5_108 = (word32) a2->b0000 | 8;
	else
	{
		word32 a3_334;
		word32 a1_332;
		word32 a2_333;
		word32 a4_335;
		word32 a5_336;
		if (memcmp((word32) a0 + 0x0E, 0x230CB8BC, 0x04, out a1_332, out a2_333, out a3_334, out a4_335, out a5_336) != 0x00)
			goto l230165C0;
		a5_108 = (word32) a2->b0000 | 4;
	}
	a2->b0000 = (byte) a5_108;
l230165C0:
	ui32 a5_165;
	word32 a1_341;
	word32 a2_342;
	word32 a3_343;
	word32 a5_344;
	Eq_47456 a4_126;
	if (memcmp((word32) a0 + 8, 588036288, 0x04, out a1_341, out a2_342, out a3_343, out a4_126, out a5_344) == 0x00)
		a5_165 = (word32) *a1 | 8;
	else
	{
		word32 a1_337;
		word32 a2_338;
		word32 a3_339;
		word32 a5_340;
		if (memcmp((word32) a0 + 8, 0x230CB8BC, 0x04, out a1_337, out a2_338, out a3_339, out a4_126, out a5_340) == 0x00)
			a5_165 = (word32) *a1 | 4;
		else
		{
			word32 a1_345;
			word32 a2_346;
			word32 a3_347;
			word32 a5_348;
			if (memcmp((word32) a0 + 8, 0x230CB8C4, 0x04, out a1_345, out a2_346, out a3_347, out a4_126, out a5_348) == 0x00)
				a5_165 = (word32) *a1 | 2;
			else
			{
				word32 a1_349;
				word32 a2_350;
				word32 a3_351;
				word32 a5_352;
				if (memcmp((word32) a0 + 8, 588036280, 0x04, out a1_349, out a2_350, out a3_351, out a4_126, out a5_352) != 0x00)
				{
l230165DE:
					s1Out = a1;
					a2Out = dwArg48;
					a4Out = a4_126;
					s2Out = (word32) a0 + 8;
					s3Out = &g_ptr230CC000;
					s4Out = dwArg04;
					return s1;
				}
				a5_165 = (word32) *a1 | 1;
			}
		}
	}
	*a1 = (byte) a5_165;
	goto l230165DE;
}

// 2301666A: void keyMgmtStaRsnSecuredTimeoutHandler(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void keyMgmtStaRsnSecuredTimeoutHandler(Eq_2 ra, Eq_2 a3, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	struct Eq_64311 * a5_21;
	word32 s1_24;
	Eq_2 s2_29;
	Eq_2 s5_31;
	word32 a2_145;
	word32 a6_146;
	word32 s3_147;
	word32 s4_148;
	word32 s6_149;
	word32 s7_150;
	word32 s8_151;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_24, out a2_145, out a5_21, out a6_146, out s2_29, out s3_147, out s4_148, out s5_31, out s6_149, out s7_150, out s8_151);
	if (s1_24 != 0x00)
	{
		Eq_2 s1_34 = a5_21->t0078;
		if (a5_21 == null)
		{
			word32 a4_152;
			word32 s10_153;
			sm_handle_supplicant_result(ra, s1_34, (word32) *((word32) *((word32) s1_34 + 0x0118) + 1), 0x0F, a3, s2_29, s5_31, fflags, frm, mstatus, dwLoc08, dwArg08, dwArg30, dwArg34, dwArg40, dwArg44, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgB8, dwArgBC, dwArgD8, dwArgF8, dwArg0118, out a4_152, out s10_153);
		}
	}
	word32 s1_154;
	word32 a2_155;
	word32 a5_156;
	word32 a6_157;
	word32 s2_158;
	word32 s3_159;
	word32 s4_160;
	word32 s5_161;
	word32 s6_162;
	word32 s7_163;
	word32 s8_164;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_154, out a2_155, out a5_156, out a6_157, out s2_158, out s3_159, out s4_160, out s5_161, out s6_162, out s7_163, out s8_164);
}

// 230166D4: Register Eq_2 supplicantGenerateRand(Register Eq_2 ra, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      GetKeyMsgNonceFromEAPOL
//      GeneratePWKMsg1
//      GenerateGTK_internal
Eq_2 supplicantGenerateRand(Eq_2 ra, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg5C, Eq_2 dwArg0108, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s9Out, ptr32 & s10Out)
{
	struct Eq_64398 * a2_28;
	Eq_2 s4_33;
	word32 s3_38;
	Eq_2 s5_39;
	word32 s1_121;
	word32 a5_122;
	word32 a6_123;
	word32 s2_124;
	word32 s6_125;
	word32 s7_126;
	word32 s8_127;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_121, out a2_28, out a5_122, out a6_123, out s2_124, out s3_38, out s4_33, out s5_39, out s6_125, out s7_126, out s8_127);
	ptr32 a3_47;
	ptr32 a4_48;
	ptr32 s10_55;
	ptr32 s9_64;
	word32 s0_128;
	word32 s2_129;
	Eq_2 ra_52 = bl_rand_stream(ra, s3_38, s4_33, a2_28, s5_39, dwArg10, dwArg14, dwArg5C, dwArg0108, out s0_128, out a3_47, out a4_48, out s2_129, out s9_64, out s10_55);
	ptr32 s1_88;
	word32 a2_130;
	word32 a5_131;
	word32 a6_132;
	word32 s2_133;
	word32 s3_134;
	word32 s4_135;
	word32 s5_136;
	word32 s6_137;
	word32 s7_138;
	word32 s8_139;
	s0Out = dbg_test_print(&g_b230AD268, dwArg0178, out s1_88, out a2_130, out a5_131, out a6_132, out s2_133, out s3_134, out s4_135, out s5_136, out s6_137, out s7_138, out s8_139);
	s1Out = s1_88;
	a0Out = 587911784;
	a3Out = a3_47;
	a4Out = a4_48;
	s9Out = s9_64;
	s10Out = s10_55;
	return ra_52;
}

// 23016738: Register Eq_2 ComputeEAPOL_MIC(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ui32 a4, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      IsEAPOL_MICValid
//      KeyMgmtSta_PopulateEAPOLLengthMic
Eq_2 ComputeEAPOL_MIC(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ui32 a4, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	if (a4 == 0x00)
		a4 = (word32) *((word32) a0 + 6) & 0x07;
	if (a4 != 0x01)
	{
		if (a4 != 0x02)
			ra = bl_aes_cmac(ra, a2, out s1, out s2, out s3, out s4, out s5, out s7, out s9, out s10);
		else
			Bl_hmac_sha1(ra, 0x01, a2, a3, (word32) a0 + 81, 0x10);
	}
	else
		Bl_hmac_md5(ra, a0, a1, a2, a3);
	s1Out = s1;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 23016788: Register word32 keyMgmtGetKeySize_internal(Stack word32 dwArg38, Stack Eq_2 dwArg0168, Register out Eq_2 a0Out, Register out ptr32 s2Out)
// Called from:
//      keyMgmtGetKeySize
word32 keyMgmtGetKeySize_internal(word32 dwArg38, Eq_2 dwArg0168, union Eq_2 & a0Out, ptr32 & s2Out)
{
	struct Eq_64557 * s1_28;
	word32 s2_33;
	word32 a2_97;
	word32 a5_98;
	word32 a6_99;
	word32 s3_100;
	word32 s4_101;
	word32 s5_102;
	word32 s6_103;
	word32 s7_104;
	word32 s8_105;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_28, out a2_97, out a5_98, out a6_99, out s2_33, out s3_100, out s4_101, out s5_102, out s6_103, out s7_104, out s8_105);
	if (s2_33 != 0x00)
		((word32) s1_28->b0004 & 0x08) == 0x00;
	else
	{
		ui32 a5_39 = (word32) s1_28->b0003;
	}
	word32 s1_65;
	ptr32 s2_70;
	word32 a2_106;
	word32 a5_107;
	word32 a6_108;
	word32 s3_109;
	word32 s4_110;
	word32 s5_111;
	word32 s6_112;
	word32 s7_113;
	word32 s8_114;
	Eq_2 a0_75 = dbg_test_print(&g_b230AD268, dwArg0168, out s1_65, out a2_106, out a5_107, out a6_108, out s2_70, out s3_109, out s4_110, out s5_111, out s6_112, out s7_113, out s8_114);
	0x00 = dwArg38;
	a0Out = a0_75;
	s2Out = s2_70;
	return s1_65;
}

// 2301681C: Register Eq_2 isApReplayCounterFresh(Stack Eq_2 dwArg0158, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_64640 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s7Out)
// Called from:
//      KeyMgmtSta_IsRxEAPOLValid
Eq_2 isApReplayCounterFresh(Eq_2 dwArg0158, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_64640 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s7Out)
{
	Eq_2 s2_33;
	word32 s1_162;
	word32 a2_163;
	word32 a5_164;
	word32 a6_165;
	word32 s3_166;
	word32 s4_167;
	word32 s5_168;
	word32 s6_169;
	word32 s7_170;
	word32 s8_171;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_162, out a2_163, out a5_164, out a6_165, out s2_33, out s3_166, out s4_167, out s5_168, out s6_169, out s7_170, out s8_171);
	word32 a1_172;
	word32 a2_173;
	word32 a3_174;
	word32 a4_175;
	word32 a5_176;
	word32 a6_177;
	word32 a7_178;
	memcpy(fp + ~0x17, s2_33, 0x04, out a1_172, out a2_173, out a3_174, out a4_175, out a5_176, out a6_177, out a7_178);
	uint32 a4_57;
	word32 a1_179;
	word32 a2_180;
	word32 a3_181;
	word32 a5_182;
	word32 a6_183;
	word32 a7_184;
	memcpy(fp + ~0x13, (word32) s2_33 + 4, 0x04, out a1_179, out a2_180, out a3_181, out a4_57, out a5_182, out a6_183, out a7_184);
	Eq_64640 a1_81 = a4_57 >> 0x08 & 0x0FFFFF00;
	ptr32 a4_149 = 0x10000000;
	Eq_64640 a3_148 = (word32) a1_81.u0 + (((a4_57 << 0x18) + (a4_57 >> 0x18)) + (a4_57 << 0x08 & 0x00FF0000));
	if (a1_81 >= a3_148 && a1_81 == a3_148)
	{
		a3_148.u0 = 0x00;
		a4_149 = 0x00100000;
	}
	ptr32 s1_117;
	ptr32 s2_122;
	ptr32 s7_126;
	word32 a2_185;
	word32 a5_186;
	word32 a6_187;
	word32 s3_188;
	word32 s4_189;
	word32 s5_190;
	word32 s6_191;
	word32 s8_192;
	Eq_2 s0_116 = dbg_test_print(&g_b230AD268, dwArg0158, out s1_117, out a2_185, out a5_186, out a6_187, out s2_122, out s3_188, out s4_189, out s5_190, out s6_191, out s7_126, out s8_192);
	s1Out = s1_117;
	a0Out = s0_116;
	a3Out = a3_148;
	a4Out = a4_149;
	s2Out = s2_122;
	s7Out = s7_126;
	return s0_116;
}

