pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 230168FE: Register Eq_2 updateApReplayCounter(Stack Eq_2 dwArg84, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_61560) a4Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      KeyMgmtStaHsk_Recvd_GrpMsg1
//      KeyMgmtStaHsk_Recvd_PWKMsg3
Eq_2 updateApReplayCounter(Eq_2 dwArg84, Eq_2 dwArg0158, struct Eq_61560 & a4Out, ptr32 & s3Out, ptr32 & s5Out)
{
	word32 s1_28;
	Eq_2 s2_33;
	word32 a2_152;
	word32 a5_153;
	word32 a6_154;
	word32 s3_155;
	word32 s4_156;
	word32 s5_157;
	word32 s6_158;
	word32 s7_159;
	word32 s8_160;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_28, out a2_152, out a5_153, out a6_154, out s2_33, out s3_155, out s4_156, out s5_157, out s6_158, out s7_159, out s8_160);
	word32 a1_161;
	word32 a2_162;
	word32 a3_163;
	word32 a4_164;
	word32 a5_165;
	word32 a6_166;
	word32 a7_167;
	memcpy(fp + ~0x17, s2_33, 0x04, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165, out a6_166, out a7_167);
	uint32 a3_62;
	word32 a1_168;
	word32 a2_169;
	word32 a4_170;
	word32 a5_171;
	word32 a6_172;
	word32 a7_173;
	memcpy(fp + ~0x13, (word32) s2_33 + 4, 0x04, out a1_168, out a2_169, out a3_62, out a4_170, out a5_171, out a6_172, out a7_173);
	struct Eq_64832 * a5_82 = (a3_62 << 0x18) + (a3_62 >> 0x18) + (a3_62 << 0x08 & 0x00FF0000) + (a3_62 >> 0x08 & dwArg84);
	a5_82->dw0064 = s1_28;
	struct Eq_61560 * a4_91 = (dwArg84 & 0x00100000) + 0x10;
	a4_91->dw0060 = s1_28;
	if ((a5_82 | a4_91) == 0x00)
		*(word32 *) 0x69 = s1_28;
	ptr32 s3_117;
	ptr32 s5_118;
	word32 s1_174;
	word32 a2_175;
	word32 a5_176;
	word32 a6_177;
	word32 s2_178;
	word32 s4_179;
	word32 s6_180;
	word32 s7_181;
	word32 s8_182;
	Eq_2 s0_110 = dbg_test_print(&g_b230AD268, dwArg0158, out s1_174, out a2_175, out a5_176, out a6_177, out s2_178, out s3_117, out s4_179, out s5_118, out s6_180, out s7_181, out s8_182);
	a4Out = a4_91;
	s3Out = s3_117;
	s5Out = s5_118;
	return s0_110;
}

// 230169BE: Register Eq_2 formEAPOLEthHdr(Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      KeyMgmtSta_PrepareEAPOLFrame
//      PrepDefaultEapolMsg
Eq_2 formEAPOLEthHdr(Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 s4_37;
	Eq_2 s5_43;
	word32 s1_128;
	word32 a2_129;
	word32 a5_130;
	word32 a6_131;
	word32 s2_132;
	word32 s3_133;
	word32 s6_134;
	word32 s7_135;
	word32 s8_136;
	Eq_2 s0_35 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_128, out a2_129, out a5_130, out a6_131, out s2_132, out s3_133, out s4_37, out s5_43, out s6_134, out s7_135, out s8_136);
	word32 a1_137;
	word32 a2_138;
	word32 a3_139;
	word32 a4_140;
	word32 a5_141;
	word32 a6_142;
	word32 a7_143;
	memcpy(s0_35, s5_43, 0x06, out a1_137, out a2_138, out a3_139, out a4_140, out a5_141, out a6_142, out a7_143);
	ptr32 a4_65;
	word32 a1_144;
	word32 a2_145;
	word32 a3_146;
	word32 a5_147;
	word32 a6_148;
	word32 a7_149;
	memcpy((word32) s0_35 + 6, s4_37, 0x06, out a1_144, out a2_145, out a3_146, out a4_65, out a5_147, out a6_148, out a7_149);
	*((word32) s0_35 + 0x0C) = 0x88;
	*((word32) s0_35 + 0x0D) = 0x8E;
	ptr32 s1_99;
	ptr32 s4_100;
	ptr32 s2_104;
	ptr32 s3_105;
	word32 a2_150;
	word32 a5_151;
	word32 a6_152;
	word32 s5_153;
	word32 s6_154;
	word32 s7_155;
	word32 s8_156;
	Eq_2 s0_98 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_99, out a2_150, out a5_151, out a6_152, out s2_104, out s3_105, out s4_100, out s5_153, out s6_154, out s7_155, out s8_156);
	s1Out = s1_99;
	a4Out = a4_65;
	s2Out = s2_104;
	s3Out = s3_105;
	s4Out = s4_100;
	return s0_98;
}

// 23016A46: Register Eq_2 IsEAPOL_MICValid(Register Eq_2 ra, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtSta_IsRxEAPOLValid
//      ProcessPWKMsg4
//      ProcessPWKMsg2
Eq_2 IsEAPOL_MICValid(Eq_2 ra, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a0_124;
	Eq_2 s1_35;
	Eq_2 s5_42;
	word32 a2_207;
	word32 a5_208;
	word32 a6_209;
	word32 s2_210;
	word32 s3_211;
	word32 s4_212;
	word32 s6_213;
	word32 s7_214;
	word32 s8_215;
	Eq_2 s0_34 = dbg_test_print(&g_b230AD254, dwArg0148, out s1_35, out a2_207, out a5_208, out a6_209, out s2_210, out s3_211, out s4_212, out s5_42, out s6_213, out s7_214, out s8_215);
	word32 a1_216;
	word32 a2_217;
	word32 a3_218;
	word32 a4_219;
	word32 a5_220;
	word32 a6_221;
	word32 a7_222;
	memcpy(fp + -48, s1_35, 0x10, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out a6_221, out a7_222);
	word32 t1_223;
	word32 a0_224;
	word32 a1_225;
	word32 a2_226;
	word32 a3_227;
	word32 a4_228;
	word32 a5_229;
	Eq_2 ra_70 = memset(ra, s1_35, 0x00, 0x10, out t1_223, out a0_224, out a1_225, out a2_226, out a3_227, out a4_228, out a5_229);
	uint32 a5_77 = (word32) *((word32) s0_34 + 3) << 8 | (word32) (*((word32) s0_34 + 2));
	ptr32 s10_106;
	ptr32 s9_113;
	word32 s3_230;
	word32 s4_231;
	Eq_2 s1_105;
	ptr32 s2_107;
	ptr32 s5_110;
	ptr32 s7_112;
	Eq_2 ra_103 = ComputeEAPOL_MIC(ra_70, s0_34, (word32) (word16) ((a5_77 >> 8 | a5_77 << 0x08) + 4), s5_42, 0x10, 0x00, out s1_105, out s2_107, out s3_230, out s4_231, out s5_110, out s7_112, out s9_113, out s10_106);
	ptr32 a3_120;
	ptr32 a4_121;
	word32 a1_232;
	word32 a2_233;
	word32 a5_234;
	if (memcmp(s1_105, fp + -48, 0x10, out a1_232, out a2_233, out a3_120, out a4_121, out a5_234) == 0x00)
	{
		word32 a2_235;
		word32 a5_236;
		word32 a6_237;
		word32 s3_238;
		word32 s4_239;
		word32 s6_240;
		word32 s8_241;
		dbg_test_print(&g_b230AD268, dwArg0148, out s1_105, out a2_235, out a5_236, out a6_237, out s2_107, out s3_238, out s4_239, out s5_110, out s6_240, out s7_112, out s8_241);
		a0_124 = 0x01;
	}
	else
		a0_124 = 0x00;
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_105;
	a0Out = a0_124;
	a3Out = a3_120;
	a4Out = a4_121;
	s2Out = s2_107;
	s5Out = s5_110;
	s7Out = s7_112;
	s9Out = s9_113;
	s10Out = s10_106;
	return ra_103;
}

// 23016AFA: Register Eq_2 KeyMgmtSta_PopulateEAPOLLengthMic(Register Eq_2 ra, Register ui32 a4, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
// Called from:
//      GeneratePWKMsg2
//      GenerateGrpMsg2
//      GeneratePWKMsg4
//      GeneratePWKMsg3
Eq_2 KeyMgmtSta_PopulateEAPOLLengthMic(Eq_2 ra, ui32 a4, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 s5_48;
	word32 s6_49;
	word32 s1_199;
	word32 a2_200;
	word32 a5_201;
	word32 a6_202;
	word32 s2_203;
	word32 s3_204;
	word32 s4_205;
	word32 s7_206;
	word32 s8_207;
	Eq_2 s0_40 = dbg_test_print(&g_b230AD254, dwArg0148, out s1_199, out a2_200, out a5_201, out a6_202, out s2_203, out s3_204, out s4_205, out s5_48, out s6_49, out s7_206, out s8_207);
	if (s0_40 != 0x00)
	{
		uint32 a1_55 = (word32) *((word32) s0_40 + 112) << 8 | (word32) (*((word32) s0_40 + 111));
		*((word32) s0_40 + 0x0F) = 0x03;
		uint32 s4_57 = a1_55 + 95 << 16;
		uint32 a5_65 = (word32) (word16) (s4_57 >> 0x10 << 0x08 | s4_57 >> 0x18);
		*((word32) s0_40 + 16) = (byte) a5_65;
		*((word32) s0_40 + 0x0011) = (byte) (a5_65 >> 8);
		uint32 a5_73 = (word32) (word16) (a1_55 << 0x08 | a1_55 >> 0x08);
		*((word32) s0_40 + 111) = (byte) a5_73;
		*((word32) s0_40 + 0x0E) = (byte) s6_49;
		*((word32) s0_40 + 112) = (byte) (a5_73 >> 8);
		word32 s1_208;
		word32 s2_209;
		word32 s3_210;
		word32 s4_211;
		word32 s5_212;
		word32 s7_213;
		word32 s9_214;
		word32 s10_215;
		ra = ComputeEAPOL_MIC(ra, (word32) s0_40 + 0x0E, (word32) (word16) (a1_55 + 99), s5_48, 0x10, a4, out s1_208, out s2_209, out s3_210, out s4_211, out s5_212, out s7_213, out s9_214, out s10_215);
		word32 s1_216;
		word32 a2_217;
		word32 a5_218;
		word32 a6_219;
		word32 s2_220;
		word32 s3_221;
		word32 s4_222;
		word32 s5_223;
		word32 s6_224;
		word32 s7_225;
		word32 s8_226;
		dbg_test_print(&g_b230AD268, dwArg0148, out s1_216, out a2_217, out a5_218, out a6_219, out s2_220, out s3_221, out s4_222, out s5_223, out s6_224, out s7_225, out s8_226);
	}
	0x00 = (int8) dwArg0128;
	return ra;
}

// 23016BD0: Register word32 parseKeyKDE(Stack Eq_2 dwArg0168, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_65302 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_65306 s6Out, Register out ptr32 s7Out)
// Called from:
//      parseKeyKDE_DataType
word32 parseKeyKDE(Eq_2 dwArg0168, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_65302 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_65306 & s6Out, ptr32 & s7Out)
{
	word32 a2_119;
	word32 a5_120;
	word32 a6_121;
	word32 s2_122;
	word32 s8_123;
	word32 s1_102;
	ptr32 s3_104;
	ptr32 s4_105;
	ptr32 s5_106;
	Eq_65306 s6_107;
	ptr32 s7_108;
	Eq_2 s0_23 = dbg_test_print(&g_b230AD254, dwArg0168, out s1_102, out a2_119, out a5_120, out a6_121, out s2_122, out s3_104, out s4_105, out s5_106, out s6_107, out s7_108, out s8_123);
	Eq_65302 a4_34 = (word32) *s0_23;
	if (a4_34 == 0x00DD)
	{
		a4_34 = (word32) *((word32) s0_23 + 1);
		if (a4_34 > 0x07)
		{
			word32 a1_129;
			word32 a2_130;
			word32 a5_131;
			if (memcmp((word32) s0_23 + 2, 588036248, 0x03, out a1_129, out a2_130, out a3, out a4_34, out a5_131) == 0x00)
			{
l23016C2C:
				a0Out = s0_23;
				a3Out = a3;
				a4Out = a4_34;
				s3Out = s3_104;
				s4Out = s4_105;
				s5Out = s5_106;
				s6Out = s6_107;
				s7Out = s7_108;
				return s1_102;
			}
		}
	}
	word32 a2_124;
	word32 a5_125;
	word32 a6_126;
	word32 s2_127;
	word32 s8_128;
	s0_23 = dbg_test_print(&g_b230AD268, dwArg0168, out s1_102, out a2_124, out a5_125, out a6_126, out s2_127, out s3_104, out s4_105, out s5_106, out s6_107, out s7_108, out s8_128);
	goto l23016C2C;
}

