pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23016C58: Register word32 parseKeyKDE_DataType(Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      parseKeyDataGTK
word32 parseKeyKDE_DataType(Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	word32 s8_230;
	word32 s4_226;
	word32 s5_227;
	word32 s6_228;
	word32 s7_229;
	word32 a2_222;
	word32 a5_223;
	word32 a6_224;
	word32 s2_225;
	word32 s1_221;
	int32 s3_46;
	Eq_2 s0_111 = dbg_test_print(&g_b230AD254, dwArg0148, out s1_221, out a2_222, out a5_223, out a6_224, out s2_225, out s3_46, out s4_226, out s5_227, out s6_228, out s7_229, out s8_230);
	if (s0_111 != 0x00)
	{
		Eq_2 s1_50 = s0_111;
		int32 s4_135 = 0x02;
		int32 s6_137 = 0x00DD;
		word32 s7_53 = ~0x01;
		for (; s4_135 < s3_46; s3_46 += a4)
		{
			if ((word32) *s1_50 == s6_137)
			{
				Eq_2 a0_62;
				word32 s5_73;
				s1_50 = parseKeyKDE(dwArg0138, out a0_62, out a3, out a4, out s3_46, out s4_135, out s5_73, out s6_137, out s7_53);
				s0_111 = a0_62;
				if (a0_62 != 0x00 && (word32) (*((word32) a0_62 + 5)) == s5_73)
					goto l23016CC8;
				if ((word32) *((word32) s1_50 + 1) == 0x00)
					s3_46 = 0x02;
			}
			word32 a5_87 = (word32) *((word32) s1_50 + 1);
			a4 = s7_53 - a5_87;
			s1_50 = (word32) s1_50 + (a5_87 + 0x02);
		}
		word32 s5_238;
		word32 s6_239;
		word32 s7_240;
		word32 s8_241;
		word32 a6_234;
		word32 s2_235;
		word32 s3_236;
		word32 s4_237;
		word32 s1_231;
		word32 a2_232;
		word32 a5_233;
		s0_111 = dbg_test_print(&g_b230AD268, dwArg0148, out s1_231, out a2_232, out a5_233, out a6_234, out s2_235, out s3_236, out s4_237, out s5_238, out s6_239, out s7_240, out s8_241);
	}
l23016CC8:
	0x00 = (int8) dwArg0128;
	a0Out = s0_111;
	a3Out = a3;
	a4Out = a4;
	return dwArgE4;
}

// 23016D12: Register word32 parseKeyDataGTK(Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a4Out)
// Called from:
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
word32 parseKeyDataGTK(Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a4Out)
{
	word32 s1_199;
	word32 a2_200;
	word32 a5_201;
	word32 a6_202;
	word32 s2_203;
	word32 s3_204;
	word32 s4_205;
	word32 s5_206;
	word32 s6_207;
	word32 s7_208;
	word32 s8_209;
	dbg_test_print(&g_b230AD254, dwArg0148, out s1_199, out a2_200, out a5_201, out a6_202, out s2_203, out s3_204, out s4_205, out s5_206, out s6_207, out s7_208, out s8_209);
	struct Eq_65529 * a0_45;
	ptr32 a4_121;
	word32 a3_126;
	Eq_2 s0_50 = parseKeyKDE_DataType(dwArgF8, dwArg0108, dwArg0118, out a0_45, out a3_126, out a4_121);
	if (a0_45 != null)
	{
		word32 a1_221;
		word32 a2_222;
		word32 a3_223;
		word32 a4_224;
		word32 a5_225;
		word32 a6_226;
		word32 a7_227;
		memcpy(s0_50, &a0_45->b0006 + 2, (word32) a0_45->b0001 + ~0x05, out a1_221, out a2_222, out a3_223, out a4_224, out a5_225, out a6_226, out a7_227);
		*((word32) s0_50 + 38) = (word16) ((word32) a0_45->b0006 & 0x03);
		word32 a1_228;
		word32 a2_229;
		word32 a3_230;
		word32 a4_231;
		word32 a5_232;
		word32 a6_233;
		word32 a7_234;
		memcpy(fp + -40, (word32) s0_50 + 24, 0x08, out a1_228, out a2_229, out a3_230, out a4_231, out a5_232, out a6_233, out a7_234);
		word32 a1_235;
		word32 a2_236;
		word32 a3_237;
		word32 a4_238;
		word32 a5_239;
		word32 a6_240;
		word32 a7_241;
		memcpy((word32) s0_50 + 24, (word32) s0_50 + 16, 0x08, out a1_235, out a2_236, out a3_237, out a4_238, out a5_239, out a6_240, out a7_241);
		word32 a1_242;
		word32 a2_243;
		word32 a5_244;
		word32 a6_245;
		word32 a7_246;
		memcpy((word32) s0_50 + 16, fp + -40, 0x08, out a1_242, out a2_243, out a3_126, out a4_121, out a5_244, out a6_245, out a7_246);
	}
	word32 s1_210;
	word32 a2_211;
	word32 a5_212;
	word32 a6_213;
	word32 s2_214;
	word32 s3_215;
	word32 s4_216;
	word32 s5_217;
	word32 s6_218;
	word32 s7_219;
	word32 s8_220;
	dbg_test_print(&g_b230AD268, dwArg0148, out s1_210, out a2_211, out a5_212, out a6_213, out s2_214, out s3_215, out s4_216, out s5_217, out s6_218, out s7_219, out s8_220);
	0x00 = (int8) dwArg0128;
	a4Out = a4_121;
	return a3_126;
}

// 23016DC4: Register Eq_2 KeyMgmtSta_ApplyKEK(Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out Eq_65666 a4Out, Register out ptr32 s3Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
Eq_2 KeyMgmtSta_ApplyKEK(Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a3Out, union Eq_65666 & a4Out, ptr32 & s3Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a3_116;
	Eq_65666 a4_117;
	struct Eq_65672 * s2_37;
	Eq_2 s3_38;
	word32 s1_195;
	word32 a2_196;
	word32 a5_197;
	word32 a6_198;
	word32 s4_199;
	word32 s5_200;
	word32 s6_201;
	word32 s7_202;
	word32 s8_203;
	Eq_2 s0_31 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_195, out a2_196, out a5_197, out a6_198, out s2_37, out s3_38, out s4_199, out s5_200, out s6_201, out s7_202, out s8_203);
	ui32 a5_42 = (word32) *((word32) s0_31 + 66);
	s2_37->w0024 = (word16) (a5_42 << 8);
	s2_37->w0024 = (word16) (a5_42 << 8 | (word32) (*((word32) s0_31 + 65)));
	s2_37->dw0020 = ~0x00;
	uint32 a5_55 = (word32) *((word32) s0_31 + 98) << 8 | (word32) (*((word32) s0_31 + 97));
	Eq_65735 a4_60 = (word32) (word16) (a5_55 << 0x08 | a5_55 >> 8);
	*((word32) s0_31 + 98) = (byte) (a4_60 >> 0x08);
	ui32 a5_63 = (word32) *((word32) s0_31 + 6);
	*((word32) s0_31 + 97) = (byte) a4_60;
	if ((a5_63 & 0x07) == 0x01)
		a3_116 = RC4_Encrypt(s3_38, (word32) s0_31 + 49, 0x10, (word32) s0_31 + 99, a4_60, 0x0100, out a4_117);
	else
	{
		a3_116 = BL_AesUnWrap(s3_38, 0x02, (a4_60 >> 0x03) + ~0x00, (word32) s0_31 + 99, (word32) s0_31 + 99, out s9, out s10);
		a4_117 = (word32) *((word32) s0_31 + 97);
		uint32 a5_96 = ((word32) *((word32) s0_31 + 98) << 8 | a4_117) + ~0x07 << 16;
		*((word32) s0_31 + 97) = (byte) (a5_96 >> 16);
		*((word32) s0_31 + 98) = (byte) (a5_96 >> 24);
	}
	ptr32 s1_147;
	ptr32 s3_153;
	word32 a2_204;
	word32 a5_205;
	word32 a6_206;
	word32 s2_207;
	word32 s4_208;
	word32 s5_209;
	word32 s6_210;
	word32 s7_211;
	word32 s8_212;
	Eq_2 s0_146 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_147, out a2_204, out a5_205, out a6_206, out s2_207, out s3_153, out s4_208, out s5_209, out s6_210, out s7_211, out s8_212);
	s1Out = s1_147;
	a3Out = a3_116;
	a4Out = a4_117;
	s3Out = s3_153;
	s9Out = s9;
	s10Out = s10;
	return s0_146;
}

// 23016EB4: Register Eq_2 KeyMgmtSta_IsRxEAPOLValid(Register Eq_2 ra, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      GetKeyMsgNonceFromEAPOL
Eq_2 KeyMgmtSta_IsRxEAPOLValid(Eq_2 ra, Eq_2 dwArg38, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a0_136;
	word32 a2_257;
	word32 a5_258;
	word32 a6_259;
	word32 s3_260;
	word32 s4_261;
	word32 s5_262;
	word32 s6_263;
	word32 s8_264;
	Eq_2 s1_126;
	ptr32 s2_131;
	ptr32 s7_101;
	Eq_2 s0_27 = dbg_test_print(&g_b230AD254, dwArg0168, out s1_126, out a2_257, out a5_258, out a6_259, out s2_131, out s3_260, out s4_261, out s5_262, out s6_263, out s7_101, out s8_264);
	if (s1_126 != 0x00 && s0_27 != 0x00)
	{
		word32 a0_40;
		struct Eq_65901 * s0_48 = isApReplayCounterFresh(dwArg0148, out s1_126, out a0_40, out a3, out a4, out s2_131, out s7_101);
		if (a0_40 == 0x00)
			goto l23016EE8;
		if (((word32) s0_48->b0005 & 0x01) != 0x00)
		{
			if (((word32) s0_48->b0006 & 0x08) != 0x00)
			{
				word32 a1_273;
				word32 a2_274;
				word32 a5_275;
				if (memcmp(&s0_48->b0006 + 11, s1_126, 32, out a1_273, out a2_274, out a3, out a4, out a5_275) != 0x00)
					goto l23016EE8;
			}
			word32 a0_84;
			word32 s0_276;
			word32 s5_277;
			ra = IsEAPOL_MICValid(ra, dwArg0118, dwArg0138, out s0_276, out s1_126, out a0_84, out a3, out a4, out s2_131, out s5_277, out s7_101, out s9, out s10);
			if (a0_84 == 0x00)
				goto l23016EE8;
		}
		word32 a2_265;
		word32 a5_266;
		word32 a6_267;
		word32 s3_268;
		word32 s4_269;
		word32 s5_270;
		word32 s6_271;
		word32 s8_272;
		dbg_test_print(&g_b230AD268, dwArg0168, out s1_126, out a2_265, out a5_266, out a6_267, out s2_131, out s3_268, out s4_269, out s5_270, out s6_271, out s7_101, out s8_272);
		a0_136 = 0x01;
l23016EEA:
		0x00 = (int8) dwArg38;
		s1Out = s1_126;
		a0Out = a0_136;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2_131;
		s7Out = s7_101;
		s9Out = s9;
		s10Out = s10;
		return ra;
	}
	else
	{
l23016EE8:
		a0_136 = 0x00;
		goto l23016EEA;
	}
}

