pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23016F58: Register Eq_2 KeyMgmtSta_PrepareEAPOLFrame(Register Eq_2 ra, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_61280 a4Out)
// Called from:
//      GeneratePWKMsg2
//      GenerateGrpMsg2
//      GeneratePWKMsg4
Eq_2 KeyMgmtSta_PrepareEAPOLFrame(Eq_2 ra, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_61280 & a4Out)
{
	word32 s1_40;
	word32 s8_302;
	word32 s7_301;
	word32 s6_300;
	word32 s5_299;
	word32 s4_298;
	word32 s3_297;
	word32 s2_296;
	word32 a6_295;
	word32 a5_294;
	word32 a2_293;
	Eq_2 s0_39 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_40, out a2_293, out a5_294, out a6_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300, out s7_301, out s8_302);
	if (s0_39 == 0x00 || s1_40 == 0x00)
	{
		s0Out = s1;
		a4Out = a4;
		return ra;
	}
	else
	{
		word32 a1_305;
		word32 a2_306;
		word32 a3_307;
		word32 a4_308;
		word32 a5_309;
		word32 a0_304;
		word32 t1_303;
		Eq_2 ra_69 = memset(ra, s0_39, 0x00, 114, out t1_303, out a0_304, out a1_305, out a2_306, out a3_307, out a4_308, out a5_309);
		struct Eq_66041 * s1_84;
		Eq_2 s3_86;
		word32 a4_310;
		word32 s2_311;
		word32 s4_312;
		struct Eq_66046 * s0_83 = formEAPOLEthHdr(dwArg0138, dwArg0158, out s1_84, out a4_310, out s2_311, out s3_86, out s4_312);
		s0_83->b0012 = (byte) (word32) s1_84->b0004;
		ui32 a5_105 = (word32) s0_83->b0014 & ~0x08 | (word32) s1_84->b0006 & 8;
		ui32 a4_106 = (word32) s0_83->b0013;
		s0_83->b0014 = (byte) a5_105;
		s0_83->b0013 = (byte) (a4_106 | 1);
		s0_83->b0013 = (byte) ((a4_106 | 1) & ~0x02 | (word32) s1_84->b0005 & 0x02);
		uint32 a3_125 = (word32) s1_84->b000C << 24 | (((word32) s1_84->b000A << 8 | (word32) s1_84->b0009) | (word32) s1_84->b000B << 16);
		s0_83->b0017 = (byte) a3_125;
		s0_83->b0018 = (byte) (a3_125 >> 0x08);
		s0_83->b0019 = (byte) (a3_125 >> 0x10);
		s0_83->b001A = (byte) (a3_125 >> 24);
		uint32 a3_142 = (word32) s1_84->b0010 << 24 | (((word32) s1_84->b000E << 8 | (word32) s1_84->b000D) | (word32) s1_84->b000F << 16);
		s0_83->b001B = (byte) a3_142;
		s0_83->b001C = (byte) (a3_142 >> 0x08);
		s0_83->b001D = (byte) (a3_142 >> 0x10);
		s0_83->b001E = (byte) (a3_142 >> 24);
		ui32 a4_150 = (word32) s1_84->b0006;
		s0_83->b0014 = (byte) (a5_105 & ~0x07 | a4_150 & 0x07);
		Eq_61280 a4_151 = a4_150 & 0x07;
		if (s3_86 != 0x00)
		{
			word32 a1_313;
			word32 a2_314;
			word32 a3_315;
			word32 a5_316;
			word32 a6_317;
			word32 a7_318;
			memcpy(&s0_83->b001E + 1, s3_86, 32, out a1_313, out a2_314, out a3_315, out a4_151, out a5_316, out a6_317, out a7_318);
		}
		word32 s1_319;
		word32 a2_320;
		word32 a5_321;
		word32 a6_322;
		word32 s2_323;
		word32 s3_324;
		word32 s4_325;
		word32 s5_326;
		word32 s6_327;
		word32 s7_328;
		word32 s8_329;
		s0Out = dbg_test_print(&g_b230AD268, dwArg0178, out s1_319, out a2_320, out a5_321, out a6_322, out s2_323, out s3_324, out s4_325, out s5_326, out s6_327, out s7_328, out s8_329);
		a4Out = a4_151;
		return ra_69;
	}
}

// 230170B8: Register word32 supplicantAkmIsWpaWpa2(Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      supplicantAkmIsWpaWpa2Psk
word32 supplicantAkmIsWpaWpa2(Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_110;
	word32 a6_142;
	word32 a5_141;
	word32 a2_140;
	word32 s4_143;
	word32 s5_144;
	word32 s6_145;
	word32 s7_146;
	word32 s8_147;
	word32 s1_121;
	ptr32 s2_123;
	Eq_2 s3_125;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_121, out a2_140, out a5_141, out a6_142, out s2_123, out s3_125, out s4_143, out s5_144, out s6_145, out s7_146, out s8_147);
	word32 a1_148;
	word32 a2_149;
	word32 a3_150;
	word32 a5_151;
	ptr32 a4_115;
	if (memcmp(s3_125, 588036276, 0x03, out a1_148, out a2_149, out a3_150, out a4_115, out a5_151) != 0x00)
	{
		word32 a1_152;
		word32 a2_153;
		word32 a3_154;
		word32 a5_155;
		if (memcmp(s3_125, 588036248, 0x03, out a1_152, out a2_153, out a3_154, out a4_115, out a5_155) != 0x00)
		{
			word32 a2_156;
			word32 a5_157;
			word32 a6_158;
			word32 s4_159;
			word32 s5_160;
			word32 s6_161;
			word32 s7_162;
			word32 s8_163;
			dbg_test_print(&g_b230AD268, dwArg0158, out s1_121, out a2_156, out a5_157, out a6_158, out s2_123, out s3_125, out s4_159, out s5_160, out s6_161, out s7_162, out s8_163);
			a0_110 = 0x00;
l230170FE:
			a0Out = a0_110;
			a4Out = a4_115;
			s2Out = s2_123;
			s3Out = s3_125;
			s4Out = dwArg04;
			return s1_121;
		}
	}
	a0_110 = 0x01;
	goto l230170FE;
}

// 2301713A: Register word32 supplicantAkmIsWpa2(Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 s2Out)
// Called from:
//      supplicantAkmUsesKdf
word32 supplicantAkmIsWpa2(Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & s2Out)
{
	ptr32 a0_48;
	Eq_2 s3_34;
	word32 a2_108;
	word32 a5_109;
	word32 a6_110;
	word32 s4_111;
	word32 s5_112;
	word32 s6_113;
	word32 s7_114;
	word32 s8_115;
	word32 s1_28;
	ptr32 s2_100;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_28, out a2_108, out a5_109, out a6_110, out s2_100, out s3_34, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115);
	word32 a1_116;
	word32 a2_117;
	word32 a3_118;
	word32 a4_119;
	word32 a5_120;
	if (memcmp(s3_34, 588036248, 0x03, out a1_116, out a2_117, out a3_118, out a4_119, out a5_120) != 0x00)
	{
		word32 a2_121;
		word32 a5_122;
		word32 a6_123;
		word32 s3_124;
		word32 s4_125;
		word32 s5_126;
		word32 s6_127;
		word32 s7_128;
		word32 s8_129;
		dbg_test_print(&g_b230AD268, dwArg0158, out s1_28, out a2_121, out a5_122, out a6_123, out s2_100, out s3_124, out s4_125, out s5_126, out s6_127, out s7_128, out s8_129);
		a0_48 = 0x00;
	}
	else
		a0_48 = 0x01;
	a0Out = a0_48;
	s2Out = s2_100;
	return s1_28;
}

