pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 230171AA: Register Eq_2 supplicantAkmIsWpaWpa2Psk(Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a4Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
Eq_2 supplicantAkmIsWpaWpa2Psk(Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a4Out)
{
	Eq_2 s0_68;
	word32 s1_126;
	word32 a2_127;
	word32 a5_128;
	word32 a6_129;
	word32 s2_130;
	word32 s3_131;
	word32 s4_132;
	word32 s5_133;
	word32 s6_134;
	word32 s7_135;
	word32 s8_136;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_126, out a2_127, out a5_128, out a6_129, out s2_130, out s3_131, out s4_132, out s5_133, out s6_134, out s7_135, out s8_136);
	word32 a0_41;
	struct Eq_66445 * s4_52;
	word32 s2_137;
	word32 s3_138;
	ptr32 a4_116;
	supplicantAkmIsWpaWpa2(dwArg0138, out a0_41, out a4_116, out s2_137, out s3_138, out s4_52);
	if (a0_41 != 0x00)
	{
		Eq_66483 a5_79 = (word32) s4_52->b0003;
		a4_116 = 0x02;
		s0_68.u0 = 0x01;
		if ((a5_79 & 0x00FB) != 0x02)
			s0_68 = (word32) (a5_79 < -5);
	}
	else
	{
		word32 s1_139;
		word32 a2_140;
		word32 a5_141;
		word32 a6_142;
		word32 s2_143;
		word32 s3_144;
		word32 s4_145;
		word32 s5_146;
		word32 s6_147;
		word32 s7_148;
		word32 s8_149;
		s0_68 = dbg_test_print(&g_b230AD268, dwArg0158, out s1_139, out a2_140, out a5_141, out a6_142, out s2_143, out s3_144, out s4_145, out s5_146, out s6_147, out s7_148, out s8_149);
	}
	a4Out = a4_116;
	return s0_68;
}

// 2301722C: Register word32 supplicantAkmUsesKdf(Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
word32 supplicantAkmUsesKdf(Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	word32 s1_120;
	word32 a2_121;
	word32 a5_122;
	word32 a6_123;
	word32 s2_124;
	word32 s3_125;
	word32 s4_126;
	word32 s5_127;
	word32 s6_128;
	word32 s7_129;
	word32 s8_130;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_120, out a2_121, out a5_122, out a6_123, out s2_124, out s3_125, out s4_126, out s5_127, out s6_128, out s7_129, out s8_130);
	word32 a0_35;
	word32 s2_112;
	struct Eq_66525 * s1_43 = supplicantAkmIsWpa2(dwArg0148, out a0_35, out s2_112);
	if (a0_35 == 0x00 || ((word32) s1_43->b0003 + ~0x02 & 0x00FF) > 0x03)
	{
		word32 s1_131;
		word32 a2_132;
		word32 a5_133;
		word32 a6_134;
		word32 s3_135;
		word32 s4_136;
		word32 s5_137;
		word32 s6_138;
		word32 s7_139;
		word32 s8_140;
		dbg_test_print(&g_b230AD268, dwArg0168, out s1_131, out a2_132, out a5_133, out a6_134, out s2_112, out s3_135, out s4_136, out s5_137, out s6_138, out s7_139, out s8_140);
	}
	return s2_112;
}

// 230172A0: Register word32 supplicantConstructContext(Stack word32 dwArgA8, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      KeyMgmt_DerivePTK
word32 supplicantConstructContext(word32 dwArgA8, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & a6Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 a1_79;
	Eq_2 s4_44;
	Eq_2 s2_48;
	Eq_2 s3_49;
	Eq_2 s5_50;
	Eq_2 s6_51;
	word32 s8_257;
	word32 a6_255;
	word32 s7_256;
	word32 a2_253;
	word32 a5_254;
	word32 s1_252;
	Eq_2 s0_42 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_252, out a2_253, out a5_254, out a6_255, out s2_48, out s3_49, out s4_44, out s5_50, out s6_51, out s7_256, out s8_257);
	word32 a4_261;
	word32 a5_262;
	word32 a2_259;
	word32 a3_260;
	word32 a1_258;
	if (memcmp(s4_44, s5_50, 0x06, out a1_258, out a2_259, out a3_260, out a4_261, out a5_262) < 0x00)
	{
		word32 a1_270;
		word32 a2_271;
		word32 a3_272;
		word32 a4_273;
		word32 a5_274;
		word32 a6_275;
		word32 a7_276;
		memcpy(s0_42, s4_44, 0x06, out a1_270, out a2_271, out a3_272, out a4_273, out a5_274, out a6_275, out a7_276);
		a1_79 = s5_50;
	}
	else
	{
		word32 a4_266;
		word32 a3_265;
		word32 a1_263;
		word32 a2_264;
		word32 a5_267;
		word32 a6_268;
		word32 a7_269;
		memcpy(s0_42, s5_50, 0x06, out a1_263, out a2_264, out a3_265, out a4_266, out a5_267, out a6_268, out a7_269);
		a1_79 = s4_44;
	}
	Eq_2 a1_145;
	word32 a1_298;
	word32 a2_299;
	word32 a3_300;
	word32 a4_301;
	word32 a5_302;
	word32 a6_303;
	word32 a7_304;
	memcpy(s6_51, a1_79, 0x06, out a1_298, out a2_299, out a3_300, out a4_301, out a5_302, out a6_303, out a7_304);
	word32 a1_305;
	word32 a2_306;
	word32 a3_307;
	word32 a4_308;
	word32 a5_309;
	if (memcmp(s2_48, s3_49, 32, out a1_305, out a2_306, out a3_307, out a4_308, out a5_309) < 0x00)
	{
		word32 a1_284;
		word32 a2_285;
		word32 a3_286;
		word32 a4_287;
		word32 a5_288;
		word32 a6_289;
		word32 a7_290;
		memcpy((word32) s0_42 + 0x0C, s2_48, 32, out a1_284, out a2_285, out a3_286, out a4_287, out a5_288, out a6_289, out a7_290);
		a1_145 = s3_49;
	}
	else
	{
		word32 a1_277;
		word32 a2_278;
		word32 a3_279;
		word32 a4_280;
		word32 a5_281;
		word32 a6_282;
		word32 a7_283;
		memcpy((word32) s0_42 + 0x0C, s3_49, 32, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a6_282, out a7_283);
		a1_145 = s2_48;
	}
	word32 a1_310;
	word32 a2_311;
	word32 a3_312;
	word32 a4_313;
	word32 a5_314;
	word32 a6_315;
	word32 a7_316;
	memcpy((word32) s0_42 + 44, a1_145, 32, out a1_310, out a2_311, out a3_312, out a4_313, out a5_314, out a6_315, out a7_316);
	0x00 = dwArgA8;
	ptr32 a6_203;
	word32 s1_205;
	ptr32 s2_210;
	ptr32 s3_211;
	word32 a2_291;
	word32 a5_292;
	word32 s4_293;
	word32 s5_294;
	word32 s6_295;
	word32 s7_296;
	word32 s8_297;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_205, out a2_291, out a5_292, out a6_203, out s2_210, out s3_211, out s4_293, out s5_294, out s6_295, out s7_296, out s8_297);
	a6Out = a6_203;
	s2Out = s2_210;
	s3Out = s3_211;
	return s1_205;
}

// 23017386: Register Eq_2 KeyMgmt_DerivePTK(Register Eq_2 ra, Stack word32 dwArg04, Stack word32 dwArg78, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      KeyMgmtSta_DeriveKeys
Eq_2 KeyMgmt_DerivePTK(Eq_2 ra, word32 dwArg04, word32 dwArg78, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	word32 s1_236;
	word32 a2_237;
	word32 a5_238;
	word32 a6_239;
	word32 s2_240;
	word32 s3_241;
	word32 s4_242;
	word32 s5_243;
	word32 s6_244;
	word32 s7_245;
	word32 s8_246;
	dbg_test_print(&g_b230AD254, dwArg0148, out s1_236, out a2_237, out a5_238, out a6_239, out s2_240, out s3_241, out s4_242, out s5_243, out s6_244, out s7_245, out s8_246);
	word32 a6_68;
	Eq_2 s2_72;
	Eq_2 s3_73;
	Eq_2 s1_71 = supplicantConstructContext(dwArg78, dwArg0128, dwArg0148, out a6_68, out s2_72, out s3_73);
	if (a6_68 != 0x00)
		bl_sha256_crypto_kdf(ra, s3_73, 32, s1_71, 76, s2_72, 384);
	else
	{
		word32 s0_247;
		word32 s1_248;
		word32 s4_249;
		Bl_PRF(ra, s3_73, 32, 0x230AD580, 22, s1_71, 76, s2_72, 64, dwArg04, out s0_247, out s1_248, out s4_249);
	}
	0x00 = (int8) dwArg0128;
	ptr32 s1_179;
	ptr32 s4_180;
	ptr32 s3_185;
	ptr32 s6_187;
	word32 a2_250;
	word32 a5_251;
	word32 a6_252;
	word32 s2_253;
	word32 s5_254;
	word32 s7_255;
	word32 s8_256;
	Eq_2 s0_178 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_179, out a2_250, out a5_251, out a6_252, out s2_253, out s3_185, out s4_180, out s5_254, out s6_187, out s7_255, out s8_256);
	s1Out = s1_179;
	s3Out = s3_185;
	s4Out = s4_180;
	s6Out = s6_187;
	return s0_178;
}

// 23017450: Register word32 KeyMgmtSta_DeriveKeys(Register Eq_2 ra)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      KeyMgmtAp_DerivePTK
word32 KeyMgmtSta_DeriveKeys(Eq_2 ra)
{
	word32 s4_55;
	word32 s5_61;
	word32 s1_263;
	word32 a2_264;
	word32 a5_265;
	word32 a6_266;
	word32 s2_267;
	word32 s3_268;
	word32 s6_269;
	word32 s7_270;
	word32 s8_271;
	Eq_2 s0_53 = dbg_test_print(&g_b230AD254, dwLocC8, out s1_263, out a2_264, out a5_265, out a6_266, out s2_267, out s3_268, out s4_55, out s5_61, out s6_269, out s7_270, out s8_271);
	if (s5_61 != 0x00 && (s4_55 != 0x00 && s0_53 != 0x00))
	{
		Eq_2 s4_85;
		Eq_2 s6_87;
		word32 s1_272;
		word32 s3_273;
		Eq_2 s0_80 = KeyMgmt_DerivePTK(ra, dwLoc023C, dwLoc01C8, dwLoc0118, dwLocF8, dwLocC8, out s1_272, out s3_273, out s4_85, out s6_87);
		word32 a1_274;
		word32 a2_275;
		word32 a3_276;
		word32 a4_277;
		word32 a5_278;
		word32 a6_279;
		word32 a7_280;
		memcpy(s4_85, fp + -0x0224, 0x10, out a1_274, out a2_275, out a3_276, out a4_277, out a5_278, out a6_279, out a7_280);
		word32 a1_281;
		word32 a2_282;
		word32 a3_283;
		word32 a4_284;
		word32 a5_285;
		word32 a6_286;
		word32 a7_287;
		memcpy(s6_87, fp + -532, 0x10, out a1_281, out a2_282, out a3_283, out a4_284, out a5_285, out a6_286, out a7_287);
		word32 a1_288;
		word32 a2_289;
		word32 a3_290;
		word32 a4_291;
		word32 a5_292;
		word32 a6_293;
		word32 a7_294;
		memcpy(s0_80, fp + -516, 0x10, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292, out a6_293, out a7_294);
		word32 a1_295;
		word32 a2_296;
		word32 a3_297;
		word32 a4_298;
		word32 a5_299;
		word32 a6_300;
		word32 a7_301;
		memcpy((word32) s0_80 + 16, fp + -500, 0x08, out a1_295, out a2_296, out a3_297, out a4_298, out a5_299, out a6_300, out a7_301);
		word32 a1_302;
		word32 a2_303;
		word32 a3_304;
		word32 a5_305;
		word32 a6_306;
		word32 a7_307;
		memcpy((word32) s0_80 + 24, fp + -492, 0x08, out a1_302, out a2_303, out a3_304, out a4, out a5_305, out a6_306, out a7_307);
		word32 s1_308;
		word32 a2_309;
		word32 a5_310;
		word32 a6_311;
		word32 s2_312;
		word32 s3_313;
		word32 s4_314;
		word32 s5_315;
		word32 s6_316;
		word32 s7_317;
		word32 s8_318;
		dbg_test_print(&g_b230AD268, dwLocC8, out s1_308, out a2_309, out a5_310, out a6_311, out s2_312, out s3_313, out s4_314, out s5_315, out s6_316, out s7_317, out s8_318);
	}
	return a4;
}

// 23017552: Register word32 SetEAPOLKeyDescTypeVersion(Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      PrepDefaultEapolMsg
word32 SetEAPOLKeyDescTypeVersion(Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s5Out)
{
	struct Eq_67060 * s1_32;
	word32 a2_90;
	word32 a5_91;
	word32 a6_92;
	word32 s2_93;
	word32 s3_94;
	word32 s4_95;
	word32 s5_96;
	word32 s6_97;
	word32 s7_98;
	word32 s8_99;
	Eq_2 s0_31 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_32, out a2_90, out a5_91, out a6_92, out s2_93, out s3_94, out s4_95, out s5_96, out s6_97, out s7_98, out s8_99);
	ui32 a2_42 = (word32) s1_32->b0014;
	s1_32->b0012 = 0x02;
	s1_32->b0014 = (byte) (a2_42 & ~0x07 | (word32) (s0_31 != 0x00) + 0x02);
	ptr32 a5_62;
	word32 s1_65;
	ptr32 s3_71;
	ptr32 s5_72;
	word32 a2_100;
	word32 a6_101;
	word32 s2_102;
	word32 s4_103;
	word32 s6_104;
	word32 s7_105;
	word32 s8_106;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_65, out a2_100, out a5_62, out a6_101, out s2_102, out s3_71, out s4_103, out s5_72, out s6_104, out s7_105, out s8_106);
	a5Out = a5_62;
	s3Out = s3_71;
	s5Out = s5_72;
	return s1_65;
}

