pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 230175C6: Register Eq_2 GetKeyMsgNonceFromEAPOL(Register Eq_2 ra, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg4C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
Eq_2 GetKeyMsgNonceFromEAPOL(Eq_2 ra, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg4C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_2 s0_130;
	word32 s1_223;
	word32 a2_224;
	word32 a5_225;
	word32 a6_226;
	word32 s2_227;
	word32 s3_228;
	word32 s4_229;
	word32 s5_230;
	word32 s6_231;
	word32 s7_232;
	word32 s8_233;
	struct Eq_67144 * s0_38 = *((word32) dbg_test_print(&g_b230AD254, dwArg0168, out s1_223, out a2_224, out a5_225, out a6_226, out s2_227, out s3_228, out s4_229, out s5_230, out s6_231, out s7_232, out s8_233) + 8);
	word32 a0_41;
	ptr32 a4_179;
	ptr32 a3_177;
	ptr32 s1_131;
	ptr32 s10_100;
	Eq_2 s2_136;
	ptr32 s7_140;
	ptr32 s9_109;
	Eq_2 ra_185 = KeyMgmtSta_IsRxEAPOLValid(ra, dwArg28, dwArg0108, dwArg0128, dwArg0138, dwArg0158, out s1_131, out a0_41, out a3_177, out a4_179, out s2_136, out s7_140, out s9_109, out s10_100);
	if (a0_41 != 0x00)
	{
		if (((word32) s0_38->b0005 & 0x01) == 0x00)
		{
			word32 a1_242;
			word32 a2_243;
			word32 a3_244;
			word32 a4_245;
			word32 a5_246;
			word32 a6_247;
			word32 a7_248;
			memcpy(s2_136, &s0_38->b0005 + 0x0C, 32, out a1_242, out a2_243, out a3_244, out a4_245, out a5_246, out a6_247, out a7_248);
			word32 s0_249;
			word32 s1_250;
			word32 a0_251;
			ra_185 = supplicantGenerateRand(ra_185, dwArg00, dwArg04, dwArg4C, dwArgF8, dwArg0148, dwArg0168, out s0_249, out s1_250, out a0_251, out a3_177, out a4_179, out s9_109, out s10_100);
		}
		word32 a2_234;
		word32 a5_235;
		word32 a6_236;
		word32 s3_237;
		word32 s4_238;
		word32 s5_239;
		word32 s6_240;
		word32 s8_241;
		s0_130 = dbg_test_print(&g_b230AD268, dwArg0168, out s1_131, out a2_234, out a5_235, out a6_236, out s2_136, out s3_237, out s4_238, out s5_239, out s6_240, out s7_140, out s8_241);
	}
	else
		s0_130.u0 = 0x00;
	0x00 = (int8) dwArg38;
	s1Out = s1_131;
	a0Out = s0_130;
	a3Out = a3_177;
	a4Out = a4_179;
	s2Out = s2_136;
	s7Out = s7_140;
	s9Out = s9_109;
	s10Out = s10_100;
	return ra_185;
}

// 23017658: Register Eq_2 ProcessRxEAPOL_PwkMsg3(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_63195) s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg3
Eq_2 ProcessRxEAPOL_PwkMsg3(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, struct Eq_63195 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_2 s0_172;
	word32 s1_300;
	word32 a2_301;
	word32 a5_302;
	word32 a6_303;
	word32 s2_304;
	word32 s3_305;
	word32 s4_306;
	word32 s5_307;
	word32 s6_308;
	word32 s7_309;
	word32 s8_310;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_300, out a2_301, out a5_302, out a6_303, out s2_304, out s3_305, out s4_306, out s5_307, out s6_308, out s7_309, out s8_310);
	struct Eq_67274 * a0_42;
	Eq_2 a4_139;
	ptr32 a3_138;
	struct Eq_63195 * s1_119;
	ptr32 s10_253;
	ptr32 s2_120;
	ptr32 s7_125;
	ptr32 s9_103;
	Eq_2 ra_50 = GetKeyMsgNonceFromEAPOL(ra, dwLoc20, dwLoc1C, dwArg08, dwArg18, dwArg2C, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s1_119, out a0_42, out a3_138, out a4_139, out s2_120, out s7_125, out s9_103, out s10_253);
	if (a0_42 != null)
	{
		s1_119->w00F8 = 0x01;
		s1_119->dw00F4 = 0x00;
		if (((word32) a0_42->b0005 & 0x10) != 0x00)
		{
			word32 a2_319;
			word32 a5_320;
			mm_timer_clear(&s1_119->w00F8 + 8, a4_139, out a2_319, out a5_320);
			word32 s1_321;
			word32 s3_322;
			KeyMgmtSta_ApplyKEK(dwArg0138, dwArg0158, out s1_321, out a3_138, out a4_139, out s3_322, out s9_103, out s10_253);
			word32 a0_114;
			s1_119 = keyMgmtProcessMsgExt(dwArg18, dwArg0148, out a0_114, out s2_120, out s7_125);
			if (a0_114 == 0x00)
				goto l23017696;
			a3_138 = parseKeyDataGTK(dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out a4_139);
		}
		word32 a2_311;
		word32 a5_312;
		word32 a6_313;
		word32 s3_314;
		word32 s4_315;
		word32 s5_316;
		word32 s6_317;
		word32 s8_318;
		s0_172 = dbg_test_print(&g_b230AD268, dwArg0158, out s1_119, out a2_311, out a5_312, out a6_313, out s2_120, out s3_314, out s4_315, out s5_316, out s6_317, out s7_125, out s8_318);
l23017698:
		s1Out = s1_119;
		a0Out = s0_172;
		a3Out = a3_138;
		a4Out = a4_139;
		s2Out = s2_120;
		s7Out = s7_125;
		s9Out = s9_103;
		s10Out = s10_253;
		return ra_50;
	}
	else
	{
l23017696:
		s0_172.u0 = 0x00;
		goto l23017698;
	}
}

// 23017716: Register Eq_2 ProcessRxEAPOL_GrpMsg1(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_GrpMsg1
Eq_2 ProcessRxEAPOL_GrpMsg1(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s10Out)
{
	Eq_2 s0_240;
	word32 a0_373;
	word32 s2_374;
	word32 s7_375;
	word32 s1_372;
	word32 s9_376;
	ptr32 a4_166;
	ptr32 a3_171;
	ptr32 s10_28;
	Eq_2 ra_26 = GetKeyMsgNonceFromEAPOL(ra, dwLoc30, dwLoc2C, dwLoc08, dwArg08, dwArg1C, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_372, out a0_373, out a3_171, out a4_166, out s2_374, out s7_375, out s9_376, out s10_28);
	word32 s1_377;
	word32 a2_378;
	word32 a5_379;
	word32 a6_380;
	word32 s3_381;
	word32 s4_382;
	word32 s5_383;
	word32 s6_384;
	word32 s7_385;
	word32 s8_386;
	ptr32 s2_218;
	if (dbg_test_print(&g_b230AD254, dwArg0148, out s1_377, out a2_378, out a5_379, out a6_380, out s2_218, out s3_381, out s4_382, out s5_383, out s6_384, out s7_385, out s8_386) != 0x00)
	{
		Eq_2 a4_77;
		struct Eq_67419 * s1_82;
		Eq_2 s3_85;
		word32 a3_387;
		word32 s9_388;
		struct Eq_67354 * s0_81 = KeyMgmtSta_ApplyKEK(dwArg0128, dwArg0148, out s1_82, out a3_387, out a4_77, out s3_85, out s9_388, out s10_28);
		*(struct Eq_67419 **) 117 = s1_82;
		word32 a2_389;
		word32 a5_390;
		mm_timer_clear(&s1_82->w00D2 + 27, a4_77, out a2_389, out a5_390);
		ui32 a5_110 = (word32) s0_81->b0061;
		ui32 a2_111 = (word32) s0_81->b0062;
		if ((word32) s0_81->b0004 == 0x02)
		{
			a3_171 = parseKeyDataGTK(dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out a4_166);
			word32 a0_212;
			word32 s7_417;
			keyMgmtProcessMsgExt(dwArg08, dwArg0138, out a0_212, out s2_218, out s7_417);
			if (a0_212 == 0x00)
				goto l23017752;
		}
		else
		{
			word32 a1_391;
			word32 a2_392;
			word32 a3_393;
			word32 a4_394;
			word32 a5_395;
			word32 a6_396;
			word32 a7_397;
			memcpy(s3_85, &s0_81->b0062 + 1, a2_111 << 8 | a5_110, out a1_391, out a2_392, out a3_393, out a4_394, out a5_395, out a6_396, out a7_397);
			word32 a1_398;
			word32 a2_399;
			word32 a3_400;
			word32 a4_401;
			word32 a5_402;
			word32 a6_403;
			word32 a7_404;
			memcpy(fp + -40, &s1_82->dw000C + 46, 0x08, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a6_403, out a7_404);
			word32 a1_405;
			word32 a2_406;
			word32 a3_407;
			word32 a4_408;
			word32 a5_409;
			word32 a6_410;
			word32 a7_411;
			memcpy(&s1_82->dw000C + 46, &s1_82->dw000C + 44, 0x08, out a1_405, out a2_406, out a3_407, out a4_408, out a5_409, out a6_410, out a7_411);
			word32 a1_412;
			word32 a2_413;
			word32 a5_414;
			word32 a6_415;
			word32 a7_416;
			memcpy(&s1_82->dw000C + 44, fp + -40, 0x08, out a1_412, out a2_413, out a3_171, out a4_166, out a5_414, out a6_415, out a7_416);
			s1_82->w00D2 = (word16) ((word32) s0_81->b0006 >> 4 & 0x03);
		}
		word32 s1_418;
		word32 a2_419;
		word32 a5_420;
		word32 a6_421;
		word32 s3_422;
		word32 s4_423;
		word32 s5_424;
		word32 s6_425;
		word32 s7_426;
		word32 s8_427;
		s0_240 = dbg_test_print(&g_b230AD268, dwArg0148, out s1_418, out a2_419, out a5_420, out a6_421, out s2_218, out s3_422, out s4_423, out s5_424, out s6_425, out s7_426, out s8_427);
l23017754:
		0x00 = (int8) dwArg0128;
		a0Out = s0_240;
		a3Out = a3_171;
		a4Out = a4_166;
		s2Out = s2_218;
		s10Out = s10_28;
		return ra_26;
	}
	else
	{
l23017752:
		s0_240.u0 = 0x00;
		goto l23017754;
	}
}

// 23017810: Register word32 KeyMgmtResetCounter(Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s3Out)
// Called from:
//      supplicantInit
word32 KeyMgmtResetCounter(Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s3Out)
{
	struct Eq_67590 * s1_24;
	word32 a6_76;
	word32 a5_75;
	word32 a2_74;
	word32 s2_77;
	word32 s3_78;
	word32 s4_79;
	word32 s5_80;
	word32 s6_81;
	word32 s7_82;
	word32 s8_83;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_24, out a2_74, out a5_75, out a6_76, out s2_77, out s3_78, out s4_79, out s5_80, out s6_81, out s7_82, out s8_83);
	if (s1_24 != null)
	{
		s1_24->dw0070 = 0x00;
		s1_24->dw006C = 0x00;
	}
	word32 s1_52;
	ptr32 s3_58;
	word32 a2_84;
	word32 a5_85;
	word32 a6_86;
	word32 s2_87;
	word32 s4_88;
	word32 s5_89;
	word32 s6_90;
	word32 s7_91;
	word32 s8_92;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_52, out a2_84, out a5_85, out a6_86, out s2_87, out s3_58, out s4_88, out s5_89, out s6_90, out s7_91, out s8_92);
	s3Out = s3_58;
	return s1_52;
}

// 23017870: Register word32 keyMgmtSta_StartSession_internal(Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s3Out)
// Called from:
//      keyMgmtSta_StartSession
word32 keyMgmtSta_StartSession_internal(Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s3Out)
{
	struct Eq_67651 * s2_35;
	word32 s3_36;
	word32 a6_115;
	word32 a5_114;
	word32 a2_113;
	word32 s1_112;
	word32 s4_116;
	word32 s5_117;
	word32 s6_118;
	word32 s7_119;
	word32 s8_120;
	Eq_2 s0_29 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_112, out a2_113, out a5_114, out a6_115, out s2_35, out s3_36, out s4_116, out s5_117, out s6_118, out s7_119, out s8_120);
	if (*((word32) s0_29 + 260) == 0x00)
	{
		word32 s1_121;
		word32 a0_122;
		word32 a1_123;
		word32 a2_124;
		word32 a4_125;
		word32 a5_126;
		word32 s2_127;
		word32 s3_128;
		word32 s4_129;
		word32 s8_130;
		s0_29 = mm_timer_set((word32) s0_29 + 264, s2_35->dw0120 + s3_36, a4, mstatus, out s1_121, out a0_122, out a1_123, out a2_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129, out s8_130);
	}
	*((word32) s0_29 + 96) = 0x00;
	((word32) s0_29 + 100)->u0 = 0x00;
	((word32) s0_29 + 0x0068)->u0 = 0x00;
	word32 s1_82;
	ptr32 s3_88;
	word32 a2_131;
	word32 a5_132;
	word32 a6_133;
	word32 s2_134;
	word32 s4_135;
	word32 s5_136;
	word32 s6_137;
	word32 s7_138;
	word32 s8_139;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_82, out a2_131, out a5_132, out a6_133, out s2_134, out s3_88, out s4_135, out s5_136, out s6_137, out s7_138, out s8_139);
	s3Out = s3_88;
	return s1_82;
}

// 230178F0: Register Eq_2 KeyMgmtSta_InitSession(Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      KeyMgmtInitSta
Eq_2 KeyMgmtSta_InitSession(Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 s1_84;
	word32 a2_85;
	word32 a5_86;
	word32 a6_87;
	word32 s2_88;
	word32 s3_89;
	word32 s4_90;
	word32 s5_91;
	word32 s6_92;
	word32 s7_93;
	word32 s8_94;
	Eq_2 s0_27 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_84, out a2_85, out a5_86, out a6_87, out s2_88, out s3_89, out s4_90, out s5_91, out s6_92, out s7_93, out s8_94);
	((word32) s0_27 + 116)->u0 = 0x00;
	((word32) s0_27 + 0x0078)->u0 = 0x00;
	((word32) s0_27 + 0x0080)->u0 = 0x00;
	((word32) s0_27 + 0x007C)->u0 = 0x00;
	((word32) s0_27 + 268)->u0 = 0x2301666A;
	*((word32) s0_27 + 272) = s0_27;
	ptr32 s2_66;
	word32 s1_95;
	word32 a2_96;
	word32 a5_97;
	word32 a6_98;
	word32 s3_99;
	word32 s4_100;
	word32 s5_101;
	word32 s6_102;
	word32 s7_103;
	word32 s8_104;
	Eq_2 s0_60 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_95, out a2_96, out a5_97, out a6_98, out s2_66, out s3_99, out s4_100, out s5_101, out s6_102, out s7_103, out s8_104);
	s2Out = s2_66;
	return s0_60;
}

// 23017966: Register Eq_2 set_psk(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_21838) s1Out, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out)
// Called from:
//      mm_sta_add
Eq_2 set_psk(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, struct Eq_20979 & s1Out, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out)
{
	Eq_2 s3_42;
	word32 s1_142;
	word32 a2_143;
	word32 a5_144;
	word32 a6_145;
	word32 s2_146;
	word32 s4_147;
	word32 s5_148;
	word32 s6_149;
	word32 s7_150;
	word32 s8_151;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_142, out a2_143, out a5_144, out a6_145, out s2_146, out s3_42, out s4_147, out s5_148, out s6_149, out s7_150, out s8_151);
	word32 t1_152;
	word32 a0_153;
	word32 a1_154;
	word32 a2_155;
	word32 a3_156;
	word32 a4_157;
	word32 a5_158;
	Eq_2 ra_56 = memset(ra, 0x42045EA4, 0x00FF, 67, out t1_152, out a0_153, out a1_154, out a2_155, out a3_156, out a4_157, out a5_158);
	word32 a1_159;
	word32 a2_160;
	word32 a3_161;
	word32 a4_162;
	word32 a5_163;
	strlen(s3_42, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163);
	word32 s2_164;
	pmkCacheSetPassphrase(ra_56, mstatus, dwLoc08, dwArg38, dwArg78, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out s2_164);
	struct Eq_20979 * s1_104;
	ptr32 s4_105;
	ptr32 s2_109;
	byte * s3_110;
	word32 a2_165;
	word32 a5_166;
	word32 a6_167;
	word32 s5_168;
	word32 s6_169;
	word32 s7_170;
	word32 s8_171;
	Eq_2 s0_103 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_104, out a2_165, out a5_166, out a6_167, out s2_109, out s3_110, out s4_105, out s5_168, out s6_169, out s7_170, out s8_171);
	s1Out = s1_104;
	s2Out = s2_109;
	s3Out = s3_110;
	s4Out = s4_105;
	return s0_103;
}

// 230179EE: Register word32 remove_psk(Register Eq_2 ra, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_22290) s3Out, Register out (ptr32 Eq_22291) s6Out)
// Called from:
//      mm_sta_del
word32 remove_psk(Eq_2 ra, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178, struct Eq_22290 & s3Out, struct Eq_22291 & s6Out)
{
	word32 s1_106;
	word32 a2_107;
	word32 a5_108;
	word32 a6_109;
	word32 s2_110;
	word32 s3_111;
	word32 s4_112;
	word32 s5_113;
	word32 s6_114;
	word32 s7_115;
	word32 s8_116;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_106, out a2_107, out a5_108, out a6_109, out s2_110, out s3_111, out s4_112, out s5_113, out s6_114, out s7_115, out s8_116);
	word32 s2_117;
	pmkCacheDeletePSK(ra, dwArgF8, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out s2_117);
	word32 s1_78;
	struct Eq_22290 * s3_84;
	struct Eq_22291 * s6_86;
	word32 a2_118;
	word32 a5_119;
	word32 a6_120;
	word32 s2_121;
	word32 s4_122;
	word32 s5_123;
	word32 s7_124;
	word32 s8_125;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_78, out a2_118, out a5_119, out a6_120, out s2_121, out s3_84, out s4_122, out s5_123, out s6_86, out s7_124, out s8_125);
	s3Out = s3_84;
	s6Out = s6_86;
	return s1_78;
}

// 23017A50: void bl_sha256_crypto_kdf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_66844 a1, Register Eq_2 a4, Register int32 a5, Register Eq_2 a6, Register int32 a7)
// Called from:
//      KeyMgmt_DerivePTK
void bl_sha256_crypto_kdf(Eq_2 ra, Eq_2 a0, Eq_66844 a1, Eq_2 a4, int32 a5, Eq_2 a6, int32 a7)
{
	Eq_2 s2_14 = (word32) a4 + a5;
	Eq_66844 s7_41 = a1;
	word16 wLoc72_156 = (word16) a7;
	word16 wLoc62_157 = 0x01;
	Eq_2 s1_106 = s2_14;
	uint32 s0_107 = a7 + 0x00FF >> 8 & 0x00FF;
	while (s0_107 >= (word32) wLoc62_157)
	{
		a6 = hmac_sha256_vector(ra, a0, s7_41, 0x04, fp + -96, fp + -80, s1_106, out s7_41);
		s1_106 = (word32) s1_106 + 32;
		s0_107 = dwLoc78;
		wLoc62_157 = (word16) ((word32) SLICE(a5, word16, 16) + 0x01);
	}
	word32 a7_207;
	word32 a6_206;
	word32 a5_205;
	word32 a4_204;
	word32 a3_203;
	word32 a2_202;
	word32 a1_201;
	memcpy(a6, s2_14, (word32) wLoc72_156 >> 3, out a1_201, out a2_202, out a3_203, out a4_204, out a5_205, out a6_206, out a7_207);
}

// 23017B04: Register Eq_2 pmkCacheFindPSK(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a4Out)
// Called from:
//      KeyMgmtStaHsk_Recvd_PWKMsg1
Eq_2 pmkCacheFindPSK(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a4Out)
{
	word32 a6_204;
	word32 a5_203;
	word32 a2_202;
	word32 s1_201;
	word32 s2_205;
	word32 s3_206;
	word32 s4_207;
	word32 s5_208;
	word32 s6_209;
	word32 s7_210;
	word32 s8_211;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_201, out a2_202, out a5_203, out a6_204, out s2_205, out s3_206, out s4_207, out s5_208, out s6_209, out s7_210, out s8_211);
	word32 s3_212;
	word32 s4_213;
	word32 s5_214;
	ptr32 a4_117;
	if (pmkCacheFindPSKElement(dwArg0108, dwArg0118, dwArg0128, out a4_117, out s3_212, out s4_213, out s5_214) == 0x00 && (word32) g_b42045F70 != 0x00)
	{
		pmkCacheAddPSK(ra, dwArgE8, dwArgF8, dwArg0108, dwArg0138, dwArg0158);
		Eq_2 s4_100;
		word32 a4_226;
		word32 s3_227;
		word32 s5_228;
		Eq_2 a0_89 = pmkCacheFindPSKElement(dwArg0108, dwArg0118, dwArg0128, out a4_226, out s3_227, out s4_100, out s5_228);
		word32 a1_229;
		word32 a2_230;
		word32 a3_231;
		word32 a4_232;
		word32 a5_233;
		word32 s1_234;
		word32 a5_235;
		pmkCacheGeneratePSK(ra, strlen((word32) s4_100 - 144, out a1_229, out a2_230, out a3_231, out a4_232, out a5_233) & 0x00FF, s4_100, mstatus, dwArg18, dwArg58, dwArg98, dwArgE8, dwArg0108, dwArg0128, dwArg0158, out s1_234, out a5_235);
		a4_117 = (word32) a0_89 + 32;
	}
	word32 s1_215;
	word32 a2_216;
	word32 a5_217;
	word32 a6_218;
	word32 s2_219;
	word32 s3_220;
	word32 s4_221;
	word32 s5_222;
	word32 s6_223;
	word32 s7_224;
	word32 s8_225;
	Eq_2 a0_163 = dbg_test_print(&g_b230AD268, dwArg0158, out s1_215, out a2_216, out a5_217, out a6_218, out s2_219, out s3_220, out s4_221, out s5_222, out s6_223, out s7_224, out s8_225);
	a4Out = a4_117;
	return a0_163;
}

