pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23017BB4: Register Eq_2 pmkCacheSetPassphrase(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      set_psk
Eq_2 pmkCacheSetPassphrase(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, ptr32 & s2Out)
{
	Eq_2 s1_38;
	word32 a2_205;
	word32 a5_206;
	word32 a6_207;
	word32 s2_208;
	word32 s3_209;
	word32 s4_210;
	word32 s5_211;
	word32 s6_212;
	word32 s7_213;
	word32 s8_214;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_38, out a2_205, out a5_206, out a6_207, out s2_208, out s3_209, out s4_210, out s5_211, out s6_212, out s7_213, out s8_214);
	if (s1_38 != 0x00)
	{
		word32 a1_215;
		word32 a2_216;
		word32 a3_217;
		word32 a4_218;
		word32 a5_219;
		word32 a6_220;
		word32 a7_221;
		memcpy(0x42045F70, s1_38, 64, out a1_215, out a2_216, out a3_217, out a4_218, out a5_219, out a6_220, out a7_221);
		pmkCacheAddPSK(ra, dwArgE8, dwArgF8, dwArg0108, dwArg0138, dwArg0158);
		Eq_68159 s3_99;
		Eq_2 s4_100;
		word32 a4_222;
		word32 s5_223;
		pmkCacheFindPSKElement(dwArg0108, dwArg0118, dwArg0128, out a4_222, out s3_99, out s4_100, out s5_223);
		word32 s1_224;
		word32 a5_225;
		pmkCacheGeneratePSK(ra, s3_99, s4_100, mstatus, dwArg18, dwArg58, dwArg98, dwArgE8, dwArg0108, dwArg0128, dwArg0158, out s1_224, out a5_225);
	}
	ptr32 s2_153;
	word32 s1_226;
	word32 a2_227;
	word32 a5_228;
	word32 a6_229;
	word32 s3_230;
	word32 s4_231;
	word32 s5_232;
	word32 s6_233;
	word32 s7_234;
	word32 s8_235;
	Eq_2 s0_147 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_226, out a2_227, out a5_228, out a6_229, out s2_153, out s3_230, out s4_231, out s5_232, out s6_233, out s7_234, out s8_235);
	s2Out = s2_153;
	return s0_147;
}

// 23017C54: Register Eq_2 pmkCacheInit(Register Eq_2 ra, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
// Called from:
//      supplicantRestoreDefaults
Eq_2 pmkCacheInit(Eq_2 ra, Eq_2 dwArg38, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	word32 s1_94;
	word32 a2_95;
	word32 a5_96;
	word32 a6_97;
	word32 s2_98;
	word32 s3_99;
	word32 s4_100;
	word32 s5_101;
	word32 s6_102;
	word32 s7_103;
	word32 s8_104;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_94, out a2_95, out a5_96, out a6_97, out s2_98, out s3_99, out s4_100, out s5_101, out s6_102, out s7_103, out s8_104);
	word32 t1_105;
	word32 a0_106;
	word32 a1_107;
	word32 a2_108;
	word32 a3_109;
	word32 a4_110;
	word32 a5_111;
	word32 t1_112;
	word32 a0_113;
	word32 a1_114;
	word32 a2_115;
	word32 a3_116;
	word32 a4_117;
	word32 a5_118;
	Eq_2 ra_57 = memset(memset(ra, 0x42045EE8, 0x00, 0x0086, out t1_105, out a0_106, out a1_107, out a2_108, out a3_109, out a4_110, out a5_111), 0x42045F70, 0x00, 64, out t1_112, out a0_113, out a1_114, out a2_115, out a3_116, out a4_117, out a5_118);
	g_b42046FB0 = 0x00;
	0x00 = (int8) dwArg38;
	word32 s1_119;
	word32 a2_120;
	word32 a5_121;
	word32 a6_122;
	word32 s2_123;
	word32 s3_124;
	word32 s4_125;
	word32 s5_126;
	word32 s6_127;
	word32 s7_128;
	word32 s8_129;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_119, out a2_120, out a5_121, out a6_122, out s2_123, out s3_124, out s4_125, out s5_126, out s6_127, out s7_128, out s8_129);
	return ra_57;
}

// 23017CD0: Register Eq_2 pmkCacheRomInit(Stack Eq_2 dwArg38, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      supplicantRestoreDefaults
Eq_2 pmkCacheRomInit(Eq_2 dwArg38, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 s1_78;
	word32 a2_79;
	word32 a5_80;
	word32 a6_81;
	word32 s2_82;
	word32 s3_83;
	word32 s4_84;
	word32 s5_85;
	word32 s6_86;
	word32 s7_87;
	word32 s8_88;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_78, out a2_79, out a5_80, out a6_81, out s2_82, out s3_83, out s4_84, out s5_85, out s6_86, out s7_87, out s8_88);
	g_dw42046FBC = 0x02;
	g_dw42046FB8 = 0x42045EE8;
	g_dw42046FB4 = 0x42045F70;
	0x00 = (int8) dwArg38;
	ptr32 s2_63;
	word32 s1_89;
	word32 a2_90;
	word32 a5_91;
	word32 a6_92;
	word32 s3_93;
	word32 s4_94;
	word32 s5_95;
	word32 s6_96;
	word32 s7_97;
	word32 s8_98;
	Eq_2 s0_57 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_89, out a2_90, out a5_91, out a6_92, out s2_63, out s3_93, out s4_94, out s5_95, out s6_96, out s7_97, out s8_98);
	s2Out = s2_63;
	return s0_57;
}

// 23017D4A: Register ptr32 pmkCacheNewElement(Register Eq_2 ra, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      pmkCacheAddPSK
ptr32 pmkCacheNewElement(Eq_2 ra, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	struct Eq_68448 * s4_43;
	struct Eq_68449 * s2_47;
	struct Eq_68450 * s5_49;
	word32 s6_50;
	word32 a6_249;
	word32 s7_250;
	word32 s8_251;
	word32 a5_248;
	word32 s1_246;
	word32 a2_247;
	Eq_2 s3_102;
	Eq_2 s0_109 = dbg_test_print(&g_b230AD254, dwArg0148, out s1_246, out a2_247, out a5_248, out a6_249, out s2_47, out s3_102, out s4_43, out s5_49, out s6_50, out s7_250, out s8_251);
	while (true)
	{
		Eq_2 a5_54 = s5_49->tFFFFFFBC;
		if (s0_109 >= a5_54)
			break;
		if ((int32) s2_47->bFFFFFFB0 == a5_54)
		{
			struct Eq_68509 * a5_62 = (word32) s4_43->tFFFFFFB8 + ((word32) s0_109 + s6_50);
			a5_62->b0042 = (byte) ((word32) a5_62->b0042 + ~0x00);
		}
		if (s3_102 == 0x00)
		{
			int32 s7_70 = (word32) s0_109 + s6_50;
			Eq_2 s1_74 = (word32) s4_43->tFFFFFFB8 + s7_70;
			if ((int32) *((word32) s1_74 + 66) == 0x00)
			{
				word32 t1_260;
				word32 a2_263;
				word32 a3_264;
				word32 a1_262;
				word32 a0_261;
				word32 a4_265;
				word32 a5_266;
				ra = memset(ra, s1_74, 0x00, 67, out t1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266);
				Eq_2 a5_91 = (int32) s2_47->bFFFFFFB0;
				if (a5_91 < s5_49->tFFFFFFBC)
					s2_47->b0FB0 = (byte) ((word32) a5_91 + 1);
				(word32) s4_43->tFFFFFFB8 + s7_70 + 66 = (int32) (byte) (word32) s2_47->bFFFFFFB0;
				s3_102 = s1_74;
			}
		}
		s0_109 = (word32) s0_109 + 1 & 0x00FF;
	}
	word32 a2_253;
	word32 s8_259;
	word32 s7_258;
	word32 s6_257;
	ptr32 s2_134;
	ptr32 s3_135;
	ptr32 s5_136;
	word32 a5_254;
	word32 s4_256;
	word32 a6_255;
	word32 s1_252;
	dbg_test_print(&g_b230AD268, dwArg0148, out s1_252, out a2_253, out a5_254, out a6_255, out s2_134, out s3_135, out s4_256, out s5_136, out s6_257, out s7_258, out s8_259);
	0x00 = (int8) dwArg0128;
	s2Out = s2_134;
	s3Out = s3_135;
	s4Out = dwArg78;
	s5Out = s5_136;
	return s3_135;
}

// 23017E40: void pmkCacheUpdateReplacementRank(Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
// Called from:
//      pmkCacheFindPSKElement
void pmkCacheUpdateReplacementRank(Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	struct Eq_68593 * s1_24;
	word32 a2_125;
	word32 a5_126;
	word32 a6_127;
	word32 s2_128;
	word32 s3_129;
	word32 s4_130;
	word32 s5_131;
	word32 s6_132;
	word32 s7_133;
	word32 s8_134;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_24, out a2_125, out a5_126, out a6_127, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134);
	if (s1_24 != null)
	{
		int32 a2_35 = (int32) g_b42045FB0;
		if ((int32) s1_24->b0042 != a2_35)
		{
			int32 a1_38 = g_dw42045FBC;
			int32 a0_40 = g_dw42045FB8;
			int32 a5_42 = 0x00;
			while (a5_42 < a1_38)
			{
				struct Eq_68637 * a4_51 = a5_42 + 67 + a0_40;
				int32 a3_52 = (int32) a4_51->b0042;
				if ((int32) s1_24->b0042 < a3_52)
					a4_51->b0042 = (byte) (a3_52 + ~0x00);
				a5_42 = a5_42 + 0x01 & 0x00FF;
			}
			s1_24->b0042 = (byte) a2_35;
		}
	}
	word32 s1_135;
	word32 a2_136;
	word32 a5_137;
	word32 a6_138;
	word32 s2_139;
	word32 s3_140;
	word32 s4_141;
	word32 s5_142;
	word32 s6_143;
	word32 s7_144;
	word32 s8_145;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_135, out a2_136, out a5_137, out a6_138, out s2_139, out s3_140, out s4_141, out s5_142, out s6_143, out s7_144, out s8_145);
}

// 23017EE6: Register word32 pmkCacheFindPSKElement(Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      pmkCacheFindPSK
//      pmkCacheSetPassphrase
//      pmkCacheAddPSK
//      pmkCacheDeletePSK
word32 pmkCacheFindPSKElement(Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 s8_47;
	Eq_2 s2_50;
	struct Eq_68694 * s3_51;
	Eq_2 s6_53;
	struct Eq_68696 * s7_54;
	word32 s4_198;
	word32 s5_199;
	word32 a5_196;
	word32 a6_197;
	word32 s1_194;
	word32 a2_195;
	Eq_2 s0_44 = dbg_test_print(&g_b230AD254, dwArg0148, out s1_194, out a2_195, out a5_196, out a6_197, out s2_50, out s3_51, out s4_198, out s5_199, out s6_53, out s7_54, out s8_47);
	while (s0_44 < s7_54->tFFFFFFBC)
	{
		Eq_2 a0_63 = s3_51->dwFFFFFFB8 + ((word32) s0_44 + s8_47);
		if ((int32) *((word32) a0_63 + 66) != 0x00 && (word32) (*((word32) a0_63 + 64)) == s2_50)
		{
			word32 a1_208;
			word32 a2_209;
			word32 a3_210;
			word32 a5_211;
			memcmp(a0_63, s6_53, s2_50, out a1_208, out a2_209, out a3_210, out a4, out a5_211) != 0x00;
		}
		s0_44 = (word32) s0_44 + 1 & 0x00FF;
	}
	pmkCacheUpdateReplacementRank(dwArg0138, dwArg0148);
	word32 s4_204;
	word32 s8_207;
	word32 s1_113;
	ptr32 s3_119;
	ptr32 s5_120;
	word32 s7_206;
	word32 s6_205;
	word32 a6_202;
	word32 s2_203;
	word32 a2_200;
	word32 a5_201;
	dbg_test_print(&g_b230AD268, dwArg0148, out s1_113, out a2_200, out a5_201, out a6_202, out s2_203, out s3_119, out s4_204, out s5_120, out s6_205, out s7_206, out s8_207);
	0x00 = (int8) dwArg0128;
	a4Out = a4;
	s3Out = s3_119;
	s4Out = dwArg78;
	s5Out = s5_120;
	return s1_113;
}

// 23017FAC: void pmkCacheAddPSK(Register Eq_2 ra, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178)
// Called from:
//      pmkCacheFindPSK
//      pmkCacheSetPassphrase
void pmkCacheAddPSK(Eq_2 ra, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0178)
{
	word32 s1_219;
	word32 a2_220;
	word32 a5_221;
	word32 a6_222;
	word32 s2_223;
	word32 s3_224;
	word32 s4_225;
	word32 s5_226;
	word32 s6_227;
	word32 s7_228;
	word32 s8_229;
	dbg_test_print(&g_b230AD254, dwArg0158, out s1_219, out a2_220, out a5_221, out a6_222, out s2_223, out s3_224, out s4_225, out s5_226, out s6_227, out s7_228, out s8_229);
	word32 a4_230;
	word32 s4_231;
	Eq_2 s3_107;
	word32 s5_125;
	Eq_2 a0_50 = pmkCacheFindPSKElement(dwArg0108, dwArg0118, dwArg0128, out a4_230, out s3_107, out s4_231, out s5_125);
	Eq_2 s0_110 = a0_50;
	if (a0_50 == 0x00)
	{
		Eq_2 s2_79;
		Eq_2 s4_81;
		Eq_2 a0_69 = pmkCacheNewElement(ra, dwArg0108, dwArg0128, out s2_79, out s3_107, out s4_81, out s5_125);
		word32 a1_232;
		word32 a2_233;
		word32 a3_234;
		word32 a4_235;
		word32 a5_236;
		word32 a6_237;
		word32 a7_238;
		memcpy(a0_69, s4_81, s2_79, out a1_232, out a2_233, out a3_234, out a4_235, out a5_236, out a6_237, out a7_238);
		*((word32) a0_69 + 64) = (byte) s2_79;
		s0_110 = a0_69;
	}
	if (s3_107 != 0x00)
	{
		word32 a1_239;
		word32 a2_240;
		word32 a3_241;
		word32 a4_242;
		word32 a5_243;
		word32 a6_244;
		word32 a7_245;
		memcpy((word32) s0_110 + 32, s3_107, 32, out a1_239, out a2_240, out a3_241, out a4_242, out a5_243, out a6_244, out a7_245);
		*((word32) s0_110 + 65) = (byte) s5_125;
	}
	word32 s1_246;
	word32 a2_247;
	word32 a5_248;
	word32 a6_249;
	word32 s2_250;
	word32 s3_251;
	word32 s4_252;
	word32 s5_253;
	word32 s6_254;
	word32 s7_255;
	word32 s8_256;
	dbg_test_print(&g_b230AD268, dwArg0178, out s1_246, out a2_247, out a5_248, out a6_249, out s2_250, out s3_251, out s4_252, out s5_253, out s6_254, out s7_255, out s8_256);
}

// 2301804C: Register Eq_2 pmkCacheDeletePSK(Register Eq_2 ra, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s2Out)
// Called from:
//      remove_psk
Eq_2 pmkCacheDeletePSK(Eq_2 ra, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s2Out)
{
	word32 a4_115;
	word32 s3_116;
	word32 s4_117;
	word32 s5_118;
	pmkCacheFindPSKElement(dwArg0118, dwArg0128, dwArg0138, out a4_115, out s3_116, out s4_117, out s5_118);
	Eq_2 s1_41;
	word32 a2_119;
	word32 a5_120;
	word32 a6_121;
	word32 s2_122;
	word32 s3_123;
	word32 s4_124;
	word32 s5_125;
	word32 s6_126;
	word32 s7_127;
	word32 s8_128;
	dbg_test_print(&g_b230AD254, dwArg0168, out s1_41, out a2_119, out a5_120, out a6_121, out s2_122, out s3_123, out s4_124, out s5_125, out s6_126, out s7_127, out s8_128);
	if (s1_41 != 0x00)
	{
		word32 t1_129;
		word32 a0_130;
		word32 a1_131;
		word32 a2_132;
		word32 a3_133;
		word32 a4_134;
		word32 a5_135;
		memset(ra, s1_41, 0x00, 67, out t1_129, out a0_130, out a1_131, out a2_132, out a3_133, out a4_134, out a5_135);
		g_b42046FB0 = (byte) ((word32) g_b42045FB0 + ~0x00);
	}
	ptr32 s2_88;
	word32 s1_136;
	word32 a2_137;
	word32 a5_138;
	word32 a6_139;
	word32 s3_140;
	word32 s4_141;
	word32 s5_142;
	word32 s6_143;
	word32 s7_144;
	word32 s8_145;
	Eq_2 s0_82 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_136, out a2_137, out a5_138, out a6_139, out s2_88, out s3_140, out s4_141, out s5_142, out s6_143, out s7_144, out s8_145);
	s2Out = s2_88;
	return s0_82;
}

// 230180C2: Register word32 pmkCacheGetHexNibble(Stack Eq_2 dwArg0158, Register out Eq_68998 a0Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      pmkCacheGeneratePSK
word32 pmkCacheGetHexNibble(Eq_2 dwArg0158, union Eq_68998 & a0Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 s0_49;
	word32 a2_101;
	word32 a5_102;
	word32 a6_103;
	word32 s2_104;
	word32 s4_105;
	word32 s6_106;
	word32 s7_107;
	word32 s8_108;
	ptr32 s3_34;
	word32 s1_28;
	ptr32 s5_35;
	Eq_2 s0_27 = dbg_test_print(&g_b230AD254, dwArg0158, out s1_28, out a2_101, out a5_102, out a6_103, out s2_104, out s3_34, out s4_105, out s5_35, out s6_106, out s7_107, out s8_108);
	if (s0_27 > 96)
		s0_49 = (word32) s0_27 - 87;
	else if (s0_27 > 64)
		s0_49 = (word32) s0_27 - 55;
	else
	{
		word32 a2_109;
		word32 a5_110;
		word32 a6_111;
		word32 s2_112;
		word32 s4_113;
		word32 s6_114;
		word32 s7_115;
		word32 s8_116;
		s0_49 = dbg_test_print(&g_b230AD268, dwArg0158, out s1_28, out a2_109, out a5_110, out a6_111, out s2_112, out s3_34, out s4_113, out s5_35, out s6_114, out s7_115, out s8_116);
	}
	a0Out = s0_49 & 0x00FF;
	s3Out = s3_34;
	s4Out = dwArg04;
	s5Out = s5_35;
	return s1_28;
}

