pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301813E: Register Eq_2 pmkCacheGeneratePSK(Register Eq_2 ra, Register Eq_68159 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a5Out)
// Called from:
//      pmkCacheFindPSK
//      pmkCacheSetPassphrase
//      KeyMgmtInit
Eq_2 pmkCacheGeneratePSK(Eq_2 ra, Eq_68159 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a5Out)
{
	Eq_2 s1_40;
	Eq_2 s4_41;
	Eq_2 s3_46;
	word32 s5_239;
	word32 s6_240;
	word32 s7_241;
	word32 s8_242;
	word32 s2_238;
	word32 a6_237;
	word32 a5_236;
	word32 a2_235;
	Eq_2 s0_39 = dbg_test_print(&g_b230AD254, dwArg0148, out s1_40, out a2_235, out a5_236, out a6_237, out s2_238, out s3_46, out s4_41, out s5_239, out s6_240, out s7_241, out s8_242);
	if (s4_41 != 0x00 && s0_39 != 0x00)
	{
		if (a3 <= -63)
			utils_wifi_psk_cal_fast_bin(ra, s0_39, s1_40, s3_46, s3_46, s4_41, mstatus, s4, dwArg38, dwArg78, dwArgB8, dwArg0108);
		else if (a3 == 64)
		{
			do
			{
				word32 a0_252;
				word32 s3_253;
				word32 s4_254;
				word32 s5_255;
				pmkCacheGetHexNibble(dwArg0128, out a0_252, out s3_253, out s4_254, out s5_255);
				ui32 a0_79;
				int32 s3_87;
				int32 s4_88;
				int32 s5_89;
				*((word32) (s3_87 >> 0x01) + s4_88) = (byte) (a0_79 | pmkCacheGetHexNibble(dwArg0128, out a0_79, out s3_87, out s4_88, out s5_89) << 0x04);
			} while (s3_87 + 0x02 != s5_89);
		}
	}
	0x00 = (int8) dwArg0128;
	ptr32 a5_152;
	ptr32 s1_155;
	word32 a6_244;
	word32 a2_243;
	word32 s2_245;
	word32 s3_246;
	word32 s4_247;
	word32 s5_248;
	word32 s6_249;
	word32 s7_250;
	word32 s8_251;
	Eq_2 s0_154 = dbg_test_print(&g_b230AD268, dwArg0178, out s1_155, out a2_243, out a5_152, out a6_244, out s2_245, out s3_246, out s4_247, out s5_248, out s6_249, out s7_250, out s8_251);
	s1Out = s1_155;
	a5Out = a5_152;
	return s0_154;
}

// 23018206: void prepare_key(Register ptr32 a0, Register int32 a1, Register (ptr32 Eq_69173) a2)
// Called from:
//      RC4_Encrypt
void prepare_key(ptr32 a0, int32 a1, struct Eq_69173 * a2)
{
	int32 a5_3;
	for (a5_3 = 0x00; a5_3 != 0x0100; ++a5_3)
		a2[a5_3] = (struct Eq_69173) (byte) a5_3;
	a2[0x0100] = (struct Eq_69173) 0x00;
	a2[0x0101] = (struct Eq_69173) 0x00;
	struct Eq_69173 * a3_13 = a2;
	ui32 a7_15 = 0x00;
	int32 a4_16 = 0x00;
	do
	{
		word32 a6_25 = (word32) a3_13->b0000;
		ui32 a5_30 = (word32) (a0 + a4_16) + a6_25 + a7_15;
		byte * a5_34 = a2 + (a5_30 & 0x00FF);
		++a3_13;
		a3_13[0x0FFF] = (struct Eq_69173) (byte) (word32) *a5_34;
		*a5_34 = (byte) a6_25;
		a7_15 = a5_30 & 0x00FF;
		a4_16 = (a4_16 + 0x01 | a1) & 0x00FF;
	} while (a2 + 0x0100 != a3_13);
}

// 23018264: Register ui32 rc4(Register ptr32 a0, Register Eq_65735 a1, Register int32 a2, Register (ptr32 Eq_69239) a3)
// Called from:
//      RC4_Encrypt
ui32 rc4(ptr32 a0, Eq_65735 a1, int32 a2, struct Eq_69239 * a3)
{
	word32 t3_5 = (word32) a3->b0100;
	ui32 a4_21 = (word32) a3->b0101;
	int32 a5_26 = 0x00;
	while (true)
	{
		ui32 a6_10 = t3_5 + a5_26;
		if (a5_26 >= a2)
			break;
		byte * a6_16 = a3 + ((a6_10 & 0x00FF) + 0x01 & 0x00FF) / 258;
		word32 t1_18 = (word32) *a6_16;
		ui32 a4_22 = a4_21 + t1_18;
		byte * a7_24 = a3 + (a4_22 & 0x00FF) / 258;
		*a6_16 = (byte) (word32) *a7_24;
		*a7_24 = (byte) t1_18;
		a4_21 = a4_22 & 0x00FF;
		a5_26 = (int32) (word16) (a5_26 + 0x01);
	}
	Eq_65735 a7_29 = 0x00;
	while (true)
	{
		ui32 a5_32 = (word32) a7_29.u0 + (a6_10 & 0x00FF);
		if (a7_29 >= a1)
			break;
		byte * a5_38 = a3 + ((a5_32 & 0x00FF) + 0x01 & 0x00FF) / 258;
		word32 a2_40 = (word32) *a5_38;
		ui32 a4_42 = a4_21 + a2_40;
		byte * t1_44 = a3 + (a4_42 & 0x00FF) / 258;
		*a5_38 = (byte) (word32) *t1_44;
		*t1_44 = (byte) a2_40;
		byte * t1_50 = (word32) a7_29.u0 + a0;
		*t1_50 = (byte) ((word32) a3[(a2_40 + (word32) (*a5_38) & 0x00FF) / 258] ^ (word32) (*t1_50));
		a4_21 = a4_42 & 0x00FF;
		a7_29.u0 = (int32) (word16) ((word32) a7_29.u0 + 1);
	}
	a3->b0100 = (byte) (a5_32 & 0x00FF);
	a3->b0101 = (byte) a4_21;
	return a4_21;
}

// 23018306: Register ptr32 RC4_Encrypt(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register ptr32 a3, Register Eq_65735 a4, Register int32 a5, Register out Eq_65735 a4Out)
// Called from:
//      KeyMgmtSta_ApplyKEK
ptr32 RC4_Encrypt(Eq_2 a0, Eq_2 a1, Eq_2 a2, ptr32 a3, Eq_65735 a4, int32 a5, union Eq_65735 & a4Out)
{
	if (a2 <= -16)
	{
		word32 a1_136;
		word32 a2_137;
		word32 a3_138;
		word32 a4_139;
		word32 a5_140;
		word32 a6_141;
		word32 a7_142;
		memcpy(fp + -64, a1, a2, out a1_136, out a2_137, out a3_138, out a4_139, out a5_140, out a6_141, out a7_142);
		word32 a1_143;
		word32 a2_144;
		word32 a3_145;
		word32 a4_146;
		word32 a5_147;
		word32 a6_148;
		word32 a7_149;
		memcpy((word32) a2 + (fp + -64), a0, 0x10, out a1_143, out a2_144, out a3_145, out a4_146, out a5_147, out a6_148, out a7_149);
		prepare_key(fp + -64, (word32) a2 + 16, &g_t42012DB4);
		a3 = 0x42012DB4;
		a4 = rc4(a3, a4, a5, &g_t42012DB4);
	}
	a4Out = a4;
	return a3;
}

// 2301836E: Register word32 sha256_compress(Register (ptr32 Eq_69416) a0, Register Eq_2 a1, Register (ptr32 Eq_69418) a2, Register out ptr32 s1Out, Register out (ptr32 Eq_69420) a0Out, Register out (ptr32 Eq_69421) a2Out, Register out Eq_69422 a4Out, Register out (ptr32 Eq_69423) a5Out, Register out (ptr32 Eq_69424) s2Out, Register out Eq_69425 s3Out, Register out ptr32 s4Out, Register out Eq_69427 s8Out)
// Called from:
//      sha256_vector
word32 sha256_compress(struct Eq_69416 * a0, Eq_2 a1, struct Eq_69418 * a2, ptr32 & s1Out, struct Eq_69420 & a0Out, struct Eq_69421 & a2Out, union Eq_69422 & a4Out, struct Eq_69423 & a5Out, struct Eq_69424 & s2Out, union Eq_69425 & s3Out, ptr32 & s4Out, union Eq_69427 & s8Out)
{
	word32 a6_253;
	word32 a7_254;
	word32 a1_248;
	word32 a2_249;
	word32 a5_252;
	word32 a4_251;
	word32 a3_250;
	memcpy(a2 + 64, (char *) a0 + 8, 32, out a1_248, out a2_249, out a3_250, out a4_251, out a5_252, out a6_253, out a7_254);
	struct Eq_69424 * s2_11 = a2 + 64;
	Eq_2 s4_20 = a1;
	struct Eq_69418 * a3_41 = a2;
	do
	{
		uint32 a5_48 = (word32) *((word32) s4_20 + 1) << 8 | (word32) (*s4_20);
		s4_20 = (word32) s4_20 + 4;
		++a3_41;
		a3_41[0x03FF] = (struct Eq_69418) (((word32) (word16) (a5_48 >> 8 | a5_48 << 0x08) << 8 | (word32) (*((word32) s4_20 - 2))) << 8 | (word32) (*((word32) s4_20 - 1)));
	} while (s4_20 != (word32) a1 + 64);
	struct Eq_69496 * a4_65 = a2 + 16;
	do
	{
		Eq_69499 a3_68 = a4_65->dwFFFFFFF8;
		++a4_65;
		Eq_69505 a2_69 = a4_65->dwFFFFFFC4;
		a4_65[0x03FF] = (struct Eq_69496) (((a3_68 << 0x0F | a3_68 >> 0x11) ^ (a3_68 << 0x0D | a3_68 >> 0x13) ^ a3_68 >> 0x0A) + (a4_65->dwFFFFFFE0 + a4_65->dwFFFFFFBC) + (((a2_69 >> 0x07 | a2_69 << 0x19) ^ (a2_69 << 0x0E | a2_69 >> 0x12)) ^ a2_69 >> 3));
	} while (a2 + 64 != a4_65);
	struct Eq_69551 * a1_125 = null;
	do
	{
		Eq_69553 a2_102 = a2[0x0044];
		Eq_69553 t3_103 = a2[70];
		Eq_69553 t4_104 = a2[69];
		struct Eq_69423 * a3_121 = a2[64];
		struct Eq_69423 * t1_122 = a2[67];
		struct Eq_69423 * a7_128 = a2[65];
		struct Eq_69423 * t5_129 = a2[66];
		ui32 a5_130 = (word32) a1_125[0x08C2B64E] + ((word32) a2[71] + ((((a2_102 >> 0x06 | a2_102 << 0x1A) ^ (a2_102 >> 11 | a2_102 << 0x15)) ^ (a2_102 << 0x07 | a2_102 >> 0x19)) + ((t3_103 ^ t4_104) & a2_102 ^ t3_103)));
		word32 a4_132 = Mem101[a2 + a1_125:word32];
		a2[69] = (struct Eq_69418) a2_102;
		ui32 a5_135 = a5_130 + a4_132;
		a2[0x0044] = (struct Eq_69418) (t1_122 + a5_135 / 64);
		a2[65] = (struct Eq_69418) a3_121;
		a2[71] = (struct Eq_69418) t3_103;
		a2[70] = (struct Eq_69418) t4_104;
		a2[67] = (struct Eq_69418) t5_129;
		a2[66] = (struct Eq_69418) a7_128;
		struct Eq_69423 * a5_154 = a5_135 + ((((a3_121 >> 0x02 | a3_121 << 0x1E) ^ (a3_121 >> 0x0D | a3_121 << 0x13)) ^ (a3_121 << 0x0A | a3_121 >> 22)) + (a3_121 & a7_128 | (a3_121 | a7_128) & t5_129));
		a2[64] = (struct Eq_69418) a5_154;
		++a1_125;
	} while (a1_125 != (struct Eq_69551 *) 0x0100);
	do
	{
		struct Eq_69669 * s1_168 = a5_154->ptr0000;
		Eq_69422 a4_170 = s2_11->dw0000;
		a5_154 += a4_170;
		s1_168->ptr1000 = a5_154;
		++s2_11;
	} while ((char *) a0 + 40 != (char *) s1_168 + 4);
	s1Out = (char *) s1_168 + 4;
	a0Out = null;
	a2Out = dwArg48;
	a4Out = a4_170;
	a5Out = a5_154;
	s2Out = s2_11;
	s3Out = (char *) a0 + 40;
	s4Out = dwArg04;
	s8Out = s4;
	return s1;
}

// 23018524: Register word32 sha256_init(Register Eq_2 a0)
// Called from:
//      sha256_vector
word32 sha256_init(Eq_2 a0)
{
	null = (union Eq_2 *) a0;
	*(union Eq_2 *) 1779033711 = a0;
	*(union Eq_2 *) 3144134289 = a0;
	*(union Eq_2 *) 0x3C6EF382 = a0;
	*(union Eq_2 *) 2773480782 = a0;
	*(union Eq_2 *) 1359893143 = a0;
	*(union Eq_2 *) 2600822952 = a0;
	*(union Eq_2 *) 528734667 = a0;
	((word32) a0 + 40)->u0 = 0x00;
	*((word32) a0 + 4) = 0x00;
	*(union Eq_2 *) 1541459261 = a0;
	return 1541459225;
}

