pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23018584: Register word32 sha256_vector(Register Eq_2 s1, Register ui32 a0, Register (ptr32 Eq_69727) a2, Register Eq_2 a4, Stack (ptr32 Eq_69727) dwArg74, Stack word32 dwArg010C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a6Out, Register out (ptr32 Eq_69734) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_69737 s6Out, Register out ptr32 s7Out)
// Called from:
//      hmac_sha256_vector
word32 sha256_vector(Eq_2 s1, ui32 a0, struct Eq_69727 * a2, Eq_2 a4, struct Eq_69727 * dwArg74, word32 dwArg010C, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a6Out, struct Eq_69734 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_69737 & s6Out, ptr32 & s7Out)
{
	Eq_2 a0_112 = a4;
	struct Eq_69734 * s2_122 = a3;
	struct Eq_69418 * s4_108 = (word32) a4 + 112;
	struct Eq_69423 * a5_103 = sha256_init(a4);
	int32 s8_125 = 0x00;
	a4_116 = a4;
	while (true)
	{
		Eq_2 a4_116;
		if (s8_125 == a0 << 2)
			break;
		a2 = dwArg74;
		s3 = *((word32) a4_116 + s8_125);
		if (a5_103 <= (struct Eq_69423 *) 64)
		{
			while (true)
			{
				struct Eq_69416 * s0_64 = *((word32) a0_112 + 40);
				if (s1 == 0x00)
					break;
				if (a0_112 != 0x00 || s1 <= 63)
				{
					Eq_2 s11_70 = 64 - a0_112;
					if (s1 < s11_70)
						s11_70 = s1;
					a0_112 = (word32) a0_112 + ((word32) a4 + 44);
					struct Eq_70014 * a5_85;
					word32 a1_611;
					word32 a3_612;
					word32 a6_613;
					word32 a7_614;
					memcpy(a0_112, s3, s11_70, out a1_611, out a2, out a3_612, out a4_116, out a5_85, out a6_613, out a7_614);
					struct Eq_69416 * s0_99 = a5_85->ptr0028;
					a5_103 = a5_85 + s11_70;
					a5_103->dw0028 = s0_99;
					s3 += s11_70;
					s1 -= s11_70;
					if (a5_103 != (struct Eq_69423 *) 64)
						continue;
					sha256_compress(s0_99, (word32) a4 + 44, s4_108, out s1, out a0_112, out a2, out a4_116, out a5_103, out s2_122, out s3, out s4_108, out s8_125);
					if (a0_112 < 0x00)
						break;
					struct Eq_70054 * s0_133 = a2->dw0004;
					s0_133->dw0028 = 0x00;
					Mem138[a5_103 + 0x0200:word32] = s0_133;
					a5_103 = CONVERT(a5_103 + 0x0200 <u a5_103, bool, word32) + a2;
					a5_103->dw0004 = s0_133;
					continue;
				}
				sha256_compress(s0_64, s3, s4_108, out s1, out a0_112, out a2, out a4_116, out a5_103, out s2_122, out s3, out s4_108, out s8_125);
				if (a0_112 < 0x00)
					break;
				word32 s0_164 = a2->dw0004;
				Mem169[a5_103 + 0x0200:word32] = s0_164;
				a5_103 = CONVERT(a5_103 + 0x0200 <u a5_103, bool, word32) + a2;
				a5_103->dw0004 = s0_164;
				s3 = (word32) s3 + 64;
				s1 = (word32) s1 - 64;
			}
		}
		s8_125 += 0x04;
	}
	if (a5_103 <= (struct Eq_69423 *) 63)
	{
		struct Eq_69768 * a3_183 = a5_103 << 0x03;
		int32 s0_182 = a2->dw0004;
		(a2 + (word32) (a3_183 < null) / 64)->dw0004 = s0_182;
		a3_183->dw003F = s0_182;
		struct Eq_69785 * a4_188 = (char *) &a5_103->ptr0000 + 1;
		a4_188->dw0028 = s0_182;
		(a5_103 + s0_182 / 64)->b002C = 0x80;
		struct Eq_69796 * a5_194 = (struct Eq_69796 *) 56;
		if (a4_188 > (struct Eq_69785 *) 56)
		{
			while (true)
			{
				struct Eq_69416 * s0_198 = a5_194->ptr0028;
				if (a5_194 > (struct Eq_69796 *) 63)
					break;
				a5_194->ptr0029 = s0_198;
				a5_194 += s0_198;
				a5_194->b002C = 0x00;
			}
			word32 a2_599;
			word32 s1_597;
			word32 a4_600;
			word32 s2_601;
			word32 s3_602;
			word32 a0_598;
			word32 s8_603;
			sha256_compress(s0_198, (char *) s0_198 + 44, s4_108, out s1_597, out a0_598, out a2_599, out a4_600, out a5_194, out s2_601, out s3_602, out s4_108, out s8_603)->dw0028 = 0x00;
		}
		while (true)
		{
			struct Eq_69416 * s0_234 = a5_194->ptr0028;
			if (a5_194 > (struct Eq_69796 *) 55)
				break;
			a5_194->ptr0029 = s0_234;
			a5_194 += s0_234;
			a5_194->b002C = 0x00;
		}
		struct Eq_69416 * s0_240 = a5_194->ptr0000;
		s0_240->b0068 = (byte) (a5_194 >> 0x18);
		s0_240->b0069 = (byte) (a5_194 >> 0x10);
		s0_240->b006B = (byte) a5_194;
		struct Eq_69918 * s0_249 = a5_194->ptr0004;
		s0_249->b006A = (byte) (a5_194 >> 0x08);
		s0_249->b0064 = (byte) (a5_194 >> 0x18);
		s0_249->b0065 = (byte) (a5_194 >> 0x10);
		s0_249->b0067 = (byte) a5_194;
		s0_249->b0066 = (byte) (a5_194 >> 0x08);
		word32 s8_610;
		word32 a0_605;
		word32 a2_606;
		word32 a4_607;
		word32 s1_604;
		word32 a5_608;
		word32 s4_609;
		struct Eq_69830 * s0_269 = sha256_compress(s0_240, (char *) s0_240 + 44, s4_108, out s1_604, out a0_605, out a2_606, out a4_607, out a5_608, out s2_122, out s3, out s4_609, out s8_610);
		struct Eq_69971 * a5_281 = (char *) s0_269 + 8;
		do
		{
			++a5_281;
			Eq_69976 a4_286 = a5_281->dwFFFFFFFC;
			++s2_122;
			s2_122[0x03FF] = (struct Eq_69734) (byte) (a4_286 >> 0x18);
			s2_122->b0FFD = (byte) (a4_286 >> 0x10);
			s2_122->b0FFE = (byte) (a4_286 >> 0x08);
			s2_122->b0FFF = (byte) a4_286;
		} while (a5_281 != &s0_269->dw0028);
	}
	0x00 = dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a6Out = dwArg0188;
	s2Out = s2_122;
	s3Out = s3;
	s4Out = dwArg0168;
	s6Out.u0 = 64;
	s7Out = (word32) a4 + 44;
	return dwLoc08;
}

// 2301876A: Register word32 hmac_sha256_vector(Register Eq_2 ra, Register Eq_2 a0, Register Eq_66844 a1, Register ui32 a2, Register ptr32 a3, Register (ptr32 (arr (ptr32 ptr32))) a4, Register Eq_2 a5, Register out ptr32 s7Out)
// Called from:
//      bl_sha256_crypto_kdf
word32 hmac_sha256_vector(Eq_2 ra, Eq_2 a0, Eq_66844 a1, ui32 a2, ptr32 a3, ptr32 * (* a4)[], Eq_2 a5, ptr32 & s7Out)
{
	Eq_2 s1_145 = a5;
	Eq_2 dwLoc01DC_285 = a0;
	ui32 s2_121 = a2;
	ptr32 s3_274 = a3;
	ptr32 * s4_276[] = a4;
	if (a1 > 64)
	{
		Eq_2 s0_48;
		word32 s7_360;
		word32 a6_358;
		word32 s6_359;
		ra = sha256_vector(a5, 0x01, fp + -600, fp + -436, dwLoc01EC, dwLoc0154, out s0_48, out s1_145, out a6_358, out s2_121, out s3_274, out s4_276, out s6_359, out s7_360);
		dwLoc01DC_285 = s0_48;
	}
	Eq_2 a1_76;
	word32 a3_348;
	word32 a4_349;
	word32 a5_350;
	word32 t1_345;
	word32 a0_346;
	word32 a2_347;
	memset(ra, fp + -532, 0x00, 64, out t1_345, out a0_346, out a1_76, out a2_347, out a3_348, out a4_349, out a5_350);
	word32 a6_356;
	word32 a7_357;
	word32 a2_352;
	word32 a3_353;
	word32 a4_354;
	word32 a5_355;
	word32 a1_351;
	memcpy(fp + -532, a1_76, dwLoc01FC, out a1_351, out a2_352, out a3_353, out a4_354, out a5_355, out a6_356, out a7_357);
	Eq_2 a4_102 = fp + -532;
	do
	{
		a4_102 = (word32) a4_102 + 4;
		*((word32) a4_102 + 0x0FFC) = *((word32) a4_102 - 4) ^ 0x36363636;
	} while (a4_102 != dwLoc01DC_285);
	ptr32 a2_115 = fp + -0x0244;
	ptr32 a3_117 = fp + -556;
	int32 a4_119 = 0x00;
	int32 a5_122 = s2_121 << 0x02;
	while (true)
	{
		a2_115 += 0x04;
		a3_117 += 0x04;
		if (a4_119 == a5_122)
			break;
		*(s3_274 + a4_119) = a2_115;
		*s4_276[a4_119 / 4] = a3_117;
		a4_119 += 0x04;
	}
	Eq_2 s1_163;
	struct Eq_69727 * s6_170;
	Eq_2 a1_185;
	word32 a5_372;
	word32 a0_368;
	word32 a2_369;
	word32 a3_370;
	word32 a4_371;
	word32 s3_364;
	word32 s4_365;
	word32 s7_366;
	word32 t1_367;
	word32 s0_361;
	word32 a6_362;
	word32 s2_363;
	memset(sha256_vector(s1_145, s2_121 + 1, fp + -556, fp + -436, dwLoc01EC, dwLoc0154, out s0_361, out s1_163, out a6_362, out s2_363, out s3_364, out s4_365, out s6_170, out s7_366), fp + -532, 0x00, 64, out t1_367, out a0_368, out a1_185, out a2_369, out a3_370, out a4_371, out a5_372);
	word32 a6_378;
	word32 a7_379;
	word32 a5_377;
	word32 a4_376;
	word32 a1_373;
	word32 a2_374;
	word32 a3_375;
	memcpy(fp + -532, a1_185, dwLoc01FC, out a1_373, out a2_374, out a3_375, out a4_376, out a5_377, out a6_378, out a7_379);
	Eq_2 a4_210 = fp + -532;
	do
	{
		a4_210 = (word32) a4_210 + 4;
		*((word32) a4_210 + 0x0FFC) = *((word32) a4_210 - 4) ^ 0x5C5C5C5C;
	} while (a4_210 != dwLoc01DC_285);
	word32 s6_385;
	word32 a6_242;
	ptr32 s7_254;
	word32 s2_382;
	word32 s3_383;
	word32 s4_384;
	word32 s0_380;
	word32 s1_381;
	sha256_vector(s1_163, 0x02, s6_170, fp + -436, dwLoc01EC, dwLoc0154, out s0_380, out s1_381, out a6_242, out s2_382, out s3_383, out s4_384, out s6_385, out s7_254);
	s7Out = s7_254;
	return a6_242;
}

