pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23018E28: Register Eq_2 InitStaKeyInfo(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg74, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_57948) s0Out, Register out ptr32 s1Out, Register out ptr32 s4Out)
// Called from:
//      apm_assoc_req_handler
Eq_2 InitStaKeyInfo(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg74, Eq_2 dwArg0128, struct Eq_57948 & s0Out, ptr32 & s1Out, ptr32 & s4Out)
{
	word32 a4_88;
	word32 a5_89;
	Eq_2 a0_23 = cm_GetApData(a0, out a4_88, out a5_89);
	word32 t1_90;
	word32 a0_91;
	word32 a1_92;
	word32 a2_93;
	word32 a3_94;
	word32 a4_95;
	word32 a5_96;
	Eq_2 ra_37 = memset(ra, (word32) a0_23 + 16, 0x00, 72, out t1_90, out a0_91, out a1_92, out a2_93, out a3_94, out a4_95, out a5_96);
	ptr32 s1_54;
	ptr32 s4_56;
	InitKeyMgmtInfo((word32) a0_23 + 16, a1, a2, dwArg74, out s1_54, out s4_56)->b0054 = 0x01;
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_54;
	s4Out = s4_56;
	return ra_37;
}

// 23018E70: Register word32 RemoveAPKeyInfo(Register Eq_2 a0, Stack Eq_2 dwArg0118, Register out ptr32 s2Out)
// Called from:
//      apm_stop_req_handler
word32 RemoveAPKeyInfo(Eq_2 a0, Eq_2 dwArg0118, ptr32 & s2Out)
{
	struct Eq_20265 * a0_5 = (word32) *((word32) a0 + 3);
	if (a0_5 == (struct Eq_20265 *) 0x00FF)
	{
		s2Out = s2;
		return a2;
	}
	else
	{
		word32 a2_9;
		ptr32 s2_16;
		word32 a4_62;
		word32 s3_63;
		word32 s6_64;
		mm_sec_machwkey_del(a0_5, dwArg0118, out a2_9, out a4_62, out s2_16, out s3_63, out s6_64);
		s2Out = s2_16;
		return a2_9;
	}
}

// 23018E82: Register Eq_2 InitGroupKey(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg01A4, Register out ptr32 a4Out, Register out Eq_71609 s2Out, Register out ptr32 s4Out)
// Called from:
//      apm_start_req_handler
Eq_2 InitGroupKey(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg01A4, ptr32 & a4Out, union Eq_71609 & s2Out, ptr32 & s4Out)
{
	word32 a5_180;
	word32 a4_179;
	struct Eq_62008 * a0_12 = cm_GetApInfo(a0, out a4_179, out a5_180);
	a0_12->dw0114 = 0x00;
	a0_12->dw0118 = 0x00;
	struct Eq_71626 * a5_25;
	Eq_2 s1_30;
	Eq_2 ra_28 = KeyMgmtInit(ra, a0, mstatus, dwArg08, dwArg48, dwArg88, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0148, out s1_30, out a5_25);
	struct Eq_71634 * s0_48 = a5_25->ptr0014;
	if (a5_25 != null)
	{
		word32 a5_189;
		word32 a4_188;
		word32 a3_187;
		word32 a1_186;
		Eq_2 a0_60 = __udivdi3((char *) &a5_25->ptr0014 + 0x1EFFF7B7, (word32) ((char *) &a5_25->ptr0014 + 0x1EFFF7B7 < (char *) (&a5_25->ptr0014) + 520091700) + ((word32) (a5_25 < (struct Eq_71626 *) 0x1EFFF848) + ~0x00), (word32) s0_48->w00A6 << 7, 0x00, out a1_186, out a3_187, out a4_188, out a5_189);
		s0_48->dw0114 = (word32) a0_60 + 1;
		s0_48->dw0118 = (word32) a0_60 + 1;
	}
	word32 a0_81;
	Eq_2 a3_84;
	struct Eq_71642 * s1_91;
	word32 s10_185;
	word32 s5_184;
	word32 s2_183;
	word32 a5_182;
	word32 a4_181;
	Eq_2 ra_89 = add_key_to_mac(ra_28, s1_30, s1_30, 0x00, dwArg20, dwArg24, dwArg6C, dwArgB8, dwArg0108, dwArg0118, dwArg01A4, out s1_91, out a0_81, out a3_84, out a4_181, out a5_182, out s2_183, out s5_184, out s10_185);
	s1_91->b0003 = (byte) a0_81;
	ptr32 a4_123;
	Eq_71609 s2_129;
	ptr32 s4_131;
	word32 a0_191;
	word32 s1_190;
	word32 a1_192;
	word32 a2_193;
	word32 a3_194;
	word32 a5_195;
	word32 a7_196;
	word32 s3_197;
	word32 s5_198;
	word32 s6_199;
	word32 s7_200;
	word32 s8_201;
	word32 s9_202;
	word32 s10_203;
	word32 s11_204;
	word32 t4_205;
	Eq_2 ra_125 = printf(ra_89, &g_t230ADA68, a3_84, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_190, out a0_191, out a1_192, out a2_193, out a3_194, out a4_123, out a5_195, out a7_196, out s2_129, out s3_197, out s4_131, out s5_198, out s6_199, out s7_200, out s8_201, out s9_202, out s10_203, out s11_204, out t4_205);
	a4Out = a4_123;
	s2Out = s2_129;
	s4Out = s4_131;
	return ra_125;
}

// 23018EF4: Register Eq_2 GenerateGTK_internal(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Stack word32 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 s4Out)
// Called from:
//      ROM_InitGTK
Eq_2 GenerateGTK_internal(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, word32 dwArg18, Eq_2 dwArg78, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & s4Out)
{
	word32 a1_282;
	word32 a2_283;
	word32 a3_284;
	word32 a4_285;
	word32 a5_286;
	word32 a6_287;
	word32 a7_288;
	memcpy(fp + -0x008C, 587913852, 0x14, out a1_282, out a2_283, out a3_284, out a4_285, out a5_286, out a6_287, out a7_288);
	ptr32 s1_152 = a1;
	Eq_2 s0_14 = a0;
	if (a0 != 0x00 && a1 != 0x00)
	{
		word32 a1_289;
		word32 a2_290;
		word32 a3_291;
		word32 a4_292;
		word32 a5_293;
		word32 a6_294;
		word32 a7_295;
		memcpy(fp + -56, a2, 0x06, out a1_289, out a2_290, out a3_291, out a4_292, out a5_293, out a6_294, out a7_295);
		Eq_2 s1_63;
		word32 s0_296;
		word32 a0_297;
		word32 a3_298;
		word32 a4_299;
		word32 s9_300;
		word32 s10_301;
		Eq_2 ra_61 = supplicantGenerateRand(ra, dwLoc80, dwLoc7C, dwLoc34, dwArg78, dwArgC8, dwArgE8, out s0_296, out s1_63, out a0_297, out a3_298, out a4_299, out s9_300, out s10_301);
		word32 a1_302;
		word32 a2_303;
		word32 a3_304;
		word32 a4_305;
		word32 a5_306;
		word32 a6_307;
		word32 a7_308;
		memcpy(fp + -50, s1_63, 32, out a1_302, out a2_303, out a3_304, out a4_305, out a5_306, out a6_307, out a7_308);
		word32 s0_309;
		word32 s1_310;
		word32 a0_311;
		word32 a3_312;
		word32 a4_313;
		word32 s9_314;
		word32 s10_315;
		word32 a1_316;
		word32 a2_317;
		word32 a3_318;
		word32 a4_319;
		word32 a5_320;
		ra = Bl_PRF(supplicantGenerateRand(ra_61, dwLoc80, dwLoc7C, dwLoc34, dwArg78, dwArgC8, dwArgE8, out s0_309, out s1_310, out a0_311, out a3_312, out a4_313, out s9_314, out s10_315), fp + -88, 32, fp + -0x008C, strlen(fp + -0x008C, out a1_316, out a2_317, out a3_318, out a4_319, out a5_320), fp + -56, 38, fp + -0x0078, 32, dwLoc5C, out s0_14, out s1_152, out s4);
		word32 a1_321;
		word32 a2_322;
		word32 a3_323;
		word32 a4_324;
		word32 a5_325;
		word32 a6_326;
		word32 a7_327;
		memcpy(s0_14, fp + -0x0078, 0x10, out a1_321, out a2_322, out a3_323, out a4_324, out a5_325, out a6_326, out a7_327);
		word32 a1_328;
		word32 a2_329;
		word32 a3_330;
		word32 a4_331;
		word32 a5_332;
		word32 a6_333;
		word32 a7_334;
		memcpy((word32) s0_14 + 24, fp + -0x0068, 0x08, out a1_328, out a2_329, out a3_330, out a4_331, out a5_332, out a6_333, out a7_334);
		word32 a1_335;
		word32 a2_336;
		word32 a3_337;
		word32 a4_338;
		word32 a5_339;
		word32 a6_340;
		word32 a7_341;
		memcpy((word32) s0_14 + 16, fp + -96, 0x08, out a1_335, out a2_336, out a3_337, out a4_338, out a5_339, out a6_340, out a7_341);
	}
	s0Out = s0_14;
	s1Out = s1_152;
	s4Out = s4;
	return ra;
}

// 23018F94: Register (ptr32 Eq_62008) PopulateKeyMsg(Register (ptr32 Eq_62008) a0, Register (ptr32 byte) a1, Register uint32 a2, Register (ptr32 Eq_70656) a3, Register Eq_2 a4, Register out Eq_2 a4Out)
// Called from:
//      GeneratePWKMsg1
//      GeneratePWKMsg3
struct Eq_62008 * PopulateKeyMsg(struct Eq_62008 * a0, byte * a1, uint32 a2, struct Eq_70656 * a3, Eq_2 a4, union Eq_2 & a4Out)
{
	if (a0 == null || a1 == null)
	{
		a4Out = a4;
		return a0;
	}
	int32 a5_10;
	ui32 a5_6 = (word32) *a1;
	if ((a5_6 & 4) != 0x00)
	{
		a0->b0015 = 0x00;
		a5_10 = 32;
	}
	else
	{
		if ((a5_6 & 0x08) == 0x00)
			goto l23018FB2;
		a0->b0015 = 0x00;
		a5_10 = 0x10;
	}
	a0->b0016 = (byte) a5_10;
l23018FB2:
	ui32 a5_29;
	ui32 a2_27;
	ui32 a1_18 = (word32) a0->b0014;
	a0->b0014 = (byte) (a1_18 | -0x0080);
	if (a2 << 0x14 < 0x00)
	{
		a0->b0014 = (byte) (a1_18 | -0x0078);
		if ((a2 & 0x0080) == 0x00)
			goto l23018FF8;
		ui32 a5_33 = (word32) a0->b0013;
		a0->b0014 = (byte) (a1_18 | -56);
		a5_29 = (a5_33 | 1) & 0x00ED | (a2 >> 0x0F) << 0x01;
		a2_27 = a2 >> 0x0F << 4;
	}
	else
	{
		a2_27 = a2 >> 0x0F << 4;
		a5_29 = (word32) a0->b0013 & 0x00EC | 3;
	}
	a0->b0013 = (byte) (a2_27 | a5_29);
l23018FF8:
	Eq_71999 a6_53 = a3->t0000;
	uint32 a2_67 = (a6_53 << 0x18) + (a6_53 >> 0x18) + (a6_53 << 0x08 & 0x00FF0000) + (a6_53 >> 0x08 & 0x0FFFFF00);
	a0->b1017 = (byte) a2_67;
	a0->b1018 = (byte) (a2_67 >> 0x08);
	a0->b1019 = (byte) (a2_67 >> 0x10);
	a0->b101A = (byte) (a2_67 >> 24);
	uint32 a3_75 = a3->dw0004;
	uint32 a5_84 = (a3_75 << 0x18) + (a3_75 >> 0x18) + (a3_75 << 0x08 & 0x00FF0000) + (a3_75 >> 8 & 0x0FFFFF00);
	a0->b101B = (byte) a5_84;
	a0->b101C = (byte) (a5_84 >> 0x08);
	a0->b101D = (byte) (a5_84 >> 0x10);
	a0->b101E = (byte) (a5_84 >> 24);
	Eq_2 a4_99;
	word32 a7_161;
	word32 a6_160;
	word32 a5_159;
	word32 a3_158;
	word32 a2_157;
	word32 a1_156;
	memcpy(&a0->b0016 + 9, a4, 32, out a1_156, out a2_157, out a3_158, out a4_99, out a5_159, out a6_160, out a7_161);
	a4Out = a4_99;
	return &a0->b0016 + 9;
}

// 230190A0: Register Eq_2 prepareKDE(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 byte) a2, Register out Eq_2 s0Out, Register out (ptr32 Eq_70981) s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out (ptr32 byte) s3Out)
// Called from:
//      GeneratePWKMsg3
Eq_2 prepareKDE(Eq_2 ra, Eq_2 a0, Eq_2 a1, byte * a2, union Eq_2 & s0Out, struct Eq_70981 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, byte & s3Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0;
		a3Out = a3;
		s3Out = s3;
		return ra;
	}
	else
	{
		Eq_2 s0_110 = a1;
		if (a1 != 0x00 && a2 != null)
		{
			s1 = (word32) a0 + 113 + (word32) (*((word32) a0 + 111));
			s1->b0000 = ~0x22;
			s1->b0001 = 22;
			s1->b0002 = (byte) (word32) g_b230CB898;
			word32 a5_32 = (word32) g_b230CB89A;
			s1->b0003 = (byte) (word32) g_b230CB899;
			s1->b0004 = (byte) a5_32;
			s1->b0005 = 0x01;
			s1->b0006 = (byte) ((word32) s1->b0006 & ~0x03 | 1);
			word32 a1_232;
			word32 a2_233;
			word32 a4_234;
			word32 a5_235;
			word32 a6_236;
			word32 a7_237;
			memcpy(&s1->b0006 + 2, a1, 0x10, out a1_232, out a2_233, out a3, out a4_234, out a5_235, out a6_236, out a7_237);
			s3 = a2;
			a0 = &s1->b0006 + 18;
			if (((word32) *a2 & 0x04) != 0x00)
			{
				s1->b0001 = (byte) ((word32) s1->b0001 + 0x10);
				word32 a1_238;
				word32 a2_239;
				word32 a3_240;
				word32 a4_241;
				word32 a5_242;
				word32 a6_243;
				word32 a7_244;
				memcpy(&s1->b0006 + 18, (word32) a1 + 24, 0x08, out a1_238, out a2_239, out a3_240, out a4_241, out a5_242, out a6_243, out a7_244);
				word32 a1_245;
				word32 a2_246;
				word32 a4_247;
				word32 a5_248;
				word32 a6_249;
				word32 a7_250;
				memcpy(&s1->b0006 + 26, (word32) a1 + 16, 0x08, out a1_245, out a2_246, out a3, out a4_247, out a5_248, out a6_249, out a7_250);
				a0 = &s1->b0006 + 0x0022;
			}
			uint32 s0_105 = (word32) (word16) (((word32) *((word32) a0 + 112) << 8 | (word32) (*((word32) a0 + 111))) + 0x02 + (word32) s1->b0001);
			*((word32) a0 + 111) = (byte) s0_105;
			*((word32) a0 + 112) = (byte) (s0_105 >> 0x08);
			ui32 s0_108 = 0x00 - s0_105;
			s0_110 = s0_108 & 0x07;
			if ((s0_108 & 0x07) != 0x00)
			{
				*a0 = ~0x22;
				word32 t1_251;
				word32 a1_252;
				word32 a2_253;
				word32 a4_254;
				word32 a5_255;
				ra = memset(ra, (word32) a0 + 1, 0x00, (s0_108 & 0x07) + -1, out t1_251, out a0, out a1_252, out a2_253, out a3, out a4_254, out a5_255);
				uint32 s0_133 = (word32) (word16) ((s0_108 & 0x07) + ((word32) (*((word32) a0 + 112)) << 8 | (word32) (*((word32) a0 + 111))));
				*((word32) a0 + 111) = (byte) s0_133;
				*((word32) a0 + 112) = (byte) (s0_133 >> 8);
				s0_110 = s0_133 >> 8;
			}
		}
		s0Out = s0_110;
		s1Out = s1;
		a0Out = a0;
		a3Out = a3;
		s3Out = s3;
		return ra;
	}
}

// 230191AE: Register Eq_2 Encrypt_keyData(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_70968 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      GeneratePWKMsg3
Eq_2 Encrypt_keyData(Eq_2 ra, Eq_2 s1, word32 a0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_70968 & a0Out, union Eq_2 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s5Out, ptr32 & s10Out)
{
	if (a0 == 0x00 || (a1 == 0x00 || a2 == 0x00))
	{
		a0Out.u0 = 0x00;
		a2Out = a2;
		a4Out = a4;
		a5Out = a5;
		s5Out = s5;
		s10Out = s10;
		return ra;
	}
	Eq_2 a5_7 = (word32) *a2;
	if ((a5_7 & 8) == 0x00)
	{
		a0Out = a5_7 >> 0x02 & 0x01;
		a2Out = a2;
		a4Out = a5_7 & 8;
		a5Out = a5_7;
		s5Out = s5;
		s10Out = s10;
		return ra;
	}
	Eq_70968 a0_168;
	Eq_2 a0_27;
	Eq_2 a3_30;
	word32 s8_340;
	word32 s4_339;
	word32 s3_338;
	word32 s2_337;
	word32 a6_336;
	word32 a2_335;
	word32 a1_334;
	word32 s1_333;
	Eq_2 a4_158;
	Eq_2 a5_159;
	pvPortMalloc(ra, s1, 0x0C, a3, a5_7 & 8, a5_7, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_333, out a0_27, out a1_334, out a2_335, out a3_30, out a4_158, out a5_159, out a6_336, out s2_337, out s3_338, out s4_339, out s8_340);
	if (a0_27 != 0x00)
	{
		struct Eq_65767 * a0_44;
		word32 s1_52;
		Eq_2 s3_54;
		word32 s8_347;
		word32 s4_346;
		word32 s2_345;
		word32 a6_344;
		word32 a3_343;
		word32 a2_342;
		word32 a1_341;
		Eq_2 s0_51 = pvPortMalloc(ra, a0_27, 400, a3_30, a4_158, a5_159, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_52, out a0_44, out a1_341, out a2_342, out a3_343, out a4_158, out a5_159, out a6_344, out s2_345, out s3_54, out s4_346, out s8_347);
		a0_44->dw0008 = s1_52;
		if (a0_44 != null)
		{
			word32 a7_354;
			word32 a6_353;
			word32 a5_352;
			word32 a4_351;
			word32 a3_350;
			word32 a2_349;
			word32 a1_348;
			memcpy(fp + -48, s3_54, 0x10, out a1_348, out a2_349, out a3_350, out a4_351, out a5_352, out a6_353, out a7_354);
			struct Eq_72496 * s0_98;
			Eq_2 s2_101;
			Eq_2 s3_102;
			ra = BL_AesWrap(fp + -48, 0x02, ((word32) *((word32) s0_51 + 112) << 8 | (word32) (*((word32) s0_51 + 111))) >> 3, (word32) s0_51 + 113, null, a0_44, out s0_98, out s2_101, out s3_102, out s5, out s10);
			uint32 a2_123 = ((word32) s0_98->b0070 << 8 | (word32) s0_98->b006F) + 0x08 << 16;
			s0_98->b006F = (byte) (a2_123 >> 16);
			s0_98->b0070 = (byte) (a2_123 >> 0x18);
			Eq_2 a5_130;
			Eq_2 a2_133;
			word32 a7_359;
			word32 a6_358;
			word32 a4_357;
			word32 a3_356;
			word32 a1_355;
			memcpy(s3_102, s2_101, a2_123 >> 16, out a1_355, out a2_133, out a3_356, out a4_357, out a5_130, out a6_358, out a7_359);
			Eq_2 a2_143;
			Eq_2 a5_146;
			Eq_2 s1_147;
			word32 a6_365;
			word32 s4_366;
			word32 t3_367;
			word32 a4_364;
			word32 a3_363;
			word32 a1_362;
			word32 a0_361;
			word32 s0_360;
			vPortFree(s3_102, a2_133, a5_130, mstatus, dwArg0128, dwArg0168, out s0_360, out s1_147, out a0_361, out a1_362, out a2_143, out a3_363, out a4_364, out a5_146, out a6_365, out s4_366, out t3_367);
			word32 s0_368;
			word32 s1_369;
			word32 a0_370;
			word32 a1_371;
			word32 a2_372;
			word32 a3_373;
			word32 a6_374;
			word32 s4_375;
			word32 t3_376;
			vPortFree(s1_147, a2_143, a5_146, mstatus, dwArg0128, dwArg0168, out s0_368, out s1_369, out a0_370, out a1_371, out a2_372, out a3_373, out a4_158, out a5_159, out a6_374, out s4_375, out t3_376);
			a0_168.u0 = 0x01;
l230191B6:
			0x00 = (int8) dwArg0128;
			a0Out = a0_168;
			a2Out = dwArg0100;
			a4Out = a4_158;
			a5Out = a5_159;
			s5Out = s5;
			s10Out = s10;
			return ra;
		}
	}
	a0_168.u0 = 0x00;
	goto l230191B6;
}

// 23019262: void KeyMgmtAp_DerivePTK(Register Eq_2 ra, Register word32 a7)
// Called from:
//      ProcessPWKMsg2
void KeyMgmtAp_DerivePTK(Eq_2 ra, word32 a7)
{
	KeyMgmtSta_DeriveKeys(ra);
	word32 a1_94;
	word32 a2_95;
	word32 a3_96;
	word32 a4_97;
	word32 a5_98;
	word32 a6_99;
	word32 a7_100;
	memcpy(fp + -24, a7 + 16, 0x08, out a1_94, out a2_95, out a3_96, out a4_97, out a5_98, out a6_99, out a7_100);
	word32 a1_101;
	word32 a2_102;
	word32 a3_103;
	word32 a4_104;
	word32 a5_105;
	word32 a6_106;
	word32 a7_107;
	memcpy(a7 + 16, a7 + 0x18, 0x08, out a1_101, out a2_102, out a3_103, out a4_104, out a5_105, out a6_106, out a7_107);
	word32 a1_108;
	word32 a2_109;
	word32 a3_110;
	word32 a4_111;
	word32 a5_112;
	word32 a6_113;
	word32 a7_114;
	memcpy(a7 + 0x18, fp + -24, 0x08, out a1_108, out a2_109, out a3_110, out a4_111, out a5_112, out a6_113, out a7_114);
}

// 230192A2: Register (ptr32 Eq_70666) KeyData_CopyWPAWP2(Register (ptr32 Eq_70666) a0, Register Eq_2 a1, Register out ptr32 a5Out)
// Called from:
//      KeyData_UpdateKeyMaterial
struct Eq_70666 * KeyData_CopyWPAWP2(struct Eq_70666 * a0, Eq_2 a1, ptr32 & a5Out)
{
	if (a1 == 0x00)
	{
		a5Out = a5;
		return null;
	}
	else
	{
		word32 a2_6 = (word32) *((word32) a1 + 1);
		a0->b006F = (byte) (a2_6 + 0x02);
		a0->b0070 = (byte) (a2_6 + 0x02 >> 0x08);
		ptr32 a5_17;
		word32 a1_62;
		word32 a2_63;
		word32 a3_64;
		word32 a4_65;
		word32 a6_66;
		word32 a7_67;
		memcpy(&a0->b0070 + 1, a1, a2_6 + 0x02, out a1_62, out a2_63, out a3_64, out a4_65, out a5_17, out a6_66, out a7_67);
		a5Out = a5_17;
		return (struct Eq_70666 *) 0x01;
	}
}

// 230192CE: Register (ptr32 Eq_70666) KeyData_UpdateKeyMaterial(Register (ptr32 Eq_70666) a0, Register (ptr32 uint16) a1, Register Eq_2 a2, Register Eq_2 a3, Register out ptr32 a2Out, Register out (ptr32 Eq_70666) a4Out, Register out Eq_70864 a5Out)
// Called from:
//      GeneratePWKMsg3
struct Eq_70666 * KeyData_UpdateKeyMaterial(struct Eq_70666 * a0, uint16 * a1, Eq_2 a2, Eq_2 a3, ptr32 & a2Out, struct Eq_70666 & a4Out, union Eq_70864 & a5Out)
{
	struct Eq_70666 * a4_12;
	Eq_70864 a5_11;
	ui32 a5_7 = (word32) *a1;
	Eq_2 a1_14 = a2;
	if ((a5_7 & 24) == 0x00)
	{
		a5_11 = a5_7 & 32;
		a4_12 = (struct Eq_70666 *) 0x01;
		if ((a5_7 & 32) == 0x00)
		{
l230192F0:
			a2Out = dwArg10;
			a4Out = a4_12;
			a5Out = a5_11;
			return a4_12;
		}
		a1_14 = a3;
	}
	a4_12 = (word32) (KeyData_CopyWPAWP2(a0, a1_14, out a5_11) != 0x00);
	goto l230192F0;
}

// 230192F8: Register Eq_2 ROM_InitGTK(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Stack word32 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s4Out)
// Called from:
//      KeyMgmtInit
Eq_2 ROM_InitGTK(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, word32 dwArg18, Eq_2 dwArg78, Eq_2 dwArgC8, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s4Out)
{
	((word32) a0 + 32)->u0 = 0x00;
	*(union Eq_2 *) 0x10000025 = a0;
	ptr32 s0_19;
	ptr32 s1_20;
	ptr32 s4_32;
	Eq_2 ra_28 = GenerateGTK_internal(ra, a0, a1, a2, dwArg18, dwArg78, dwArgC8, dwArgE8, out s0_19, out s1_20, out s4_32);
	s0Out = s0_19;
	s1Out = s1_20;
	s4Out = s4_32;
	return ra_28;
}

// 23019306: Register Eq_2 InitKeyMgmtInfo(Register (ptr32 Eq_71549) a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArgA4, Register out Eq_2 s1Out, Register out ptr32 s4Out)
// Called from:
//      InitStaKeyInfo
Eq_2 InitKeyMgmtInfo(struct Eq_71549 * a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArgA4, union Eq_2 & s1Out, ptr32 & s4Out)
{
	a0->b0006 = 0x01;
	word32 a7_106;
	word32 a6_105;
	word32 a5_104;
	word32 a4_103;
	word32 a3_102;
	word32 a2_101;
	word32 a1_100;
	memcpy((char *) a0 + 2, a1, 0x02, out a1_100, out a2_101, out a3_102, out a4_103, out a5_104, out a6_105, out a7_106);
	word32 a4_42;
	word32 a3_47;
	word32 a5_109;
	word32 a6_110;
	word32 a7_111;
	word32 a2_108;
	word32 a1_107;
	memcpy((char *) a0 + 4, a2, 0x01, out a1_107, out a2_108, out a3_47, out a4_42, out a5_109, out a6_110, out a7_111);
	*((word32) dwArgA4 + 5) = (byte) a4_42;
	if (((word32) *a1 & 32) != 0x00)
		*dwArgA4 = (word16) a3_47;
	s1Out = a1;
	s4Out = dwArg04;
	return dwArgA4;
}

// 23019356: Register Eq_2 cm_GetApInfo(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      add_key_to_mac
//      KeyMgmtInit
//      PrepDefaultEapolMsg
//      GeneratePWKMsg3
//      ProcessPWKMsg2
//      InitGroupKey
//      ap_setpsk
//      InitializeAp
Eq_2 cm_GetApInfo(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	if (a0 != 0x00)
	{
		a4 = (word32) *a0;
		a5 = 0x02;
		if (a4 == 0x02)
		{
			Eq_2 a0_8 = *((byte) a0.u0 + 76);
			a4Out = a4;
			a5Out = 0x02;
			return a0_8;
		}
		a0.u0 = 0x00;
	}
	a4Out = a4;
	a5Out = a5;
	return a0;
}

// 2301936A: Register Eq_2 cm_GetApData(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      PrepDefaultEapolMsg
//      GeneratePWKMsg1
//      GeneratePWKMsg3
//      ProcessPWKMsg4
//      GenerateApEapolMsg
//      ProcessPWKMsg2
//      SendEAPOLMsgUsingBufDesc
//      ProcessKeyMgmtDataAp
//      InitStaKeyInfo
//      cm_AllocResources
//      cm_DeleteConnection
//      InitializeAp
Eq_2 cm_GetApData(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	if (a0 != 0x00)
	{
		a4 = (word32) *a0;
		a5 = 0x02;
		if (a4 == 0x02)
		{
			a4Out = a4;
			a5Out = 0x02;
			return (byte) a0.u0 + 76;
		}
		a0.u0 = 0x00;
	}
	a4Out = a4;
	a5Out = a5;
	return a0;
}

