pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23019380: Register Eq_2 cm_AllocAPResources(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 s2Out)
// Called from:
//      cm_AllocResources
Eq_2 cm_AllocAPResources(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & s2Out)
{
	ptr32 a0_38;
	Eq_2 a4_15;
	Eq_2 a5_16;
	cm_GetApData(a0, out a4_15, out a5_16);
	Eq_2 s2_104 = a0;
	Eq_2 a0_17 = *((word32) a5_16 + 4);
	if (a5_16 == 0x00)
	{
		word32 a0_22;
		Eq_2 a3_25;
		Eq_2 a4_26;
		Eq_2 a5_27;
		word32 a1_121;
		word32 a2_122;
		word32 a6_123;
		word32 s3_124;
		word32 s4_125;
		word32 s8_126;
		pvPortMalloc(ra, a0_17, 0x0C, a3, a4_15, a5_16, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1, out a0_22, out a1_121, out a2_122, out a3_25, out a4_26, out a5_27, out a6_123, out s2_104, out s3_124, out s4_125, out s8_126);
		a0_38 = 0x01;
		if (a0_22 == 0x00)
			goto l230193BA;
		struct Eq_72929 * a0_40;
		union Eq_2 * a5_45;
		word32 a1_127;
		word32 a2_128;
		word32 a3_129;
		word32 a4_130;
		word32 a6_131;
		word32 s3_132;
		word32 s4_133;
		word32 s8_134;
		Eq_2 s0_47 = pvPortMalloc(ra, s1, 288, a3_25, a4_26, a5_27, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1, out a0_40, out a1_127, out a2_128, out a3_129, out a4_130, out a5_45, out a6_131, out s2_104, out s3_132, out s4_133, out s8_134);
		a0_40->t0008 = s0_47;
		*((word32) s0_47 + 4) = s1;
		*a5_45 = (union Eq_2 *) s1;
		InitializeAp(ra, a0);
	}
	a0_38 = 0x00;
l230193BA:
	0x00 = (int8) dwArg38;
	a0Out = a0_38;
	a2Out = dwArg10;
	s2Out = s2_104;
	return s1;
}

// 230193C6: Register word32 cm_AllocResources(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 s2Out)
// Called from:
//      cm_InitConnection
word32 cm_AllocResources(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a2Out, ptr32 & s2Out)
{
	if ((word32) *a0 != 0x02)
	{
		a0Out = 0x00;
		a2Out = a2;
		s2Out = s2;
		return s1;
	}
	else
	{
		ptr32 a0_11;
		ptr32 a2_12;
		ptr32 s2_15;
		word32 s1_20 = cm_AllocAPResources(ra, a0, a3, mstatus, dwArg30, dwArg34, dwArg38, dwArg7C, dwArg0128, dwArg0168, out a0_11, out a2_12, out s2_15);
		a0Out = a0_11;
		a2Out = a2_12;
		s2Out = s2_15;
		return s1_20;
	}
}

// 230193D8: Register Eq_2 cm_InitConnection(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 s2Out)
// Called from:
//      apm_start_req_handler
Eq_2 cm_InitConnection(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg5C, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & s2Out)
{
	Eq_2 a0_23;
	word32 s3_33;
	word32 a1_232;
	word32 a2_233;
	word32 a3_234;
	word32 a4_235;
	word32 a5_236;
	word32 a6_237;
	word32 s4_238;
	word32 s8_239;
	Eq_2 s1_149;
	Eq_2 s2_210;
	pvPortMalloc(ra, a3, 0x00EC, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_149, out a0_23, out a1_232, out a2_233, out a3_234, out a4_235, out a5_236, out a6_237, out s2_210, out s3_33, out s4_238, out s8_239);
	Eq_2 s0_157 = a0_23;
	if (a0_23 != 0x00)
	{
		Eq_2 a3_44;
		word32 t1_240;
		word32 a0_241;
		word32 a1_242;
		word32 a2_243;
		word32 a4_244;
		word32 a5_245;
		ra = memset(ra, a0_23, 0x00, 0x00EC, out t1_240, out a0_241, out a1_242, out a2_243, out a3_44, out a4_244, out a5_245);
		*a0_23 = (byte) s3_33;
		word32 a0_52;
		Eq_2 a2_56;
		s1_149 = cm_AllocResources(ra, a0_23, a3_44, mstatus, dwArg10, dwArg14, dwArg18, dwArg5C, dwArg0108, dwArg0148, out a0_52, out a2_56, out s2_210);
		if (a0_52 == 0x01)
		{
			word32 s0_246;
			word32 a0_247;
			word32 a1_248;
			word32 a2_249;
			word32 a3_250;
			word32 a4_251;
			word32 a5_252;
			word32 a6_253;
			word32 s4_254;
			word32 t3_255;
			vPortFree(a0_23, a2_56, 0x01, mstatus, dwArg0138, dwArg0178, out s0_246, out s1_149, out a0_247, out a1_248, out a2_249, out a3_250, out a4_251, out a5_252, out a6_253, out s4_254, out t3_255);
			s0_157.u0 = 0x00;
		}
		else
		{
			if (s2_210 != 0x00)
			{
				word32 a1_270;
				word32 a2_271;
				word32 a3_272;
				word32 a4_273;
				word32 a5_274;
				word32 a6_275;
				word32 a7_276;
				memcpy((word32) a0_23 + 64, s2_210, 0x06, out a1_270, out a2_271, out a3_272, out a4_273, out a5_274, out a6_275, out a7_276);
			}
			word32 t1_256;
			word32 a0_257;
			word32 a1_258;
			word32 a2_259;
			word32 a3_260;
			word32 a4_261;
			word32 a5_262;
			word32 t1_263;
			word32 a0_264;
			word32 a1_265;
			word32 a2_266;
			word32 a3_267;
			word32 a4_268;
			word32 a5_269;
			ra = memset(memset(ra, (word32) a0_23 + 48, 0x00, 0x06, out t1_256, out a0_257, out a1_258, out a2_259, out a3_260, out a4_261, out a5_262), (word32) a0_23 + 0x0C, 0x00, 32, out t1_263, out a0_264, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269);
			((word32) a0_23 + 44)->u0 = 0x00;
			s2_210 = (word32) a0_23 + 48;
			if (s1_149 != 0x00)
			{
				word32 a1_277;
				word32 a2_278;
				word32 a3_279;
				word32 a4_280;
				word32 a5_281;
				word32 a6_282;
				word32 a7_283;
				memcpy((word32) a0_23 + 48, s1_149, 0x06, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a6_282, out a7_283);
				word32 a1_284;
				word32 a2_285;
				word32 a3_286;
				word32 a4_287;
				word32 a5_288;
				word32 a6_289;
				word32 a7_290;
				memcpy((word32) a0_23 + 70, s1_149, 0x06, out a1_284, out a2_285, out a3_286, out a4_287, out a5_288, out a6_289, out a7_290);
			}
		}
	}
	s0Out = s0_157;
	s1Out = s1_149;
	a0Out = s0_157;
	s2Out = s2_210;
	return ra;
}

// 23019472: Register word32 cm_DeleteConnection(Register Eq_2 a0, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198, Register out ptr32 a4Out)
// Called from:
//      apm_stop_req_handler
word32 cm_DeleteConnection(Eq_2 a0, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0188, Eq_2 dwArg0198, ptr32 & a4Out)
{
	Eq_2 a5_12 = 0x02;
	Eq_2 s1_13 = a0;
	if ((word32) *a0 == 0x02)
	{
		word32 a4_86;
		cm_GetApData(a0, out a4_86, out a5_12);
		Eq_2 a0_17 = *((word32) a5_12 + 4);
		if (a5_12 != 0x00)
		{
			Eq_2 a2_22;
			Eq_2 a5_25;
			Eq_2 a0_28;
			word32 a1_89;
			word32 s1_88;
			word32 s0_87;
			word32 a3_90;
			word32 a4_91;
			word32 a6_92;
			word32 s4_93;
			word32 t3_94;
			vPortFree(a0_17, a2, *((word32) a0_17 + 8), mstatus, dwArg0148, dwArg0188, out s0_87, out s1_88, out a0_28, out a1_89, out a2_22, out a3_90, out a4_91, out a5_25, out a6_92, out s4_93, out t3_94);
			struct Eq_73275 * s0_44;
			word32 a0_95;
			word32 a1_96;
			word32 a2_97;
			word32 a3_98;
			word32 a4_99;
			word32 a6_100;
			word32 s4_101;
			word32 t3_102;
			vPortFree(a0_28, a2_22, a5_25, mstatus, dwArg0148, dwArg0188, out s0_44, out s1_13, out a0_95, out a1_96, out a2_97, out a3_98, out a4_99, out a5_12, out a6_100, out s4_101, out t3_102);
			s0_44->dw0004 = 0x00;
			s0_44->dw0000 = 0x00;
		}
	}
	ptr32 a4_61;
	word32 s0_68;
	word32 s1_103;
	word32 a0_104;
	word32 a1_105;
	word32 a2_106;
	word32 a3_107;
	word32 a5_108;
	word32 a6_109;
	word32 s4_110;
	word32 t3_111;
	vPortFree(s1_13, dwArg10, a5_12, mstatus, dwArg0158, dwArg0198, out s0_68, out s1_103, out a0_104, out a1_105, out a2_106, out a3_107, out a4_61, out a5_108, out a6_109, out s4_110, out t3_111);
	a4Out = a4_61;
	return s0_68;
}

// 230194B2: void cm_SetPeerAddr(Register int32 a0, Register Eq_2 a1, Register Eq_2 a2)
// Called from:
//      apm_assoc_req_handler
void cm_SetPeerAddr(int32 a0, Eq_2 a1, Eq_2 a2)
{
	if (a1 != 0x00)
	{
		word32 a1_108;
		word32 a2_109;
		word32 a3_110;
		word32 a4_111;
		word32 a5_112;
		word32 a6_113;
		word32 a7_114;
		memcpy(a0 + 48, a1, 0x06, out a1_108, out a2_109, out a3_110, out a4_111, out a5_112, out a6_113, out a7_114);
	}
	if (a2 == 0x00)
		return;
	word32 a1_115;
	word32 a2_116;
	word32 a3_117;
	word32 a4_118;
	word32 a5_119;
	word32 a6_120;
	word32 a7_121;
	memcpy(a0 + 64, a2, 0x06, out a1_115, out a2_116, out a3_117, out a4_118, out a5_119, out a6_120, out a7_121);
}

// 230194EA: Register (ptr32 Eq_73371) cm_SetComData(Register (ptr32 Eq_73371) a0, Register Eq_2 a1, Register out ptr32 a3Out)
// Called from:
//      apm_start_req_handler
struct Eq_73371 * cm_SetComData(struct Eq_73371 * a0, Eq_2 a1, ptr32 & a3Out)
{
	if (a1 == 0x00)
	{
		a3Out = a3;
		return s0;
	}
	else
	{
		Eq_2 a1_17;
		word32 a5_101;
		word32 a4_100;
		word32 a3_99;
		word32 a2_98;
		a0->b002C = (byte) strlen(a1, out a1_17, out a2_98, out a3_99, out a4_100, out a5_101);
		ptr32 a3_28;
		word32 a7_107;
		word32 a6_106;
		word32 a5_105;
		word32 a4_104;
		word32 a2_103;
		word32 a1_102;
		memcpy(&a0->b000C, a1_17, 32, out a1_102, out a2_103, out a3_28, out a4_104, out a5_105, out a6_106, out a7_107);
		struct Eq_73371 * s0_38 = a0;
		Eq_73414 a0_36 = (word32) a0->b002C;
		if (a0_36 <= 0x1F)
		{
			s0_38 = a0 + a0_36;
			s0_38->b000C = 0x00;
		}
		a3Out = a3_28;
		return s0_38;
	}
}

// 23019528: Register Eq_2 rf_set_channel(Register Eq_2 ra, Register Eq_7726 a1, Register word32 s2, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 s1Out, Register out ptr32 s4Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      phy_hw_set_channel
Eq_2 rf_set_channel(Eq_2 ra, Eq_7726 a1, word32 s2, ptr32 fflags, ptr32 frm, ptr32 & s1Out, ptr32 & s4Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	ptr32 fflags_17;
	ptr32 frm_18;
	ptr32 s1_21;
	ptr32 s4_24;
	Eq_2 ra_19 = rfc_config_channel(ra, a1, s2, fflags, frm, out s1_21, out s4_24, out fflags_17, out frm_18);
	s1Out = s1_21;
	s4Out = s4_24;
	fflagsOut = fflags_17;
	frmOut = frm_18;
	return ra_19;
}

