pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301952E: void rf_dump_status()
// Called from:
//      me_tx_cfm_singleton
void rf_dump_status()
{
}

// 23019530: Register Eq_2 bl60x_check_mac_status(Register Eq_2 a0, Register out Eq_73439 a3Out, Register out Eq_73439 a4Out, Register out (ptr32 Eq_73441) a5Out)
// Called from:
//      stateDisconnect_enter
Eq_2 bl60x_check_mac_status(Eq_2 a0, union Eq_73439 & a3Out, union Eq_73439 & a4Out, struct Eq_73441 & a5Out)
{
	Eq_73439 a3_5 = (word32) g_b4200F331;
	struct Eq_73441 * a5_12 = &g_t42012EB8;
	Eq_73439 a4_10 = 0x00;
	while (a4_10 < a3_5)
	{
		++a5_12;
		if (a5_12->dwFFFFFFEC != 0x8801E000)
		{
			*(union Eq_2 *) 0x01 = a0;
			a5_12 = (struct Eq_73441 *) 0x01;
			goto l23019560;
		}
		a4_10 = (word32) a4_10.u0 + 1;
	}
	*a0 = 0x00;
l23019560:
	a3Out = a3_5;
	a4Out = a4_10;
	a5Out = a5_12;
	return 0x00;
}

// 23019568: Register Eq_2 helper_record_dump(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_73482) s0Out, Register out ptr32 a3Out)
// Called from:
//      stateDisconnect_enter
Eq_2 helper_record_dump(Eq_2 ra, Eq_2 a3, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArg0128, struct Eq_73482 & s0Out, ptr32 & a3Out)
{
	word32 a4_282;
	word32 a2_281;
	word32 a1_280;
	word32 a0_279;
	word32 s8_285;
	word32 s4_284;
	word32 a5_283;
	puts(0x230ADA90, out a0_279, out a1_280, out a2_281, out a4_282, out a5_283, out s4_284, out s8_285);
	int32 s1_183 = 0x00;
	struct Eq_73503 * s6_190 = &g_t4200F000;
	word32 s7_191 = 0x230AE000;
	while (s1_183 < (word32) s6_190->b0331)
	{
		struct Eq_73507 * a1_61;
		uint32 a2_62;
		word32 s4_72;
		word32 s7_296;
		word32 s6_295;
		word32 s5_294;
		word32 s3_293;
		word32 s2_292;
		word32 a7_291;
		word32 a5_290;
		word32 a4_289;
		word32 a3_288;
		word32 a0_287;
		word32 s1_286;
		word32 s8_297;
		word32 s9_298;
		word32 s10_299;
		word32 s11_300;
		word32 t4_301;
		Eq_2 ra_66 = printf(ra, s7_191 + -0x0550, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_286, out a0_287, out a1_61, out a2_62, out a3_288, out a4_289, out a5_290, out a7_291, out s2_292, out s3_293, out s4_72, out s5_294, out s6_295, out s7_296, out s8_297, out s9_298, out s10_299, out s11_300, out t4_301);
		struct Eq_73551 * s0_82 = a1_61->ptr0014;
		word32 s5_102;
		Eq_2 a3_148;
		word32 s1_302;
		word32 a0_303;
		word32 a1_304;
		word32 a2_305;
		word32 a3_306;
		word32 a4_307;
		word32 a5_308;
		word32 a7_309;
		word32 s2_310;
		word32 s3_311;
		word32 s4_312;
		word32 s6_313;
		word32 s7_314;
		word32 s8_315;
		word32 s9_316;
		word32 s10_317;
		word32 s11_318;
		word32 t4_319;
		word32 s1_320;
		word32 a0_321;
		word32 a1_322;
		word32 a2_323;
		word32 a3_324;
		word32 a4_325;
		word32 a5_326;
		word32 a7_327;
		word32 s2_328;
		word32 s3_329;
		word32 s4_330;
		word32 s5_331;
		word32 s6_332;
		word32 s7_333;
		word32 s8_334;
		word32 s9_335;
		word32 s10_336;
		word32 s11_337;
		word32 t4_338;
		word32 s1_339;
		word32 a0_340;
		word32 a1_341;
		word32 a2_342;
		word32 a4_343;
		word32 a5_344;
		word32 a7_345;
		word32 s2_346;
		word32 s3_347;
		word32 s4_348;
		word32 s5_349;
		word32 s6_350;
		word32 s7_351;
		word32 s8_352;
		word32 s9_353;
		word32 s10_354;
		word32 s11_355;
		word32 t4_356;
		word32 a0_357;
		word32 a1_358;
		word32 a2_359;
		word32 a4_360;
		word32 a5_361;
		word32 a7_362;
		word32 s2_363;
		word32 s3_364;
		word32 s4_365;
		word32 s5_366;
		word32 s8_367;
		word32 s9_368;
		word32 s10_369;
		word32 s11_370;
		word32 t4_371;
		ra = printf(printf(printf(printf(ra_66, s4_72 + -1332, a2_62 >> 0x08 & 511, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_302, out a0_303, out a1_304, out a2_305, out a3_306, out a4_307, out a5_308, out a7_309, out s2_310, out s3_311, out s4_312, out s5_102, out s6_313, out s7_314, out s8_315, out s9_316, out s10_317, out s11_318, out t4_319), s5_102 + -1272, (word32) s0_82->w001C, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_320, out a0_321, out a1_322, out a2_323, out a3_324, out a4_325, out a5_326, out a7_327, out s2_328, out s3_329, out s4_330, out s5_331, out s6_332, out s7_333, out s8_334, out s9_335, out s10_336, out s11_337, out t4_338), &g_t230ADB3C, (word32) s0_82->w0024, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_339, out a0_340, out a1_341, out a2_342, out a3_148, out a4_343, out a5_344, out a7_345, out s2_346, out s3_347, out s4_348, out s5_349, out s6_350, out s7_351, out s8_352, out s9_353, out s10_354, out s11_355, out t4_356), &g_t230ADB78, a3_148, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_183, out a0_357, out a1_358, out a2_359, out a3, out a4_360, out a5_361, out a7_362, out s2_363, out s3_364, out s4_365, out s5_366, out s6_190, out s7_191, out s8_367, out s9_368, out s10_369, out s11_370, out t4_371);
	}
	0x00 = (int8) dwArg0128;
	ptr32 a3_212;
	word32 s1_372;
	word32 a0_373;
	word32 a1_374;
	word32 a2_375;
	word32 a4_376;
	word32 a5_377;
	word32 a7_378;
	word32 s2_379;
	word32 s3_380;
	word32 s4_381;
	word32 s5_382;
	word32 s6_383;
	word32 s7_384;
	word32 s8_385;
	word32 s9_386;
	word32 s10_387;
	word32 s11_388;
	word32 t4_389;
	Eq_2 ra_215 = printf(ra, &g_t230ADB8C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_372, out a0_373, out a1_374, out a2_375, out a3_212, out a4_376, out a5_377, out a7_378, out s2_379, out s3_380, out s4_381, out s5_382, out s6_383, out s7_384, out s8_385, out s9_386, out s10_387, out s11_388, out t4_389);
	s0Out = dwArgE4;
	a3Out = a3_212;
	return ra_215;
}

// 2301965C: void helper_record_rc_rf_states(Register word32 a0, Register word32 a1)
// Called from:
//      helper_record_all_states
void helper_record_rc_rf_states(word32 a0, word32 a1)
{
	*(struct Eq_10212 **) 0x40001220 = *(struct Eq_10212 **) 0x40001220 & 0x0FFFFFFF | 0x10000000;
	*(struct Eq_10212 **) 0x40001220 = *(struct Eq_10212 **) 0x40001220 & 0x0FFFFFFF | 0x20000000;
	Eq_73796 a5_18 = *(union Eq_73796 *) 0x40001224;
	*(a5_18 >> 0x1C & 0x07) = a0;
	*(a5_18 >> 25 & 0x07) = a1;
}

// 230196A0: Register uint32 helper_record_all_states(Register (ptr32 Eq_19778) a0, Stack Eq_2 dwArg38)
// Called from:
//      hal_machw_reset
uint32 helper_record_all_states(struct Eq_19778 * a0, Eq_2 dwArg38)
{
	struct Eq_73814 * a5_8 = (word32) g_b4200F331;
	Eq_2 a3_19 = *(union Eq_2 *) 0x44B00120;
	a0->dw0004 = (char *) a5_8 + 0x42012EE0;
	*a3_19 = (char *) a5_8 + 0x42012EE0;
	helper_record_rc_rf_states((char *) a5_8 + 1107373800, (char *) a5_8 + 0x42012EEC);
	(*(struct Eq_73839 **) 0x44B00500)->dw0010 = (char *) a5_8 + 0x42012EE0;
	(*(struct Eq_73845 **) 0x44B00504)->dw0014 = (char *) a5_8 + 0x42012EE0;
	*(int32 *) 0x44B00510 = *(int32 *) 0x44B00510 & -0x0100 | 49;
	*(int32 *) 0x44B00510 &= 0xF00000FF;
	(*(struct Eq_73865 **) 0x44B0050C)->dw0018 = (char *) a5_8 + 0x42012EE0;
	*(int32 *) 0x44B00510 = *(int32 *) 0x44B00510 & -0x0100 | 11;
	*(int32 *) 0x44B00510 = *(int32 *) 0x44B00510 & 0xF00000FF | 0x02FFFF00;
	(*(struct Eq_73865 **) 0x44B0050C)->dw001C = (char *) a5_8 + 0x42012EE0;
	*(word32 *) 0x03AE = 0x44900000;
	Eq_2 a4_63 = *(union Eq_2 *) 930;
	*(union Eq_2 *) 0x7C = a4_63;
	*(word32 *) 0x400000D0 = 0x04;
	*(word32 *) 0x400000D4 = 0x40000004;
	*(word32 *) 0x400000D8 = 0x80000004;
	*(word32 *) 0x400000DC = 0xC0000004;
	*(union Eq_73912 *) 0x400000E0 &= ~0x01;
	Eq_73912 a3_85 = *(union Eq_73912 *) 0x400000E0;
	a5_8->w42012F02 = (word16) (a3_85 >> 1);
	a5_8->w42012F00 = (word16) (a3_85 >> 0x11);
	*(union Eq_2 *) 16776061 = a4_63;
	*(union Eq_73912 *) 0x400000E0 &= ~0x01;
	Eq_73912 a5_96 = *(union Eq_73912 *) 0x400000E0;
	a5_8->w42012F04 = (word16) (a5_96 >> 1);
	word32 a5_100 = (word32) g_b4200F331;
	a5_8->w42012F06 = (word16) (a5_96 >> 0x11);
	g_b4200F331 = (byte) (a5_100 + 0x01 & 0x0F);
	0x00 = (int8) dwArg38;
	return a5_96 >> 0x11;
}

// 230197E2: Register Eq_2 phyif_utils_decode(Register Eq_2 ra, Register (ptr32 Eq_43207) a0, Register (ptr32 byte) a1, Register ptr32 fflags, Register ptr32 frm, Register out (ptr32 byte) a1Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxu_mgt_frame_check
Eq_2 phyif_utils_decode(Eq_2 ra, struct Eq_43207 * a0, byte * a1, ptr32 fflags, ptr32 frm, byte & a1Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 a0_59;
	ui32 a4_9 = (word32) a0->w0006;
	byte * s0_12 = a1;
	ui32 a5_14 = (word32) a0->b0013;
	if ((a4_9 & 0x07) <= 0x01)
	{
		a0 = (struct Eq_43207 *) *(a4_9 & 0x07);
		if (((a4_9 & 0x07) >> 0x0C & 0x0F) <= 0x03)
		{
			Eq_2 a1_23;
			Eq_2 a0_31;
			Eq_2 a1_32;
			word32 s9_175;
			word32 s8_174;
			word32 s7_173;
			word32 s4_172;
			word32 s3_171;
			word32 a3_170;
			word32 s1_169;
			ra = __muldf3(ra, __floatsidf(0x00 - (int32) ((byte) a5_14), out a1_23), a1_23, g_t230AA3B0, g_t230AA3B4, fflags, frm, out s0_12, out s1_169, out a0_31, out a1_32, out a3_170, out s2, out s3_171, out s4_172, out s5, out s6, out s7_173, out s8_174, out s9_175, out fflags, out frm);
			word32 a5_178;
			word32 a4_177;
			word32 a3_176;
			a0_59 = __fixdfsi(ra, a0_31, a1_32, fflags, frm, out a1, out a3_176, out a4_177, out a5_178);
l2301980E:
			*s0_12 = (byte) (int32) (real32) a0_59;
			a1Out = a1;
			s2Out = s2;
			s5Out = s5;
			s6Out = s6;
			fflagsOut = fflags;
			frmOut = frm;
			return ra;
		}
	}
	a0_59 = (int32) (word16) ((word32) a0->b0014 << 8 | a5_14) ^ 122;
	goto l2301980E;
}

// 23019854: Register (ptr32 Eq_74062) blmac_pwr_mgt_setf(Register (ptr32 Eq_74062) a0, Register out ptr32 a5Out)
// Called from:
//      chan_goto_idle_cb
//      chan_tx_cfm
//      chan_ctxt_op_evt
struct Eq_74062 * blmac_pwr_mgt_setf(struct Eq_74062 * a0, ptr32 & a5Out)
{
	if ((a0 << 0x02 & -5) == 0x00)
	{
		ptr32 a5_17 = a0->ptr004C;
		struct Eq_74062 * a0_19 = a0 & ~0x04 | a0 << 0x02;
		a0_19->ptr004C = a5_17;
		a5Out = a5_17;
		return a0_19;
	}
	else
		assert_err();
}

// 23019892: Register Eq_2 chan_get_next_chan(Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      chan_cde_evt
//      chan_ctxt_op_evt
//      chan_bcn_to_evt
Eq_2 chan_get_next_chan(Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 a5_15 = 0x44B00000;
	Eq_2 s2_16 = *(union Eq_2 *) 0x44B00120;
	Eq_2 a3_159 = 0x42022D10;
	if (s0 != 0x00)
	{
		if (s1 != 0x00)
		{
			a4 = (word32) *((word32) s1 + 0x0A);
			a5_15.u0 = 0x02;
			if (a4 == 0x02)
				goto l230199A6;
		}
		a3_159 = *((word32) a5_15 + 0x0044);
		a4 = (word32) s2_16 + 0x01000400 - a5_15;
		if (a4 >= 0x00)
			goto l230199A6;
		a4 = (word32) *((word32) s0 + 22);
		a5_15.u0 = 0x04;
		if (a4 == 0x04)
			goto l230199A6;
	}
	if (s1 != 0x00)
	{
		s1 = *((byte) a5_15.u0 + 4);
		if (a5_15 - a4 < 0x00)
		{
			struct Eq_74142 * a5_40 = (word32) *((word32) s1 + 8);
			a3_159.u0 = 0x05D8;
			a5_15 = a5_40 + 0x05D8;
			if (s0 == 0x00)
				assert_err();
			s1 = a5_40->t05DC;
			a4 = s2_16 + 0x01000400 - (a5_40 + 0x05D8);
			if (a4 >= 0x00)
			{
l2301998C:
				if (s0 == 0x00)
					assert_err();
				goto l230199A6;
			}
			a4 = (word32) *((word32) s0 + 18);
			Eq_2 a2_59 = (word32) *((word32) s0 + 20);
			a3_159.u0 = 0x00;
			if (a2_59 < a4)
			{
				a4 -= a2_59;
				a3_159 = (word32) (word16) a4;
			}
			word32 a5_68 = a5_40 + 0x05D8 - s2_16 >>u 0x0A << 16;
			a5_15 = a5_68 >> 16;
			if (a3_159 >= a5_68 >> 16)
				goto l230199A6;
		}
	}
	a5_15.u0 = 0x42022C84;
	a4.u0 = 0x00;
	if ((word32) g_b42022C9A != 0x00)
	{
		a4 = (word32) g_w42022C96;
		s0.u0 = 0x42022C84;
	}
	if ((word32) g_b42022CB6 != 0x00)
	{
		Eq_2 a3_82 = (word32) g_w42022CB2;
		if (a3_82 >= a4)
		{
			a4 = a3_82;
			s0.u0 = 0x42022CA0;
		}
	}
	a3_159 = (word32) g_b42022CD2;
	if (a3_159 != 0x00)
	{
		a5_15 = (word32) g_w42022CCE;
		if (a5_15 < a4)
			goto l2301998C;
		s0.u0 = 0x42022CBC;
l230199A6:
		0x00 = (int8) dwArg38;
		a0Out = s0;
		a3Out = a3_159;
		a4Out = a4;
		a5Out = a5_15;
		s2Out = s2_16;
		return s1;
	}
	goto l2301998C;
}

// 230199BE: Register Eq_2 chan_conn_less_delay_prog(Register ptr32 mstatus, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_74221 a4Out)
// Called from:
//      chan_ctxt_op_evt
//      chan_scan_req
//      chan_roc_req
Eq_2 chan_conn_less_delay_prog(ptr32 mstatus, ptr32 & a0Out, ptr32 & a1Out, union Eq_74221 & a4Out)
{
	ui32 a4_6 = (word32) g_b42022D80;
	g_b42022D80 = (byte) (a4_6 | 16);
	Eq_2 a1_12 = *(union Eq_2 *) 0x44B00120;
	ptr32 a0_17;
	ptr32 a1_18;
	Eq_74221 a4_29;
	word32 s1_33;
	word32 a2_34;
	word32 a5_35;
	word32 s2_36;
	word32 s3_37;
	word32 s4_38;
	word32 s8_39;
	Eq_2 s0_22 = mm_timer_set(0x42022D68, (word32) a1_12 + 0x07000530, a4_6 | 16, mstatus, out s1_33, out a0_17, out a1_18, out a2_34, out a4_29, out a5_35, out s2_36, out s3_37, out s4_38, out s8_39);
	a0Out = a0_17;
	a1Out = a1_18;
	a4Out = a4_29;
	return s0_22;
}

// 230199EE: Register Eq_2 chan_upd_nb_rem_slots.isra.3(Register (ptr32 uint16) a0, Register Eq_2 a1, Register out Eq_74263 a4Out, Register out Eq_2 a5Out)
// Called from:
//      chan_tbtt_schedule
//      chan_ctxt_op_evt
//      chan_bcn_to_evt
Eq_2 chan_upd_nb_rem_slots.isra.3(uint16 * a0, Eq_2 a1, union Eq_74263 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_5 = g_t42022D7C;
	uint32 a1_11 = a1 - a5_5 >> 0x0A << 16;
	Eq_74263 a4_7 = (word32) *a0;
	Eq_74263 a1_12 = a1_11 >> 16;
	if (a4_7 < a1_11 >> 16)
		a1_12 = a4_7;
	Eq_2 a1_16 = a4_7 - a1_12;
	*a0 = (word16) a1_16;
	a4Out = a4_7;
	a5Out = a5_5;
	return a1_16;
}

