pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 23019A12: Register Eq_74290 chan_tbtt_detect_conflict.isra.8(Register Eq_74290 a0, Register Eq_74290 a1, Register out Eq_74290 a1Out, Register out Eq_74290 a3Out, Register out Eq_74294 a4Out, Register out Eq_74295 a5Out)
// Called from:
//      chan_tbtt_insert
Eq_74290 chan_tbtt_detect_conflict.isra.8(Eq_74290 a0, Eq_74290 a1, union Eq_74290 & a1Out, union Eq_74290 & a3Out, union Eq_74294 & a4Out, union Eq_74295 & a5Out)
{
	Eq_74290 a0_11;
	Eq_74294 a4_5 = a0 - a1;
	if (a4_5 >= 0x00)
	{
		a5 = (word32) a1.u0 + 0x02FFF800 - a0;
		a0_11.u0 = 0x01;
		if (a5 >= 0x00)
		{
l23019A42:
			a1Out = a1;
			a3Out = a0;
			a4Out = a4_5;
			a5Out = a5;
			return a0_11;
		}
	}
	a1 -= a0;
	a0_11.u0 = 0x00;
	if (a1 >= 0x00)
		a0_11 = ~((word32) a4_5.u0 + 0x02FFF800) >> 31;
	goto l23019A42;
}

// 23019A44: Register ui32 chan_tbtt_insert(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0198, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out)
// Called from:
//      chan_tbtt_schedule
ui32 chan_tbtt_insert(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 dwArg0138, Eq_2 dwArg0198, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s9Out, union Eq_2 & s10Out)
{
	Eq_2 a5_126 = 0x42023000;
	Eq_2 s2_40 = g_t42022D20;
	Eq_2 s6_182 = 0x00;
	Eq_2 s0_140 = 0x00;
	Eq_2 s1_136 = 0x00;
	a0_132 = a0;
	while (true)
	{
		word32 s2_142;
		Eq_2 a0_132;
		if (s2_40 == 0x00)
			break;
		if (s2_40 == a0)
			assert_err();
		a5_126 = (word32) *((word32) s2_40 + 0x0A);
		Eq_74290 s4_49 = *((word32) a0 + 4);
		Eq_74290 s5_50 = *((word32) s2_40 + 4);
		if (a5_126 != 0x02)
		{
			a0_132 = chan_tbtt_detect_conflict.isra.8(s4_49, s5_50, out a1, out a3, out a4, out a5_126);
			if (a0_132 != 0x00)
			{
				a4 = (word32) *((word32) a0 + 9);
				a5_126 = (word32) *((word32) s2_40 + 9);
				if (a5_126 >= a4)
					goto l23019AFC;
				if (s0_140 == 0x00)
					s0_140 = s2_40;
				s1_136 = (byte) s1_136.u0 + 1 & 0x00FF;
				goto l23019AE0;
			}
			if (s4_49 < s5_50)
				break;
			goto l23019AEA;
		}
		if (s4_49 < s5_50)
		{
l23019AFC:
			s0_140 = a0;
			s1_136.u0 = 0x01;
			s2_142 = 0x00;
			goto l23019A80;
		}
		a0_132 = chan_tbtt_detect_conflict.isra.8(s4_49, s5_50, out a1, out a3, out a4, out a5_126);
		if (a0_132 != 0x00)
			goto l23019AFC;
l23019AEA:
		s6_182 = s2_40;
l23019AE0:
		s2_40 = *s2_40;
	}
	s2_142 = 0x01;
l23019A80:
	while (true)
	{
		ui32 s1_95 = (word32) s1_136 - 1;
		if ((s1_95 & 0x00FF) == 0x00FF)
			break;
		if (s0_140 == 0x00)
			assert_err();
		if (s0_140 != a0)
		{
			Eq_2 a5_106 = (word32) *((word32) s0_140 + 0x0A);
			if (a5_106 == 0x01)
			{
				word32 a2_472;
				mm_timer_clear(0x42022D38, a4, out a2_472, out a5_106);
				((word32) s0_140 + 0x0A)->u0 = 0x00;
			}
			co_list_extract(0x42022D20, s0_140, a4, a5_106, out a5_126);
		}
		s1_136 = co_list_push_back(s0_140, a5_126);
		a1 = s0_140;
		a0_132.u0 = 0x42022D28;
		s0_140 = *s0_140;
	}
	if (s2_142 == 0x00)
	{
		0x00 = (int8) dwArg0198;
		a0Out = a0_132;
		a1Out = a1;
		a4Out = a4;
		a5Out = a5_126;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		s7Out.u0 = <invalid>;
		s9Out.u0 = <invalid>;
		s10Out.u0 = <invalid>;
		return s1_95 & 0x00FF;
	}
	else
	{
		0x00 = (int8) dwArg0198;
		Eq_2 a0_204;
		Eq_2 a4_206;
		Eq_2 a5_207;
		Eq_2 a1_208;
		ui32 s1_209 = co_list_insert_after(0x42022D20, s6_182, dwArg0138, a3, a5_126, out a0_204, out a1_208, out a4_206, out a5_207);
		a0Out = a0_204;
		a1Out = a1_208;
		a4Out = a4_206;
		a5Out = a5_207;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		s7Out.u0 = <invalid>;
		s9Out.u0 = <invalid>;
		s10Out.u0 = <invalid>;
		return s1_209;
	}
}

// 23019B9C: Register Eq_2 chan_upd_ctxt_status(Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Register out ptr32 s1Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out Eq_74476 s3Out, Register out ptr32 s4Out)
// Called from:
//      chan_switch_start
//      chan_cde_evt
//      chan_goto_idle_cb
//      chan_tx_cfm
Eq_2 chan_upd_ctxt_status(Eq_2 a0, Eq_2 a1, ptr32 mstatus, ptr32 & s1Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, union Eq_74476 & s3Out, ptr32 & s4Out)
{
	Eq_2 a5_27;
	ui32 a5_13;
	Eq_2 a3_5 = *(union Eq_2 *) 0x44B00120;
	Eq_2 a4_17 = 0x02;
	if (a1 != 0x02)
	{
		a2 = 0x04;
		a5_27.u0 = 0x00;
		if (a1 != 0x04)
			goto l23019BBC;
		a2 = (word32) *((word32) a0 + 23);
		if (a2 > 0x02)
		{
			a5_13 = (word32) *((word32) a0 + 18) << 0x0A;
			goto l23019BBA;
		}
		a2 = 0x42022D10;
		a4_17.u0 = 0x01;
		if ((word32) g_b42022D82 > 0x01)
		{
			a4_17 = (word32) *((word32) a0 + 18);
			Eq_2 a6_19 = (word32) *((word32) a0 + 20);
			if (a6_19 < a4_17)
			{
				a4_17 = (word32) (word16) (a4_17 - a6_19);
				if (a1 < a4_17)
				{
					((word32) a3_5 + 0x006C)->u0 = 0x42022D10;
					a5_13 = a4_17 << 0x0A;
					goto l23019BBA;
				}
			}
		}
		a1.u0 = 0x05;
		goto l23019BBC;
	}
	else
	{
		a4_17 = (word32) *((word32) a0 + 23);
		a5_27.u0 = 0x00;
		if (a1 < a4_17)
			goto l23019BBC;
		a5_13 = 0x00FFFFA0;
l23019BBA:
		a5_27 = (word32) a3_5 + a5_13;
l23019BBC:
		*((word32) a0 + 22) = (byte) a1;
		if (a5_27 != 0x00)
		{
			g_t42023D60 = a0;
			Eq_2 a1_51;
			ptr32 a2_52;
			ptr32 a5_53;
			ptr32 s1_56;
			ptr32 s2_57;
			Eq_74476 s3_58;
			ptr32 s4_59;
			Eq_2 a4_62;
			word32 s8_139;
			word32 a0_138;
			Eq_2 s0_55 = mm_timer_set(0x42022D58, a5_27, 0x42023000, mstatus, out s1_56, out a0_138, out a1_51, out a2_52, out a4_62, out a5_53, out s2_57, out s3_58, out s4_59, out s8_139);
			s1Out = s1_56;
			a1Out = a1_51;
			a2Out = a2_52;
			a3Out.u0 = <invalid>;
			a4Out = a4_62;
			a5Out = a5_53;
			s2Out = s2_57;
			s3Out = s3_58;
			s4Out = s4_59;
			return s0_55;
		}
		else if (a1 == 0x03)
		{
			s1Out = s1;
			a1Out = a1;
			a2Out = a2;
			a3Out.u0 = <invalid>;
			a4Out = a4_17;
			a5Out = 0x03;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			return s0;
		}
		else
		{
			ptr32 a2_71;
			ptr32 a5_72;
			Eq_2 a1_70 = mm_timer_clear(0x42022D58, a4_17, out a2_71, out a5_72);
			s1Out = s1;
			a1Out = a1_70;
			a2Out = a2_71;
			a3Out.u0 = <invalid>;
			a4Out = a4_17;
			a5Out = a5_72;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			return s0;
		}
	}
}

// 23019C3A: Register Eq_2 chan_switch_start(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out Eq_74594 s1Out, Register out (ptr32 Eq_74595) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_74598 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      chan_conn_less_delay_evt
//      chan_tbtt_schedule
//      chan_cde_evt
//      chan_ctxt_op_evt
//      chan_roc_req
//      chan_bcn_to_evt
//      chan_ctxt_link
//      chan_ctxt_unlink
Eq_2 chan_switch_start(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, union Eq_74594 & s1Out, struct Eq_74595 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_74598 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a5_107;
	Eq_2 a5_6 = *((word32) a3 + 32);
	if (a3 == a0)
	{
		a4 = (word32) *((word32) a5_6 + 114);
		a5_107.u0 = 0x01;
		if (a4 > 0x01)
		{
			a4 = (word32) *((word32) a3 + 23);
			a5_107.u0 = 0x02;
			if (a4 <= 0x02)
			{
				struct Eq_74595 * a1_77;
				ptr32 a2_78;
				Eq_2 a3_79;
				Eq_74598 a4_80;
				Eq_2 a5_81;
				Eq_74594 s1_84;
				ptr32 s2_85;
				ptr32 s3_86;
				ptr32 s4_87;
				s0Out = chan_upd_ctxt_status(a0, 0x04, mstatus, out s1_84, out a1_77, out a2_78, out a3_79, out a4_80, out a5_81, out s2_85, out s3_86, out s4_87);
				s1Out = s1_84;
				a1Out = a1_77;
				a2Out = a2_78;
				a3Out = a3_79;
				a4Out = a4_80;
				a5Out = a5_81;
				s2Out = s2_85;
				s3Out = s3_86;
				s4Out = s4_87;
				return ra;
			}
		}
	}
	else
	{
		a5_107 = *((word32) a3 + 36);
		if (a3 == 0x00)
		{
			*((word32) a0 + 36) = a5_107;
			Eq_2 a4_19;
			word32 s3_161;
			word32 s2_160;
			word32 a5_159;
			word32 a3_158;
			word32 a2_157;
			word32 a1_156;
			word32 s1_155;
			word32 s4_162;
			chan_upd_ctxt_status(a0, 0x02, mstatus, out s1_155, out a1_156, out a2_157, out a3_158, out a4_19, out a5_159, out s2_160, out s3_161, out s4_162);
			Eq_2 a0_33;
			word32 s0_163;
			word32 s1_164;
			word32 a1_165;
			word32 a2_166;
			word32 a3_167;
			word32 a4_168;
			word32 a5_169;
			word32 a6_170;
			word32 s2_171;
			word32 s3_172;
			word32 s4_173;
			word32 s8_174;
			Eq_2 ra_40 = ke_msg_alloc(ra, 96, 0x00, 0x04, a4_19, mstatus, dwArg08, out s0_163, out s1_164, out a0_33, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out a6_170, out s2_171, out s3_172, out s4_173, out s8_174);
			g_t2301A284 = a0_33;
			ptr32 a2_57;
			Eq_2 a3_58;
			Eq_74598 a4_59;
			Eq_2 a5_60;
			Eq_74594 s1_63;
			ptr32 s2_64;
			ptr32 s3_65;
			ptr32 s4_66;
			struct Eq_74595 * a1_70;
			word32 a0_175;
			word32 s8_176;
			s0Out = ke_msg_send(a0_33, mstatus, out s1_63, out a0_175, out a1_70, out a2_57, out a3_58, out a4_59, out a5_60, out s2_64, out s3_65, out s4_66, out s8_176);
			s1Out = s1_63;
			a1Out = a1_70;
			a2Out = a2_57;
			a3Out = a3_58;
			a4Out = a4_59;
			a5Out = a5_60;
			s2Out = s2_64;
			s3Out = s3_65;
			s4Out = s4_66;
			return ra_40;
		}
	}
	s0Out = s0;
	s1Out = s1;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_107;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	return ra;
}

// 23019C96: void chan_conn_less_delay_evt(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void chan_conn_less_delay_evt(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_22;
	ui32 a5_24;
	ui32 a5_10 = (word32) g_b42022D80;
	if ((a5_10 & 1) != 0x00)
	{
		if ((a5_10 & 0x04) != 0x00)
			assert_err();
		a5_24 = (word32) g_b42022D80 & ~0x01 | 4;
		g_b42022D80 = (byte) a5_24;
		a0_22.u0 = 0x42022CF4;
	}
	else
	{
		if ((a5_10 & 2) == 0x00)
			return;
		if ((a5_10 & 0x08) != 0x00)
			assert_err();
		a5_24 = (word32) g_b42022D80 & ~0x02 | 8;
		g_b42022D80 = (byte) a5_24;
		a0_22.u0 = 0x42022CD8;
	}
	if (a5_24 != 0x00)
		return;
	word32 s3_150;
	word32 s4_151;
	word32 a5_148;
	word32 s2_149;
	word32 a3_146;
	word32 a4_147;
	word32 a1_144;
	word32 a2_145;
	word32 s0_142;
	word32 s1_143;
	chan_switch_start(ra, a0_22, a3, mstatus, dwArg08, out s0_142, out s1_143, out a1_144, out a2_145, out a3_146, out a4_147, out a5_148, out s2_149, out s3_150, out s4_151);
}

word32 g_dw23019CF2 = 2619155;
// 23019D34: Register Eq_2 chan_tbtt_switch_evt(Register Eq_2 ra, Register (ptr32 Eq_74818) a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out ptr32 s0Out, Register out (ptr32 Eq_74818) s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_74825 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      chan_tbtt_schedule
Eq_2 chan_tbtt_switch_evt(Eq_2 ra, struct Eq_74818 * a0, ptr32 mstatus, Eq_2 dwArg08, ptr32 & s0Out, struct Eq_74818 & s1Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_74825 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 s0_147 = 0x42023000;
	Eq_2 s3_16 = *(union Eq_2 *) 0x44B00120;
	ptr32 a4_140 = (word32) g_b42022D82;
	if (a4_140 > 0x01)
	{
		s0_147 = 0x42022D10;
		if (((word32) g_b42022D80 & 0x0C) == 0x00)
		{
			struct Eq_74849 * a4_24 = (word32) a0->b0008;
			a3.u0 = 0x05D8;
			a4_140 = (char *) a4_24 + 0x05D8;
			s2 = a4_24->t42020590;
			s0_147 = a4_24->ptr42020574;
			if (a4_24 == &g_t42020550 || (char *) a4_24 + 0x42020550 == s2)
			{
				a0->b0009 = 0x00;
				struct Eq_74874 * s0_35 = a0->ptr0020;
				word32 a5_183;
				word32 a4_182;
				a1 = chan_upd_nb_rem_slots.isra.3(&a0->b000A + 8, s3_16, out a4_182, out a5_183);
				ptr32 a5_43 = (word32) *((word32) s2 + 20);
				s1 = a0;
				a3.u0 = 0x0A;
				a4_140 = a5_43;
				if (a5_43 > 0x0A)
					a4_140 = 0x0A;
				((word32) s2 + 20)->u2 = (word16) (a5_43 - a4_140);
				s0_35->t006C = s3_16;
				a0->b000A = 0x02;
				s0_147 = *(ptr32 *) 0x26;
				if (false)
				{
					ptr32 a1_84;
					ptr32 a2_85;
					Eq_74825 a3_86;
					ptr32 a4_87;
					ptr32 s0_90;
					struct Eq_74818 * s1_91;
					Eq_2 s2_92;
					Eq_2 s3_93;
					ptr32 s4_94;
					word32 a5_184;
					Eq_2 ra_89 = chan_switch_start(ra, s2, 0x0A, mstatus, dwArg08, out s0_90, out s1_91, out a1_84, out a2_85, out a3_86, out a4_87, out a5_184, out s2_92, out s3_93, out s4_94);
					s0Out = s0_90;
					s1Out = s1_91;
					a1Out = a1_84;
					a2Out = a2_85;
					a3Out = a3_86;
					a4Out = a4_87;
					s2Out = s2_92;
					s3Out = s3_93;
					s4Out = s4_94;
					return ra_89;
				}
			}
		}
	}
	s0Out = s0_147;
	s1Out = s1;
	a1Out = a1;
	a2Out = dwArg48;
	a3Out = a3;
	a4Out = a4_140;
	s2Out = s2;
	s3Out = s3_16;
	s4Out = dwArg04;
	return ra;
}

word32 g_dw23019D60 = 2343634692;
// 23019DDA: Register Eq_2 chan_tbtt_schedule(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_74955 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out)
// Called from:
//      chan_tbtt_switch_update
//      chan_bcn_to_evt
//      chan_ctxt_unlink
Eq_2 chan_tbtt_schedule(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgA8, Eq_2 dwArg0118, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_74955 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s9Out, union Eq_2 & s10Out)
{
	Eq_2 s1_100;
	s1_100 = s1;
	if (a0 != 0x00)
	{
		s3 = 0x42023000;
		word32 s10_34;
		word32 s2_36;
		word32 s7_41;
		word32 s9_42;
		word32 s3_353;
		word32 s4_354;
		word32 s5_355;
		word32 s6_356;
		Eq_2 a5_30;
		s1_100 = (word32) chan_tbtt_insert(a0, a3, a4, dwArg0118, dwArg0178, out a0, out a1, out a4, out a5_30, out s2_36, out s3_353, out s4_354, out s5_355, out s6_356, out s7_41, out s9_42, out s10_34) - 0x0088;
		int32 s4_105 = 0x05D8;
		s2 = s2_36 + -1440;
		Eq_75000 s5_106 = 432;
		up32 s6_107 = 0x04;
		while (a5_30 != 0x00)
		{
			int32 a5_67;
			word32 a5_357;
			struct Eq_75021 * a5_64 = (word32) s1_100 + ((word32) (*((word32) co_list_pop_front(a4, a5_30, out a5_357) + 8)) + s4_105);
			Eq_2 a4_65 = (word32) a5_64->b0056;
			if (a4_65 == 0x00)
				a5_67 = (word32) s2.u0 + ((word32) s5_106 + (word32) a5_64->b0060) + 4;
			else
				a5_67 = (word32) a5_64->w033E << 0x0A;
			Eq_2 a0_76 = *((word32) a4_65 + 4);
			(word32) a4_65 + a5_67 + 4 = (ui32) a0_76;
			up32 a5_80 = (word32) *((word32) a0_76 + 9);
			if (s6_107 >= a5_80)
				*((word32) a0_76 + 9) = (byte) (a5_80 + 0x01);
			word32 s10_101;
			word32 s7_108;
			word32 s9_109;
			s1_100 = chan_tbtt_insert(a0_76, a3, a4_65, dwArg0118, dwArg0178, out a0, out a1, out a4, out a5_30, out s2, out s3, out s4_105, out s5_106, out s6_107, out s7_108, out s9_109, out s10_101);
		}
	}
	word32 s0_116 = *((word32) a0 + 16);
	if (a0 != 0x00 && (word32) (*((word32) a0 + 0x0A)) == 0x00)
	{
		Eq_2 a4_119 = *(union Eq_2 *) 0x44B00120;
		struct Eq_74818 * a0_120 = *(struct Eq_74818 **) 0x44B00004;
		if (0x44B00000 - a4_119 >= ~0x07CF)
		{
			a0_120->dw0030 = s0_116;
			a0_120->b000A = 0x01;
			0x00 = (int8) dwArgA8;
			Eq_2 a1_147;
			ptr32 a2_148;
			Eq_2 s1_152;
			Eq_74955 s2_153;
			ptr32 s3_154;
			ptr32 s4_155;
			Eq_2 a4_158;
			word32 a0_358;
			word32 a5_359;
			word32 s8_360;
			s0Out = mm_timer_set(0x42022D38, a1, a4_119, mstatus, out s1_152, out a0_358, out a1_147, out a2_148, out a4_158, out a5_359, out s2_153, out s3_154, out s4_155, out s8_360);
			s1Out = s1_152;
			a1Out = a1_147;
			a2Out = a2_148;
			a3Out = a3;
			a4Out = a4_158;
			s2Out = s2_153;
			s3Out = s3_154;
			s4Out = s4_155;
			s5Out.u0 = <invalid>;
			s6Out.u0 = <invalid>;
			s7Out.u0 = <invalid>;
			s9Out.u0 = <invalid>;
			s10Out.u0 = <invalid>;
			return ra;
		}
		else
		{
			0x00 = (int8) dwArgA8;
			ptr32 a2_171;
			Eq_2 a4_172;
			Eq_2 s0_175;
			ptr32 s3_176;
			ptr32 s4_177;
			Eq_2 a1_181;
			Eq_2 a3_182;
			Eq_2 s1_183;
			Eq_74955 s2_184;
			Eq_2 ra_185 = chan_tbtt_switch_evt(ra, a0_120, mstatus, dwArg08, out s0_175, out s1_183, out a1_181, out a2_171, out a3_182, out a4_172, out s2_184, out s3_176, out s4_177);
			s0Out = s0_175;
			s1Out = s1_183;
			a1Out = a1_181;
			a2Out = a2_171;
			a3Out = a3_182;
			a4Out = a4_172;
			s2Out = s2_184;
			s3Out = s3_176;
			s4Out = s4_177;
			s5Out.u0 = <invalid>;
			s6Out.u0 = <invalid>;
			s7Out.u0 = <invalid>;
			s9Out.u0 = <invalid>;
			s10Out.u0 = <invalid>;
			return ra_185;
		}
	}
	else
	{
		0x00 = (int8) dwArgA8;
		s0Out = s1;
		s1Out = s1_100;
		a1Out = a1;
		a2Out = dwArg48;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out.u0 = <invalid>;
		s6Out.u0 = <invalid>;
		s7Out.u0 = <invalid>;
		s9Out.u0 = <invalid>;
		s10Out.u0 = <invalid>;
		return ra;
	}
}

// 23019ED2: Register Eq_2 chan_cde_evt(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Register out (ptr32 Eq_75160) s0Out, Register out (ptr32 Eq_75160) s1Out, Register out (ptr32 Eq_75162) a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_75165) s2Out, Register out Eq_2 s3Out)
// Called from:
//      chan_tx_cfm
//      chan_ctxt_op_evt
//      chan_ctxt_link
//      chan_ctxt_unlink
Eq_2 chan_cde_evt(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, struct Eq_75160 & s0Out, struct Eq_75160 & s1Out, struct Eq_75162 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_75165 & s2Out, union Eq_2 & s3Out)
{
	struct Eq_75160 * s1_260;
	struct Eq_75165 * s2_17 = &g_t42023000;
	Eq_2 s3_18 = *(union Eq_2 *) 0x44B00120;
	Eq_2 a4_20 = (word32) g_b42022D82;
	s1_260 = s1;
	if (a4_20 > 0x01)
	{
		s2_17 = &g_t42022D10;
		s1_260 = s1;
		if (((word32) g_b42022D80 & 44) == 0x00)
		{
			struct Eq_75190 * a2_34;
			struct Eq_75191 * s2_39;
			word32 s3_40;
			word32 a5_561;
			word32 a4_560;
			word32 s8_563;
			word32 s4_562;
			word32 a0_558;
			word32 a1_559;
			Eq_2 s1_216;
			Eq_2 s0_312 = mm_timer_set(0x42022D48, (word32) s3_18 + g_dw42022D78, a4_20, mstatus, out s1_216, out a0_558, out a1_559, out a2_34, out a4_560, out a5_561, out s2_39, out s3_40, out s4_562, out s8_563);
			Eq_2 a5_47 = g_t42020B30;
			s2_39->dw006C = s3_40;
			s3_18.u0 = 0x00;
			while (a5_47 != 0x00)
			{
				struct Eq_75224 * a5_57 = a2_34->ptr0040;
				if (a2_34 != null)
				{
					s0_312 = (word32) s0_312 + 1 & 0x00FF;
					if (((word32) g_a4201FEE5[(word32) a5_57->b0057] & 0x03) != 0x00 || (word32) a5_57->b0058 == 0x00)
						s3_18 = (byte) s3_18.u0 + 1 & 0x00FF;
					a2_34->w0010 = 0x00;
					a2_34->w0014 = 0x00;
				}
				a5_47 = a5_57->t0000;
			}
			if (s0_312 != s2_39->t0068 >> 0x0CFFF800)
				assert_warn();
			ui32 s0_105;
			if (s3_18 != 0x00 && s0_312 != s3_18)
			{
				a1 = (struct Eq_75162 *) 0x0A;
				s0_105 = (word32) (word16) (s0_312 - s3_18 + 40) ^ s3_18;
			}
			else
			{
				s0_105 = 0x00;
				a1 = (struct Eq_75162 *) 50;
			}
			Eq_2 a4_116 = g_t42020B30;
			Eq_2 s0_125 = s0_105 + 50;
			while (a4_116 != 0x00)
			{
				struct Eq_75288 * a4_129 = g_ptr4201FEE0;
				if (true)
				{
					ui32 a5_140;
					ui32 a2_136 = (word32) g_a4201FEE5[(word32) a4_129->b0057];
					word32 a5_131 = (word32) g_w4201FEB0;
					ui32 a2_137 = a2_136 & 0x03;
					if ((a2_136 & 0x03) == 0x00)
					{
						a2_137 = (word32) a4_129->b0058;
						if (a2_137 == 0x00)
							goto l2301A02C;
						a5_140 = a1 + a5_131 / 25;
					}
					else
					{
l2301A02C:
						a5_140 = (word32) s0_125 + a5_131;
					}
					uint32 a5_146 = a5_140 << 16;
					g_w4201FEB0 = (word16) (a5_146 >> 16);
					g_w4201FEB2 = (word16) (a5_146 >> 16);
					if ((word32) a4_129->b0056 != 0x00)
						a2_137 = (word32) a4_129->w033E << 0x0A;
					uint32 a5_172 = s2_39->t0068 >> a2_137;
					if (a5_172 == 0x00)
						a5_172 = 0x01;
					g_w4201FEB4 = (word16) ((a5_172 & 0x00FF) + 0x0A + (word32) g_w4201FEB4);
				}
				a4_116 = a4_129->t0000;
			}
			Eq_2 a0_193 = s2_39->t0020;
			if (a0_193 != 0x00)
			{
				word32 s4_569;
				word32 s2_568;
				word32 a5_567;
				word32 a2_565;
				word32 a3_566;
				s0_125 = chan_upd_ctxt_status(a0_193, 0x01, mstatus, out s1_216, out a1, out a2_565, out a3_566, out a4_116, out a5_567, out s2_568, out s3_18, out s4_569);
			}
			word32 a5_564;
			Eq_2 a0_253;
			s1_260 = chan_get_next_chan(s0_125, s1_216, a4_116, dwArg18, out a0_253, out a3, out a4_20, out a5_564, out s2_17);
			if (s1_260 == null)
			{
				word32 a2_570;
				word32 a5_571;
				word32 s4_572;
				struct Eq_75162 * a1_295;
				Eq_2 a3_297;
				Eq_2 a4_298;
				struct Eq_75160 * s0_301;
				struct Eq_75160 * s1_302;
				struct Eq_75165 * s2_303;
				Eq_2 s3_304;
				Eq_2 ra_300 = chan_switch_start(ra, a0_253, a3, mstatus, dwArg08, out s0_301, out s1_302, out a1_295, out a2_570, out a3_297, out a4_298, out a5_571, out s2_303, out s3_304, out s4_572);
				s0Out = s0_301;
				s1Out = s1_302;
				a1Out = a1_295;
				a3Out = a3_297;
				a4Out = a4_298;
				s2Out = s2_303;
				s3Out = s3_304;
				return ra_300;
			}
			s2_17->t0024 = a0_253;
		}
	}
	s0Out = s1;
	s1Out = s1_260;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4_20;
	s2Out = s2_17;
	s3Out = s3_18;
	return ra;
}

