pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
word32 g_dw23019F0E = 892830890;
// 2301A090: void chan_pre_switch_channel(Register Eq_2 ra, Register (ptr32 Eq_75438) s1, Register Eq_2 a4, Register Eq_2 s2, Register (ptr32 Eq_7733) s3, Register Eq_2 s4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0138, Stack word32 dwArg0178)
// Called from:
//      chan_goto_idle_cb
//      chan_tx_cfm
void chan_pre_switch_channel(Eq_2 ra, struct Eq_75438 * s1, Eq_2 a4, Eq_2 s2, struct Eq_7733 * s3, Eq_2 s4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0138, word32 dwArg0178)
{
	word32 a2_877;
	word32 a5_878;
	mm_timer_clear(0x42022D58, a4, out a2_877, out a5_878);
	struct Eq_75464 * s0_28 = &g_t42022D10;
	if (((word32) g_b42022D80 & 32) != 0x00)
	{
		struct Eq_75473 * a5_30 = (word32) g_b42022D82;
		a4.u0 = 0x01;
		if (a5_30 > (struct Eq_75473 *) 0x01)
		{
			s0_28 = a5_30->ptr0024;
			if (a5_30 != null)
			{
				a5_30->b0016 = 0x01;
				s0_28->dw0024 = 0x00;
			}
		}
		s0_28->b0070 = (byte) ((word32) s0_28->b0070 & -33);
	}
	struct Eq_75503 * a5_48;
	ui32 a5_42 = (word32) s0_28->b0070;
	Eq_2 s0_45 = *((byte) a4.u0 + 36);
	if ((a5_42 & 8) == 0x00)
	{
		if ((a5_42 & 0x04) == 0x00)
		{
			if (a4 == 0x00)
			{
				up32 a4_50 = (word32) *((word32) s0_45 + 114);
				a5_48 = (struct Eq_75503 *) 0x01;
				if (a4_50 > 0x01)
				{
					word32 s0_907;
					word32 s2_911;
					word32 a1_908;
					word32 a3_909;
					word32 a4_910;
					ra = chan_cde_evt(ra, mstatus, s2, dwLoc08, out s0_907, out s1, out a1_908, out a3_909, out a4_910, out s2_911, out s3);
				}
				else if (a4_50 == 0x01)
				{
					s0_45 = *(union Eq_2 *) 0x09;
l2301A104:
					a5_48->t0024 = s0_45;
					goto l2301A124;
				}
			}
l2301A124:
			if (s1 == null)
				return;
			struct Eq_75533 * a4_223;
			ptr32 fflags_143;
			ptr32 frm_144;
			Eq_2 s0_146;
			Eq_2 s1_147;
			struct Eq_75538 * s2_149;
			word32 s3_879;
			Eq_2 ra_145 = phy_set_channel(ra, (word32) s1->b0004, (word32) s1->b0005, (word32) s1->w0008, s3, fflags, frm, s4, dwArg04, dwArg0138, out s0_146, out s1_147, out s2_149, out s3_879, out fflags_143, out frm_144);
			word32 a4_880;
			word32 a5_881;
			tpc_update_tx_power(ra_145, fflags_143, frm_144, out a4_880, out a5_881);
			s2_149->dw00DC = 0x10;
			*((word32) s1_147 + 32) = s0_146;
			((word32) s0_146 + 36)->u0 = 0x00;
			struct Eq_75579 * s2_194;
			word32 a4_885;
			word32 a5_886;
			word32 s3_887;
			word32 s4_888;
			word32 a3_884;
			word32 a1_882;
			word32 a2_883;
			Eq_2 s1_193;
			Eq_2 s0_192 = chan_upd_ctxt_status(s1_147, 0x04, mstatus, out s1_193, out a1_882, out a2_883, out a3_884, out a4_885, out a5_886, out s2_194, out s3_887, out s4_888);
			word32 a5_199 = (word32) *((word32) s1_193 + 23);
			if (a5_199 != 0x03)
			{
				a4_223 = (struct Eq_75533 *) 0x04;
				if (a5_199 == 0x04)
					goto l2301A192;
				if ((word32) g_b4201E9DC == 0x00 || (g_dw4201E9E0 & 0x08) != 0x00)
				{
					Eq_2 s2_232 = g_t42020B30;
					Eq_2 s3_234 = *((word32) s0_192 + 32);
					word32 a5_892;
					blmac_pwr_mgt_setf(null, out a5_892);
					while (s2_232 != 0x00)
					{
						if (s3_234 == *((word32) s2_232 + 64) && ((word32) (*((word32) s2_232 + 86)) == 0x00 && (word32) (*((word32) s2_232 + 88)) != 0x00))
						{
							word32 s7_900;
							word32 s5_898;
							word32 s6_899;
							word32 a0_893;
							word32 a3_894;
							word32 a4_895;
							word32 a5_896;
							word32 s4_897;
							ra_145 = txl_frame_send_null_frame(ra_145, (word32) *((word32) s2_232 + 96), null, fflags_143, frm_144, mstatus, dwArg28, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178, out s0_192, out s1_193, out a0_893, out a3_894, out a4_895, out a5_896, out s2_232, out s3_234, out s4_897, out s5_898, out s6_899, out s7_900);
						}
						s2_232 = *s2_232;
					}
				}
				a4_223 = (word32) *((word32) s1_193 + 23);
				if (a4_223 > (struct Eq_75533 *) 0x02)
				{
l2301A192:
					__csrrc(mstatus, 0x08);
					(a4_223 | 2)->dw0004 = a4_223->dw0004;
					__csrrs(mstatus, 0x08);
					*((word32) s0_192 + 115) = (byte) (*(uint32 *) 0x44B0004C >> 2 & 0x01);
					word32 a5_889;
					blmac_pwr_mgt_setf(null, out a5_889);
					goto l2301A228;
				}
				Eq_2 s2_291 = g_t42020B30;
				int32 s3_293 = 0x4201FEA0;
				Eq_75669 s4_294 = 36;
				Eq_2 s5_295 = 0x01;
				while (s2_291 != 0x00)
				{
					if (s1_193 == *((word32) s2_291 + 64))
					{
						((word32) s4_294 + (word32) (*((word32) s2_291 + 87)) + s3_293)->b0023 = (byte) s5_295;
						ra_145 = vif_mgmt_send_postponed_frame(ra_145, s2_291, s5_295, mstatus, dwArg48, dwArg58, dwArg8C, dwArgF8, out s1_193, out s2_291, out s3_293, out s4_294, out s5_295);
					}
					s2_291 = *s2_291;
				}
			}
			else
			{
				s2_194->dw0220 = 0x00;
				word32 s8_906;
				word32 a0_901;
				word32 a3_902;
				word32 s2_903;
				word32 s3_904;
				word32 s4_905;
				ke_msg_send_basic(ra_145, 97, 0x02, 0x03, mstatus, s2, out s0_192, out s1_193, out a0_901, out a3_902, out s2_903, out s3_904, out s4_905, out s8_906);
			}
			a4_223 = (word32) *((word32) s1_193 + 23);
			if (a4_223 <= (struct Eq_75533 *) 0x02)
			{
l2301A228:
				word32 a4_890;
				word32 s2_891;
				mm_active(mstatus, out a4_890, out s2_891);
				return;
			}
			goto l2301A192;
		}
		a5_48 = &g_t42022CF4;
	}
	else
		a5_48 = &g_t42022CD8;
	if (a4 != 0x00)
		*((byte) a4.u0 + 22) = 0x01;
	goto l2301A104;
}

// 2301A284: void chan_goto_idle_cb(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Stack word32 dwArg0138, Stack word32 dwArg0168, Stack word32 dwArg0178)
void chan_goto_idle_cb(Eq_2 ra, Eq_2 a4, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0128, word32 dwArg0138, word32 dwArg0168, word32 dwArg0178)
{
	word32 s2_483;
	word32 s4_484;
	struct Eq_75438 * s1_102;
	struct Eq_7733 * s3_104;
	Eq_2 a4_152;
	Eq_2 ra_116 = mm_force_idle_req(ra, a4, mstatus, dwLoc18, dwLoc10, dwLoc0C, dwArg18, dwArg3C, dwArgD8, dwArgE8, out s1_102, out a4_152, out s2_483, out s3_104, out s4_484);
	Eq_2 s2_103 = s1_102->tFFFFFD30;
	if (s2_103 != 0x00)
	{
		s1_102 = (struct Eq_75438 *) ((char *) s1_102 - 752);
		if (((word32) s1_102->bFFFFFD80 & 32) == 0x00)
		{
			a4_152 = (word32) g_b4201E9DC;
			if (a4_152 == 0x00 || (g_dw4201E9E0 & 0x08) != 0x00)
			{
				Eq_2 s0_128 = g_t42020B30;
				s3_104 = null;
				Eq_2 a5_233;
				Eq_2 a0_192 = blmac_pwr_mgt_setf((struct Eq_74062 *) 0x01, out a5_233);
				Eq_2 s4_105 = 0x00FF;
				word32 s5_106 = 0x06;
				word32 s6_107 = 0x2301A000;
				while (s0_128 != 0x00)
				{
					Eq_2 s0_101 = *((word32) a5_233 + 64);
					if (s2_103 == a5_233)
					{
						a5_233 = (word32) *((word32) s0_101 + 86);
						if (a5_233 == 0x00)
						{
							a5_233 = (word32) *((word32) s0_101 + 88);
							if (a5_233 != 0x00)
							{
								a5_233 = (word32) *((word32) s0_101 + 96);
								if (a5_233 != s4_105)
								{
									*((word32) s2_103 + 22) = (byte) s5_106;
									word32 s7_119;
									word32 a3_496;
									ra_116 = txl_frame_send_null_frame(ra_116, (word32) *((word32) s0_101 + 96), s6_107 + 0x0366, fflags, frm, mstatus, dwArg18, dwArg48, dwArg7C, dwArg98, dwArgB8, dwArgD8, dwArg0168, out s0_101, out s1_102, out a0_192, out a3_496, out a4_152, out a5_233, out s2_103, out s3_104, out s4_105, out s5_106, out s6_107, out s7_119);
									if (a0_192 == 0x00)
										s3_104 = (struct Eq_7733 *) ((char *) s3_104 + 1);
									*((word32) s2_103 + 22) = (byte) s7_119;
								}
							}
						}
					}
					s0_128 = *s0_101;
				}
				s1_102->b0071 = (byte) s3_104;
				if (s3_104 != null)
				{
					word32 s1_485;
					word32 a1_486;
					word32 a2_487;
					word32 a3_488;
					word32 s3_492;
					word32 a5_490;
					word32 s2_491;
					word32 a4_489;
					word32 s4_493;
					chan_upd_ctxt_status(a0_192, 0x03, mstatus, out s1_485, out a1_486, out a2_487, out a3_488, out a4_489, out a5_490, out s2_491, out s3_492, out s4_493);
					0x00 = dwArg0128;
					word32 a4_494;
					word32 s2_495;
					mm_active(mstatus, out a4_494, out s2_495);
					return;
				}
			}
		}
	}
	0x00 = dwArg0128;
	chan_pre_switch_channel(ra_116, s1_102, a4_152, s2_103, s3_104, dwArg78, fflags, frm, mstatus, dwArg04, dwArg28, dwArg48, s5, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0138, dwArg0178);
}

// 2301A366: void chan_tx_cfm(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0138, Stack word32 dwArg0178)
void chan_tx_cfm(Eq_2 ra, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg0138, word32 dwArg0178)
{
	if ((word32) g_b42022D81 != 0x00)
	{
		ui32 a5_19 = (word32) g_b42022D81 + ~0x00 & 0x00FF;
		g_b42022D81 = (byte) a5_19;
		if (a5_19 != 0x00)
			return;
		Eq_2 a4_30;
		struct Eq_75438 * s1_36;
		Eq_2 s2_39;
		struct Eq_7733 * s3_40;
		Eq_2 s4_41;
		Eq_2 ra_34 = mm_force_idle_req(ra, a4, mstatus, dwArg08, dwArg10, dwArg14, dwArg38, dwArg5C, dwArgF8, dwArg0108, out s1_36, out a4_30, out s2_39, out s3_40, out s4_41);
		chan_pre_switch_channel(ra_34, s1_36, a4_30, s2_39, s3_40, s4_41, fflags, frm, mstatus, dwArg04, dwArg28, dwArg48, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArgF8, dwArg0138, dwArg0178);
	}
	else
		assert_err();
}

// 2301A3BC: Register Eq_2 chan_ctxt_op_evt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Register out (ptr32 Eq_76073) s0Out, Register out (ptr32 Eq_76074) s2Out)
// Called from:
//      chan_roc_req
Eq_2 chan_ctxt_op_evt(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArgE8, Eq_2 dwArgF8, struct Eq_76073 & s0Out, struct Eq_76074 & s2Out)
{
	struct Eq_76074 * s2_15 = (word32) *((word32) a0 + 22);
	if (s2_15 >= (struct Eq_76074 *) 0x02)
	{
		if (s2_15 > (struct Eq_76074 *) 0x03)
		{
			if (s2_15 == (struct Eq_76074 *) 0x04)
			{
				Eq_2 a0_179;
				struct Eq_76096 * a4_24 = (word32) *((word32) a0 + 23);
				Eq_2 s1_202 = a0;
				struct Eq_76102 * s0_27 = &g_t42022D10;
				if (a4_24 <= (struct Eq_76096 *) 0x02)
				{
					*((word32) a0 + 22) = 0x01;
					up32 a4_185 = (word32) g_b42022D82;
					if (a4_185 != 0x01 && a4_185 > 0x01)
					{
						Eq_2 s2_187 = *(union Eq_2 *) 0x44B00120;
						Eq_2 a4_191;
						word32 a5_437;
						chan_upd_nb_rem_slots.isra.3((word32) a0 + 18, s2_187, out a4_191, out a5_437);
						g_t42022D7C = s2_187;
						Eq_2 a0_194;
						word32 s2_440;
						word32 a4_438;
						word32 a5_439;
						chan_get_next_chan(0x42022D10, a0, a4_191, dwArg18, out a0_194, out a3, out a4_438, out a5_439, out s2_440);
						s1_202 = a0_194;
					}
					a0_179 = s1_202;
				}
				else
				{
					__csrrc(mstatus, 0x08);
					(a4_24 & ~0x02)->dw0004 = a4_24->dw0004;
					__csrrs(mstatus, 0x08);
					word32 a5_422;
					a0_179 = blmac_pwr_mgt_setf((word32) g_b42022D83, out a5_422);
					g_t42022D30.u0 = 0x00;
					struct Eq_76074 * a5_38 = (word32) *((word32) a0 + 23);
					if (a5_38 == (struct Eq_76074 *) 0x03)
					{
						g_b42022D80 = (byte) ((word32) g_b42022D80 & ~0x08);
						word32 s8_434;
						word32 s2_431;
						word32 s3_432;
						word32 s4_433;
						ra = ke_msg_send_basic(ra, 98, 0x02, a4_24 & ~0x02, mstatus, s2, out s0_27, out s1_202, out a0_179, out a3, out s2_431, out s3_432, out s4_433, out s8_434);
					}
					else if (a5_38 == s2_15)
					{
						if ((word32) *((word32) a0 + 0x0E) == 0x00)
							g_b42022D80 = (byte) ((word32) g_b42022D80 & -65);
						g_b42022D80 = (byte) ((word32) g_b42022D80 & ~0x04);
					}
					((word32) s1_202 + 23)->u0 = ~0x00;
					ui32 a5_77 = (word32) s0_27->b0070;
					if ((a5_77 & 3) != 0x00)
					{
						word32 a1_435;
						word32 a4_436;
						s0_27 = chan_conn_less_delay_prog(mstatus, out a0_179, out a1_435, out a4_436);
					}
					else
						s0_27->b0070 = (byte) (a5_77 & ~0x10);
					Eq_2 a4_98 = (word32) s0_27->b0072;
					if (a4_98 != 0x01)
					{
						if (a4_98 <= 0x01)
						{
							word32 s1_441;
							word32 s2_443;
							word32 s3_444;
							word32 s4_445;
							word32 a4_442;
							Eq_2 ra_115 = mm_force_idle_req(ra, a4_98, mstatus, dwLoc08, dwArg00, dwArg04, dwArg28, dwArg4C, dwArgE8, dwArgF8, out s1_441, out a4_442, out s2_443, out s3_444, out s4_445);
							struct Eq_76074 * s2_147;
							s0Out = mm_back_to_host_idle(mstatus, dwArg28, out s2_147);
							s2Out = s2_147;
							return ra_115;
						}
						else
						{
							struct Eq_76073 * s0_164;
							struct Eq_76074 * s2_165;
							word32 a1_447;
							word32 a4_449;
							word32 s3_450;
							word32 a3_448;
							word32 s1_446;
							Eq_2 ra_174 = chan_cde_evt(ra, mstatus, dwArg08, dwArg18, out s0_164, out s1_446, out a1_447, out a3_448, out a4_449, out s2_165, out s3_450);
							s0Out = s0_164;
							s2Out = s2_165;
							return ra_174;
						}
					}
				}
				struct Eq_76073 * s0_235;
				struct Eq_76074 * s2_237;
				word32 s3_429;
				word32 s4_430;
				word32 a5_428;
				word32 a4_427;
				word32 a3_426;
				word32 s1_423;
				word32 a1_424;
				word32 a2_425;
				Eq_2 ra_234 = chan_switch_start(ra, a0_179, a3, mstatus, dwArg08, out s0_235, out s1_423, out a1_424, out a2_425, out a3_426, out a4_427, out a5_428, out s2_237, out s3_429, out s4_430);
				s0Out = s0_235;
				s2Out = s2_237;
				return ra_234;
			}
		}
		else
			g_b42022D80 = (byte) ((word32) g_b42022D80 | 32);
	}
	s0Out = s0;
	s2Out = s2_15;
	return ra;
}

word32 g_dw2301A408 = 2225750530;
// 2301A50E: Register Eq_2 chan_init(Register Eq_2 ra, Stack word32 dwArg0128, Register out ptr32 s0Out)
// Called from:
//      mm_init
Eq_2 chan_init(Eq_2 ra, word32 dwArg0128, ptr32 & s0Out)
{
	Eq_2 s1_29 = 0x42022C84;
	word32 a4_164;
	word32 a5_165;
	word32 a2_162;
	word32 a3_163;
	word32 a1_161;
	word32 a0_160;
	word32 t1_159;
	Eq_2 ra_36 = memset(ra, 0x42022D10, 0x00, 116, out t1_159, out a0_160, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165);
	int32 s2_39;
	for (s2_39 = 0x00; s2_39 != 0x05; ++s2_39)
	{
		Eq_2 a5_56;
		word32 a4_171;
		word32 a3_170;
		word32 a1_168;
		word32 a2_169;
		word32 t1_166;
		word32 a0_167;
		ra_36 = memset(ra_36, s1_29, 0x00, 0x1C, out t1_166, out a0_167, out a1_168, out a2_169, out a3_170, out a4_171, out a5_56);
		*((word32) s1_29 + 0x0E) = 0xFF;
		*((word32) s1_29 + 23) = ~0x00;
		if (s2_39 <= 0x02)
			s1_29 = co_list_push_back(s1_29, a5_56);
		else if (s2_39 == 0x03)
		{
			g_w42022CE2 = 0x00;
			g_b42022CDD = 0x00;
		}
		s1_29 = (word32) s1_29 + 28;
	}
	g_dw23019D60 = 0x42022D10;
	g_dw23019F0E = 0x42022D10;
	g_dw2301A408 = 0x42022D10;
	g_dw42022D50 = 0x00;
	g_dw23019CF2 = 0x42022D10;
	0x00 = dwArg0128;
	s0Out = s4;
	return ra_36;
}

// 2301A5CE: Register (ptr32 Eq_76102) chan_scan_req(Register word32 a0, Register ptr32 a1, Register int32 a2, Register uint32 a3, Register word32 a4, Register ptr32 mstatus, Stack word32 dwArg0128, Register out ptr32 a1Out)
// Called from:
//      scan_set_channel_request
struct Eq_76102 * chan_scan_req(word32 a0, ptr32 a1, int32 a2, uint32 a3, word32 a4, ptr32 mstatus, word32 dwArg0128, ptr32 & a1Out)
{
	if ((word32) g_b42022CEF == 0x00FF)
	{
		g_b42022CF1 = (byte) a4;
		g_w42022CE6 = 0xFF;
		g_w42022CEE = 0x0301;
		ui32 a5_42 = (word32) g_b42022D80;
		g_w42022CEA = (word16) (a3 >> 0x0A);
		g_b42022CDC = (byte) a0;
		g_w42022CE0 = (word16) a1;
		g_w42022CDE = (word16) a1;
		g_b42022CE4 = (byte) a2;
		g_b42022D80 = (byte) (a5_42 | 2);
		if ((a5_42 & 0x10) != 0x00)
		{
			0x00 = dwArg0128;
			a1Out = a1;
			return dwArgE4;
		}
		else
		{
			0x00 = dwArg0128;
			ptr32 a1_64;
			word32 a0_108;
			word32 a4_109;
			struct Eq_76102 * s0_69 = chan_conn_less_delay_prog(mstatus, out a0_108, out a1_64, out a4_109);
			a1Out = a1_64;
			return s0_69;
		}
	}
	else
		assert_err();
}

// 2301A67A: Register Eq_2 chan_roc_req(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_76463) a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Register out Eq_76474 a4Out)
// Called from:
//      mm_remain_on_channel_req_handler
Eq_2 chan_roc_req(Eq_2 ra, Eq_2 s0, struct Eq_76463 * a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg3C, Eq_2 dwArgD8, Eq_2 dwArgE8, union Eq_76474 & a4Out)
{
	up32 s1_13 = (word32) a0->b0000;
	if (s1_13 != 0x00)
	{
		if (s1_13 != 0x01)
		{
l2301A690:
			goto l2301A72A;
		}
		a4 = (word32) g_b42022D0B;
		struct Eq_76495 * s2_109 = &g_t42022C84;
		if (a4 != 0x00FF)
		{
			up32 a5_92 = (word32) g_b42022D0A;
			struct Eq_76628 * s0_120 = &g_t42022D10;
			if (a5_92 <= 0x03)
			{
				if (a5_92 < 0x02)
				{
					if (a5_92 == s1_13)
						g_b42022D80 = (byte) ((word32) g_b42022D80 & ~0x01);
				}
				else
				{
					ui32 a5_133 = (word32) g_b42022D80;
					g_t42022D34.u0 = 0x00;
					g_b42022D80 = (byte) (a5_133 & ~0x04);
				}
			}
			else if (a5_92 == 0x04)
			{
				word32 a5_313;
				word32 a2_312;
				mm_timer_clear(0x42022D58, 0x04, out a2_312, out a5_313);
				ra = chan_ctxt_op_evt(ra, 0x42022CF4, a3, 0x42022C84, mstatus, s2, s0, dwLoc08, dwArg08, dwArg18, dwArg3C, dwArgD8, dwArgE8, out s0_120, out s2_109);
			}
			s2_109->b0087 = ~0x00;
			ui32 a5_144 = (word32) s0_120->b0070;
			a4.u0 = 0x10;
			if ((a5_144 & 18) == 0x10)
			{
				s0_120->b0070 = (byte) (a5_144 & ~0x10);
				word32 a5_311;
				word32 a2_310;
				mm_timer_clear(0x42022D68, 0x10, out a2_310, out a5_311);
				s0_120->b0070 = (byte) ((word32) s0_120->b0070 & ~0x10);
			}
		}
	}
	else
	{
		Eq_2 a3_16 = (word32) g_b42022D0B;
		a4.u0 = 0x00FF;
		if (a3_16 != 0x00FF)
			goto l2301A690;
		g_b42022D0B = 0x04;
		g_b42022CF8 = (byte) (word32) a0->b0002;
		g_b42022CF9 = (byte) (word32) a0->b0003;
		g_w42022CFA = (word16) (word32) a0->w0004;
		g_w42022CFC = (word16) (word32) a0->w0006;
		word32 a4_28 = (word32) a0->w0008;
		g_w42022D02 = (word16) a1;
		g_w42022CFE = (word16) a4_28;
		g_b42022D0A = 0x01;
		struct Eq_76545 * a0_34 = *((word32) a3_16 + 0x0C);
		Mem38[0x42022D06:word16] = SLICE(a3_16 + 1000 >>u 0x0A, word16, 0);
		g_b42022D0D = (byte) (word32) a0_34->b0001;
		g_b42022D00 = (byte) (int32) a0_34->b0010;
		a4 = (word32) g_b42022D80;
		if (a1 == 0x00)
		{
			g_b42022D80 = (byte) (a4 | 4);
			a4 |= 4;
			if (g_t42022D34 == 0x00)
			{
				word32 s4_307;
				word32 s3_306;
				word32 s2_305;
				word32 a5_304;
				word32 a3_303;
				word32 a2_302;
				word32 a1_301;
				word32 s1_300;
				word32 s0_299;
				ra = chan_switch_start(ra, 0x42022CF4, a3_16, mstatus, dwLoc08, out s0_299, out s1_300, out a1_301, out a2_302, out a3_303, out a4, out a5_304, out s2_305, out s3_306, out s4_307);
				goto l2301A72A;
			}
		}
		else
		{
			g_b42022D80 = (byte) (a4 | 1);
			if ((a4 & 16) == 0x00)
			{
				word32 a1_309;
				word32 a0_308;
				chan_conn_less_delay_prog(mstatus, out a0_308, out a1_309, out a4);
l2301A72A:
				0x00 = dwArg38;
				a4Out = a4;
				return ra;
			}
		}
	}
	goto l2301A72A;
}

