pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301A7EE: Register word32 chan_ctxt_add(Register Eq_2 a0, Register (ptr32 byte) a1, Register Eq_2 a4, Stack Eq_2 dwArgA8, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_37316) s3Out, Register out ptr32 s5Out, Register out Eq_37318 s6Out)
// Called from:
//      vif_mgmt_switch_channel
//      me_add_chan_ctx
//      sm_add_chan_ctx
//      apm_start_cac_req_handler
word32 chan_ctxt_add(Eq_2 a0, byte * a1, Eq_2 a4, Eq_2 dwArgA8, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a4Out, ptr32 & s2Out, struct Eq_37316 & s3Out, ptr32 & s5Out, union Eq_37318 & s6Out)
{
	struct Eq_37316 * s3_152 = &g_t42022C84;
	ptr32 s2_151;
	for (s2_151 = 0x00; s2_151 != 0x03; ++s2_151)
	{
		Eq_2 a0_140;
		Eq_2 a5_32 = (word32) s3_152->b0017;
		if (a5_32 != 0x00FF)
		{
			word32 a2_163;
			word32 a1_162;
			word32 a3_164;
			a0_140 = memcmp(a0, (char *) s3_152 + 4, 0x08, out a1_162, out a2_163, out a3_164, out a4, out a5_32);
			if (a0_140 == 0x00)
			{
				*a1 = (byte) s2_151;
				goto l2301A832;
			}
		}
		++s3_152;
	}
	word32 a5_165;
	Eq_2 a0_57 = co_list_pop_front(a4, a5_32, out a5_165);
	a4 = a0_57;
	a0_140.u0 = 0x01;
	if (a0_57 != 0x00)
	{
		ui32 a5_69 = (a0_57 - 0x42022C84 >> 2) + 3067833783 & 0x00FF;
		((word32) a0_57 + 23)->u0 = (byte) a5_69;
		*a1 = (byte) a5_69;
		*((word32) a0_57 + 4) = (byte) (word32) *a0;
		*((word32) a0_57 + 5) = (byte) (word32) *((word32) a0 + 1);
		*((word32) a0_57 + 8) = (word16) (word32) *((word32) a0 + 4);
		*((word32) a0_57 + 0x0A) = (word16) (word32) *((word32) a0 + 6);
		*((word32) a0_57 + 6) = (word16) (word32) *((word32) a0 + 2);
		*((word32) a0_57 + 0x0C) = (byte) (int32) *((word32) a0 + 8);
		a0_140.u0 = 0x00;
	}
l2301A832:
	0x00 = (int8) dwArgA8;
	s1Out = a0;
	a0Out = a0_140;
	a4Out = a4;
	s2Out = s2_151;
	s3Out = s3_152;
	s5Out = 0x03;
	s6Out.u0 = 0x00FF;
	return s1;
}

// 2301A8B2: Register Eq_2 chan_ctxt_del(Register Eq_2 ra, Register (ptr32 Eq_76827) a0, Stack Eq_2 dwArg38, Register out (ptr32 Eq_76829) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      chan_ctxt_unlink
Eq_2 chan_ctxt_del(Eq_2 ra, struct Eq_76827 * a0, Eq_2 dwArg38, struct Eq_76829 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	if ((word32) a0->b42022CB7 != 0x00FF)
	{
		Eq_2 a5_31 = (word32) a0->b42022CB8;
		if (a5_31 == 0x00)
		{
			struct Eq_76829 * a1_48;
			ptr32 a3_50;
			ptr32 a4_51;
			word32 t1_77;
			word32 a0_78;
			word32 a2_79;
			word32 a5_80;
			Eq_2 ra_53 = memset(ra, co_list_push_back((char *) a0 + 0x42022CA0, a5_31), 0x00, 0x1C, out t1_77, out a0_78, out a1_48, out a2_79, out a3_50, out a4_51, out a5_80);
			a0->w42022CAE = 0xFF;
			a0->b42022CB7 = ~0x00;
			0x00 = (int8) dwArg38;
			a1Out = a1_48;
			a3Out = a3_50;
			a4Out = a4_51;
			return ra_53;
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 2301A95A: Register Eq_2 chan_ctxt_update(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack word32 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0148, Register out (ptr32 Eq_76913) a4Out, Register out ptr32 s3Out)
// Called from:
//      mm_hw_config_handler
Eq_2 chan_ctxt_update(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, Eq_2 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, word32 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0148, struct Eq_76913 & a4Out, ptr32 & s3Out)
{
	struct Eq_76915 * a4_11 = (word32) *a0;
	Eq_2 a3_13 = (word32) *((word32) a0 + 1);
	a4_11->b42022CA4 = (byte) a3_13;
	a4_11->b42022CA5 = (byte) (word32) *((word32) a0 + 2);
	a4_11->w42022CA8 = (word16) (word32) *((word32) a0 + 6);
	a4_11->w42022CAA = (word16) (word32) *((word32) a0 + 8);
	a4_11->w42022CA6 = (word16) (word32) *((word32) a0 + 4);
	a4_11->b42022CAC = (byte) (int32) *((word32) a0 + 0x0A);
	if (g_t42022D30 != (char *) a4_11 + 0x42022CA0)
	{
		a4Out = (struct Eq_76913 *) &g_t42023000;
		s3Out = s3;
		return ra;
	}
	else
	{
		__csrrc(mstatus, 0x08);
		Eq_2 a4_39;
		Eq_2 s3_45;
		Eq_2 s4_46;
		Eq_2 s8_47;
		struct Eq_76983 * s0_63;
		ptr32 fflags_76;
		ptr32 frm_77;
		struct Eq_7733 * s3_81;
		Eq_2 ra_62 = rxl_cntrl_evt(ra, rxl_timer_int_handler(a0, a1, mstatus, out a4_39, out s3_45, out s4_46, out s8_47), a1, a3_13, a4_39, s3_45, s4_46, s5, s6, s7, s8_47, s10, s11, fflags, frm, mstatus, s0, dwLoc08, dwArg14, dwArg18, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg64, dwArg68, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out s0_63, out s3_81, out fflags_76, out frm_77);
		__csrrs(mstatus, 0x08);
		ptr32 fflags_103;
		ptr32 frm_104;
		ptr32 s3_110;
		word32 s0_215;
		word32 s1_216;
		word32 s2_217;
		Eq_2 ra_105 = phy_set_channel(ra_62, (word32) s0_63->b0001, (word32) s0_63->b0002, (word32) s0_63->w0006, s3_81, fflags_76, frm_77, s0, dwArg14, dwArg0148, out s0_215, out s1_216, out s2_217, out s3_110, out fflags_103, out frm_104);
		struct Eq_76913 * a4_134;
		word32 a5_218;
		tpc_update_tx_power(ra_105, fflags_103, frm_104, out a4_134, out a5_218);
		a4Out = a4_134;
		s3Out = s3_110;
		return ra_105;
	}
}

// 2301A9FA: Register Eq_2 chan_tbtt_switch_update(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register (ptr32 Eq_20916) a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_20939) s0Out, Register out (ptr32 Eq_20940) s1Out, Register out Eq_2 a1Out, Register out Eq_20942 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out (ptr32 Eq_20946) s4Out, Register out Eq_20947 s5Out, Register out ptr32 s6Out, Register out Eq_20949 s7Out, Register out (ptr32 Eq_20950) s9Out, Register out (ptr32 Eq_20951) s10Out)
// Called from:
//      mm_tbtt_evt
//      mm_sta_tbtt
//      rxl_cntrl_evt
Eq_2 chan_tbtt_switch_update(Eq_2 ra, Eq_2 a1, Eq_2 a3, struct Eq_20916 * a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgA8, Eq_2 dwArg0118, Eq_2 dwArg0178, struct Eq_20939 & s0Out, struct Eq_20940 & s1Out, union Eq_2 & a1Out, union Eq_20942 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, struct Eq_20946 & s4Out, union Eq_20947 & s5Out, ptr32 & s6Out, union Eq_20949 & s7Out, struct Eq_20950 & s9Out, struct Eq_20951 & s10Out)
{
	if (a5 != null && (word32) a5->b0016 != 0x00)
	{
		a1 = (word32) a1 - 0x00FFF9C4;
		struct Eq_77060 * a0_11 = *(struct Eq_77060 **) 0xFF000684;
		if (a1 != 0x00)
		{
			*((word32) a1 - 0x00FFF97C) = a0_11;
			a4 = (word32) g_b42022D82;
			if (a4 > 0x01)
			{
				a4 = (word32) a0_11->b004E;
				if (a4 != 0x02)
				{
					a0_11->b004E = 0x00;
					word32 a5_150;
					co_list_extract(0x42022D20, (char *) a0_11 + 0x0044, a4, 0x02, out a5_150);
					Eq_2 a1_39;
					Eq_20942 a2_40;
					Eq_2 a4_41;
					struct Eq_20939 * s0_44;
					struct Eq_20940 * s1_45;
					struct Eq_20951 * s10_46;
					ptr32 s3_49;
					struct Eq_20946 * s4_50;
					Eq_20947 s5_51;
					ptr32 s6_52;
					Eq_20949 s7_53;
					struct Eq_20950 * s9_55;
					Eq_2 a3_58;
					word32 s2_151;
					Eq_2 ra_59 = chan_tbtt_schedule(ra, (char *) a0_11 + 0x0044, (char *) a0_11 + 0x0044, a3, a4, mstatus, dwArg08, dwArgA8, dwArg0118, dwArg0178, out s0_44, out s1_45, out a1_39, out a2_40, out a3_58, out a4_41, out s2_151, out s3_49, out s4_50, out s5_51, out s6_52, out s7_53, out s9_55, out s10_46);
					s0Out = s0_44;
					s1Out = s1_45;
					a1Out = a1_39;
					a2Out = a2_40;
					a3Out = a3_58;
					a4Out = a4_41;
					s3Out = s3_49;
					s4Out = s4_50;
					s5Out = s5_51;
					s6Out = s6_52;
					s7Out = s7_53;
					s9Out = s9_55;
					s10Out = s10_46;
					return ra_59;
				}
			}
		}
	}
	s0Out = s0;
	s1Out = s1;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

