pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301AF10: void hal_dma_init()
// Called from:
//      mm_init
void hal_dma_init()
{
	co_list_init(&g_t42022D84);
	g_w42022D9C = *(word16 *) 0x44A000A4;
	co_list_init(&g_t42022D8C);
	g_w42022D9E = *(word16 *) 0x44A000AC;
}

// 2301AF52: void hal_dma_push(Register (ptr32 Eq_48384) s0, Register Eq_2 a1, Register word32 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
// Called from:
//      scanu_start
void hal_dma_push(struct Eq_48384 * s0, Eq_2 a1, word32 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 s1_13 = a1;
	Eq_2 a0_14 = s0->t0004;
	if (a5 != 0x00)
	{
		ui32 a5_19 = (word32) *((word32) a1 + 588036304);
		s0->w000A = (word16) (a5_19 << 8 | (a5_19 | 16) | 0x01000000);
		__csrrc(mstatus, 0x08);
		s1_13 = co_list_push_back(a0_14, a1 << 0x03);
		__csrrs(mstatus, 0x08);
		a1 = a0_14;
		a0_14 = (a1 << 0x03) + 0x42022D84;
	}
	else
		s0->w000A = 0x00;
	Eq_5849 a0_56;
	word32 a6_141;
	word32 a7_142;
	word32 a1_139;
	word32 a5_140;
	Eq_2 a4_102;
	Eq_2 a3_47;
	Eq_2 a2_46;
	memcpy(a0_14, a1, (word32) s0->w0008, out a1_139, out a2_46, out a3_47, out a4_102, out a5_140, out a6_141, out a7_142);
	if (s1_13 != 0x00)
	{
		Eq_2 a5_57 = 0x01;
		if (s1_13 != 0x01)
		{
			while (true)
			{
				word32 s4_151;
				word32 s3_150;
				word32 s1_143;
				word32 a1_145;
				word32 a4_147;
				word32 s2_149;
				word32 a0_144;
				word32 a2_146;
				word32 a5_148;
				word32 a0_152;
				word32 a1_153;
				word32 s4_154;
				word32 s8_155;
				puts((word32) vTaskDelay(1000, a2_46, a3_47, a4_102, a5_57, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_143, out a0_144, out a1_145, out a2_146, out a3_47, out a4_147, out a5_148, out s2_149, out s3_150, out s4_151) - 428, out a0_152, out a1_153, out a2_46, out a4_102, out a5_57, out s4_154, out s8_155);
			}
		}
		a0_56.u0 = 0x10000000;
	}
	else
		a0_56.u0 = 64;
	word32 a5_156;
	ke_evt_set(a0_56, a4_102, mstatus, out a5_156);
}

// 2301AFE2: void hal_dma_evt(Register word32 a0, Register Eq_2 a4, Register ptr32 mstatus)
void hal_dma_evt(word32 a0, Eq_2 a4, ptr32 mstatus)
{
	Eq_5849 a0_12;
	if (a0 == 0x00)
		a0_12.u0 = 64;
	else
		a0_12.u0 = 0x10000000;
	ke_evt_clear(a0_12, a4, mstatus);
	__csrrc(mstatus, 0x08);
	Eq_2 a5_24 = 0x42022D84;
	while (true)
	{
		Eq_2 a0_30 = co_list_pop_front(a4, a5_24, out a5_24);
		__csrrs(mstatus, 0x08);
		if (a0_30 == 0x00)
			break;
		if (a5_24 != 0x00)
			a5_24();
		__csrrc(mstatus, 0x08);
	}
}

// 2301B034: Register Eq_2 hal_mib_dump(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 s10Out)
// Called from:
//      bl60x_fw_dump_statistic
//      cmd_wifi_mib
Eq_2 hal_mib_dump(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & s10Out)
{
	word32 a0_71;
	word32 a1_72;
	word32 a2_73;
	word32 a4_74;
	word32 a5_75;
	word32 s4_76;
	word32 s8_77;
	puts(587914876, out a0_71, out a1_72, out a2_73, out a4_74, out a5_75, out s4_76, out s8_77);
	ptr32 s10_34;
	word32 s1_78;
	word32 a0_79;
	word32 a1_80;
	word32 a2_81;
	word32 a3_82;
	word32 a4_83;
	word32 a5_84;
	word32 a7_85;
	word32 s2_86;
	word32 s3_87;
	word32 s4_88;
	word32 s5_89;
	word32 s6_90;
	word32 s7_91;
	word32 s8_92;
	word32 s9_93;
	word32 s11_94;
	word32 t4_95;
	Eq_2 ra_32 = printf(ra, &g_t230ADEA4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_78, out a0_79, out a1_80, out a2_81, out a3_82, out a4_83, out a5_84, out a7_85, out s2_86, out s3_87, out s4_88, out s5_89, out s6_90, out s7_91, out s8_92, out s9_93, out s10_34, out s11_94, out t4_95);
	ptr32 a0_50;
	word32 a1_96;
	word32 a2_97;
	word32 a4_98;
	word32 a5_99;
	word32 s4_100;
	word32 s8_101;
	s1Out = puts(0x230C6900, out a0_50, out a1_96, out a2_97, out a4_98, out a5_99, out s4_100, out s8_101);
	a0Out = a0_50;
	s10Out = s10_34;
	return ra_32;
}

// 2301B06A: void mm_monitor_channel_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack word32 dwArg0148)
void mm_monitor_channel_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, word32 dwArg0148)
{
	Eq_2 a0_18;
	word32 a1_19;
	struct Eq_78132 * a2_20;
	struct Eq_7733 * s3_29;
	word32 s1_151;
	word32 a4_152;
	word32 a5_153;
	word32 s0_150;
	word32 a6_154;
	word32 s2_155;
	word32 s4_156;
	word32 s8_157;
	word32 a3_21;
	Eq_2 ra_25 = ke_msg_alloc(ra, 95, a3, 40, a4, mstatus, dwArg08, out s0_150, out s1_151, out a0_18, out a1_19, out a2_20, out a3_21, out a4_152, out a5_153, out a6_154, out s2_155, out s3_29, out s4_156, out s8_157);
	*(union Eq_2 *) 0x01 = a0_18;
	*(union Eq_2 *) 0x1111111D = a0_18;
	*(union Eq_2 *) 0x22222232 = a0_18;
	*(union Eq_2 *) 0x33333347 = a0_18;
	*(union Eq_2 *) 0x4444445C = a0_18;
	*(union Eq_2 *) 0x55555571 = a0_18;
	*(union Eq_2 *) 0x66666686 = a0_18;
	*((word32) a0_18 + 8) = 0x00;
	*(union Eq_2 *) 0x7777779B = a0_18;
	a2_20->t0004 = a0_18;
	word32 a2_66 = (word32) (word16) a2_20;
	if (a1_19 != 0x00)
	{
		a3_21 = a2_66 + 0x0A;
		if (false)
			a3_21 = a2_66 + -0x0A;
	}
	Eq_2 s0_97;
	word32 s1_158;
	word32 s2_159;
	word32 s3_160;
	word32 fflags_161;
	word32 frm_162;
	phy_set_channel(ra_25, 0x00, (word32) (a1_19 != 0x00), (word32) (word16) a3_21, s3_29, fflags, frm, s0, dwArg14, dwArg0148, out s0_97, out s1_158, out s2_159, out s3_160, out fflags_161, out frm_162);
	*s0_97 = 0x00;
	word32 s1_163;
	word32 a0_164;
	word32 a1_165;
	word32 a2_166;
	word32 a3_167;
	word32 a4_168;
	word32 a5_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s8_173;
	ke_msg_send(s0_97, mstatus, out s1_163, out a0_164, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out s2_170, out s3_171, out s4_172, out s8_173);
}

// 2301B116: void mm_monitor_enable_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg0108)
void mm_monitor_enable_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg0108)
{
	Eq_2 a0_18;
	word32 s0_178;
	word32 s1_179;
	word32 a1_180;
	word32 a2_181;
	word32 a3_182;
	word32 a4_183;
	word32 a5_184;
	word32 a6_185;
	word32 s2_186;
	word32 s3_187;
	word32 s4_188;
	word32 s8_189;
	Eq_2 ra_25 = ke_msg_alloc(ra, 93, a3, 40, a4, mstatus, dwLoc38, out s0_178, out s1_179, out a0_18, out a1_180, out a2_181, out a3_182, out a4_183, out a5_184, out a6_185, out s2_186, out s3_187, out s4_188, out s8_189);
	*(union Eq_2 *) 0x01 = a0_18;
	*(union Eq_2 *) 0x1111111D = a0_18;
	*(union Eq_2 *) 0x22222232 = a0_18;
	*(union Eq_2 *) 0x33333347 = a0_18;
	*(union Eq_2 *) 0x4444445C = a0_18;
	*(union Eq_2 *) 0x55555571 = a0_18;
	*(union Eq_2 *) 0x66666686 = a0_18;
	*((word32) a0_18 + 8) = 0x00;
	*(union Eq_2 *) 0x7777779B = a0_18;
	Eq_2 s1_60 = *(union Eq_2 *) 0x77777777;
	*(union Eq_2 *) 0x7777777B = a0_18;
	struct Eq_7733 * s3_88;
	word32 t1_190;
	word32 a0_191;
	word32 a1_192;
	word32 a2_193;
	word32 a3_194;
	word32 a4_195;
	word32 a5_196;
	word32 s0_197;
	word32 s1_198;
	word32 s2_199;
	word32 s3_200;
	word32 fflags_201;
	word32 frm_202;
	phy_set_channel(phy_init(memset(ra_25, fp + -80, 0x00, 64, out t1_190, out a0_191, out a1_192, out a2_193, out a3_194, out a4_195, out a5_196), s1_60, dwLoc18, out s3_88), 0x00, null, 16775557, s3_88, fflags, frm, dwLoc4C, s0, dwArg0108, out s0_197, out s1_198, out s2_199, out s3_200, out fflags_201, out frm_202);
	word32 a4_203;
	word32 s2_204;
	Eq_2 s0_140 = mm_active(mstatus, out a4_203, out s2_204);
	*s0_140 = 0x00;
	word32 s1_205;
	word32 a0_206;
	word32 a1_207;
	word32 a2_208;
	word32 a3_209;
	word32 a4_210;
	word32 a5_211;
	word32 s2_212;
	word32 s3_213;
	word32 s4_214;
	word32 s8_215;
	ke_msg_send(s0_140, mstatus, out s1_205, out a0_206, out a1_207, out a2_208, out a3_209, out a4_210, out a5_211, out s2_212, out s3_213, out s4_214, out s8_215);
}

// 2301B1C4: void mm_cfg_rssi_req_handler(Register (ptr32 Eq_78387) a1, Stack word32 dwArg38)
void mm_cfg_rssi_req_handler(struct Eq_78387 * a1, word32 dwArg38)
{
	struct Eq_78389 * s1_13 = (word32) a1->b0000;
	if ((word32) s1_13->b420205A6 == 0x00)
	{
		s1_13->b420205C6 = (byte) (int32) a1->b0001;
		word32 a4_34 = (word32) a1->b0002;
		s1_13->b420205C8 = 0x00;
		s1_13->b420205C7 = (byte) a4_34;
		0x00 = dwArg38;
	}
	else
		assert_err();
}

// 2301B236: void mm_set_ps_options_req_handler(Register Eq_2 ra, Register (ptr32 Eq_78425) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack word32 dwArg0128)
void mm_set_ps_options_req_handler(Eq_2 ra, struct Eq_78425 * a1, Eq_2 a3, ptr32 mstatus, word32 dwArg0128)
{
	struct Eq_78429 * s1_15 = (word32) a1->b0000;
	if ((word32) s1_15->b420205A6 == 0x00)
	{
		s1_15->w420205AC = (word16) (word32) a1->w0002;
		Eq_2 a4_42 = (word32) a1->b0004;
		s1_15->b420205AE = (byte) a4_42;
		word32 s0_81;
		word32 s1_82;
		word32 a0_83;
		word32 a3_84;
		word32 s2_85;
		word32 s3_86;
		word32 s4_87;
		word32 s8_88;
		ke_msg_send_basic(ra, 76, a3, a4_42, mstatus, dwLoc28, out s0_81, out s1_82, out a0_83, out a3_84, out s2_85, out s3_86, out s4_87, out s8_88);
		0x00 = dwArg0128;
	}
	else
		assert_err();
}

