pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301B2BA: void mm_tim_update_req_handler(Register Eq_2 a1)
void mm_tim_update_req_handler(Eq_2 a1)
{
	mm_tim_update(a1);
}

// 2301B2CC: void mm_bcn_change_req_handler(Register Eq_2 ra, Register (ptr32 Eq_25127) a1, Register (ptr32 Eq_25266) a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118)
void mm_bcn_change_req_handler(Eq_2 ra, struct Eq_25127 * a1, struct Eq_25266 * a4, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg7C, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0118)
{
	mm_bcn_change(ra, a1, a4, s3, s5, s6, fflags, frm, mstatus, dwArg08, dwArg7C, dwArgB8, dwArgE8, dwArg0118);
}

// 2301B2DE: void mm_remain_on_channel_req_handler(Register Eq_2 ra, Register (ptr32 Eq_76463) a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack word32 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8)
void mm_remain_on_channel_req_handler(Eq_2 ra, struct Eq_76463 * a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, word32 dwArg18, Eq_2 dwArg1C, Eq_2 dwArgB8, Eq_2 dwArgC8)
{
	Eq_2 a4_24;
	Eq_2 ra_35 = chan_roc_req(ra, a3, a1, a3, a3, s2, mstatus, s2, dwLoc08, dwArg18, dwArg1C, dwArgB8, dwArgC8, out a4_24);
	if (a3 != 0x00)
	{
		Eq_2 a0_51;
		byte * s1_60;
		word32 s2_61;
		word32 s3_143;
		word32 a6_142;
		word32 a5_141;
		word32 a4_140;
		word32 a3_139;
		word32 a2_138;
		word32 a1_137;
		word32 s0_136;
		word32 s4_144;
		word32 s8_145;
		ke_msg_alloc(ra_35, 71, a3, 0x03, a4_24, mstatus, dwLoc08, out s0_136, out s1_60, out a0_51, out a1_137, out a2_138, out a3_139, out a4_140, out a5_141, out a6_142, out s2_61, out s3_143, out s4_144, out s8_145);
		word32 a4_69 = (word32) *s1_60;
		*((word32) a0_51 + 1) = (byte) s2_61;
		*a0_51 = (byte) a4_69;
		*((word32) a0_51 + 2) = 0x04;
		word32 s1_146;
		word32 a0_147;
		word32 a1_148;
		word32 a2_149;
		word32 a3_150;
		word32 a4_151;
		word32 a5_152;
		word32 s2_153;
		word32 s3_154;
		word32 s4_155;
		word32 s8_156;
		ke_msg_send(a0_51, mstatus, out s1_146, out a0_147, out a1_148, out a2_149, out a3_150, out a4_151, out a5_152, out s2_153, out s3_154, out s4_155, out s8_156);
	}
}

// 2301B32C: void mm_sta_del_req_handler(Register Eq_2 ra, Register word32 s1, Register (ptr32 byte) a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack word32 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void mm_sta_del_req_handler(Eq_2 ra, word32 s1, byte * a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, word32 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	Eq_2 a3_18;
	Eq_2 a4_19;
	word32 s0_78;
	word32 s1_79;
	word32 a0_80;
	word32 a3_81;
	word32 s2_82;
	word32 s3_83;
	word32 s4_84;
	word32 s8_85;
	ke_msg_send_basic(mm_sta_del(ra, s1, (word32) *a1, s2, mstatus, dwArg28, dwArg38, ra, dwArg88, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out a3_18, out a4_19), 0x0D, a3_18, a4_19, mstatus, dwLoc18, out s0_78, out s1_79, out a0_80, out a3_81, out s2_82, out s3_83, out s4_84, out s8_85);
}

// 2301B350: void mm_sta_add_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
void mm_sta_add_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	word32 a0_18;
	Eq_2 a4_22;
	Eq_2 a5_23;
	struct Eq_21638 * s1_27;
	Eq_2 s2_28;
	Eq_2 s0_49;
	word32 a0_68;
	word32 s0_110;
	word32 a1_111;
	word32 a2_112;
	word32 a3_113;
	word32 a6_114;
	word32 s3_115;
	word32 s4_116;
	word32 s8_117;
	word32 s4_118;
	word32 s5_119;
	mm_sta_add(ke_msg_alloc(ra, 11, a3, 0x03, a4, mstatus, dwArg08, out s0_110, out s1_27, out a0_18, out a1_111, out a2_112, out a3_113, out a4_22, out a5_23, out a6_114, out s2_28, out s3_115, out s4_116, out s8_117), s1_27, s1_27, a0_18 + 1, a4_22, a5_23, s2_28, s7, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgE8, dwArg0108, out s0_49, out a0_68, out s4_118, out s5_119);
	*s0_49 = (byte) a0_68;
	word32 s1_120;
	word32 a0_121;
	word32 a1_122;
	word32 a2_123;
	word32 a3_124;
	word32 a4_125;
	word32 a5_126;
	word32 s2_127;
	word32 s3_128;
	word32 s4_129;
	word32 s8_130;
	ke_msg_send(s0_49, mstatus, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129, out s8_130);
}

// 2301B38A: void mm_key_del_req_handler(Register Eq_2 ra, Register (ptr32 byte) a1, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg0108)
void mm_key_del_req_handler(Eq_2 ra, byte * a1, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg0108)
{
	if ((word32) (*(union Eq_19650 *) 0x44B000D8 >> 24) + 1 >= (word32) (*a1))
	{
		Eq_2 a4_33;
		word32 a2_83;
		word32 s2_84;
		word32 s3_85;
		word32 s6_86;
		word32 s0_87;
		word32 s1_88;
		word32 a0_89;
		word32 a3_90;
		word32 s2_91;
		word32 s3_92;
		word32 s4_93;
		word32 s8_94;
		ke_msg_send_basic(ra, 39, mm_sec_machwkey_del((word32) *a1, dwArg0108, out a2_83, out a4_33, out s2_84, out s3_85, out s6_86), a4_33, mstatus, dwLoc08, out s0_87, out s1_88, out a0_89, out a3_90, out s2_91, out s3_92, out s4_93, out s8_94);
		0x00 = dwArg38;
	}
	else
		assert_err();
}

// 2301B3E8: void mm_key_add_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgF8)
void mm_key_add_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgF8)
{
	struct Eq_21047 * s0_26;
	word32 s1_111;
	word32 a0_112;
	word32 a1_113;
	word32 a2_114;
	word32 a3_115;
	word32 a4_116;
	word32 a5_117;
	word32 a6_118;
	word32 s2_119;
	word32 s3_120;
	word32 s4_121;
	word32 s8_122;
	Eq_2 ra_25 = ke_msg_alloc(ra, 37, a3, 0x02, a4, mstatus, dwArg08, out s0_26, out s1_111, out a0_112, out a1_113, out a2_114, out a3_115, out a4_116, out a5_117, out a6_118, out s2_119, out s3_120, out s4_121, out s8_122);
	if ((word32) s0_26->b0000 <= 0x03)
	{
		if ((word32) s0_26->b0004 <= 32)
		{
			if ((word32) s0_26->b0028 <= 0x05)
			{
				word32 a0_59;
				Eq_2 s1_69;
				word32 s0_123;
				word32 a3_124;
				word32 a4_125;
				word32 a5_126;
				word32 s2_127;
				word32 s3_128;
				word32 s4_129;
				word32 s5_130;
				mm_sec_machwkey_wr(ra_25, s0_26, dwArgF8, out s0_123, out s1_69, out a0_59, out a3_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129, out s5_130);
				*((word32) s1_69 + 1) = (byte) a0_59;
				*s1_69 = 0x00;
				word32 s1_131;
				word32 a0_132;
				word32 a1_133;
				word32 a2_134;
				word32 a3_135;
				word32 a4_136;
				word32 a5_137;
				word32 s2_138;
				word32 s3_139;
				word32 s4_140;
				word32 s8_141;
				ke_msg_send(s1_69, mstatus, out s1_131, out a0_132, out a1_133, out a2_134, out a3_135, out a4_136, out a5_137, out s2_138, out s3_139, out s4_140, out s8_141);
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

