pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301B488: void mm_set_power_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg38)
void mm_set_power_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg38)
{
	struct Eq_8454 * a0_21;
	Eq_2 a3_24;
	struct Eq_78906 * s1_30;
	struct Eq_78907 * s2_31;
	word32 s0_100;
	word32 a1_101;
	word32 a2_102;
	word32 a4_103;
	word32 a5_104;
	word32 a6_105;
	word32 s3_106;
	word32 s4_107;
	word32 s8_108;
	Eq_2 ra_28 = ke_msg_alloc(ra, 47, a3, 0x02, a4, mstatus, dwArg08, out s0_100, out s1_30, out a0_21, out a1_101, out a2_102, out a3_24, out a4_103, out a5_104, out a6_105, out s2_31, out s3_106, out s4_107, out s8_108);
	s1_30->b420205AA = (byte) (int32) s2_31->b0001;
	a0_21->b0001 = (byte) (int32) s1_30->b420205A9;
	s1_30->b420205A9 = 0x7F;
	word32 s1_109;
	word32 a3_110;
	word32 a4_111;
	word32 s2_112;
	word32 s3_113;
	word32 s1_114;
	word32 a0_115;
	word32 a1_116;
	word32 a2_117;
	word32 a3_118;
	word32 a4_119;
	word32 a5_120;
	word32 s2_121;
	word32 s3_122;
	word32 s4_123;
	word32 s8_124;
	ke_msg_send(tpc_update_vif_tx_power(ra_28, (char *) s1_30 + 0x42020550, &a0_21->b0001, a0_21, a3_24, fflags, frm, out s1_109, out a3_110, out a4_111, out s2_112, out s3_113), mstatus, out s1_114, out a0_115, out a1_116, out a2_117, out a3_118, out a4_119, out a5_120, out s2_121, out s3_122, out s4_123, out s8_124);
	0x00 = dwArg38;
}

// 2301B4EE: void mm_set_idle_req_handler(Register Eq_2 ra, Register (ptr32 byte) a1, Register Eq_2 a2, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18)
void mm_set_idle_req_handler(Eq_2 ra, byte * a1, Eq_2 a2, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18)
{
	word32 a0_19;
	word32 s2_188;
	word32 a4_187;
	word32 a2_186;
	ke_state_get(a2, dwArg18, out a0_19, out a2_186, out a4_187, out s2_188);
	if (a0_19 == 0x03)
		return;
	Eq_2 a4_46;
	Eq_2 s2_51;
	word32 a4_28 = (word32) *a1;
	g_t4201E9A6 = (byte) a4_28;
	if (a4_28 != 0x00)
	{
		word32 a0_56;
		word32 a2_192;
		Eq_2 s1_60 = ke_state_get(a2, dwArg18, out a0_56, out a2_192, out a4_46, out s2_51);
		if (a0_56 != 0x00)
		{
			if (a0_56 != 0x02)
			{
				hal_machw_idle_req(1107421572, a4_46, mstatus);
				word32 s1_193;
				word32 a0_194;
				word32 a1_195;
				word32 a4_196;
				word32 a5_197;
				word32 s2_198;
				word32 s3_199;
				word32 s4_200;
				ke_state_set(a2, 0x02, mstatus, out s1_193, out a0_194, out a1_195, out a4_196, out a5_197, out s2_198, out s3_199, out s4_200);
			}
			return;
		}
		if ((*(ui32 *) 0x44B00038 & 0x0F) != 0x00)
			assert_err();
		((word32) s1_60 + 18)->u2 = 0x00;
	}
	else
	{
		word32 a0_34;
		word32 a4_190;
		word32 s2_191;
		word32 a2_189;
		ke_state_get(a2, dwArg18, out a0_34, out a2_189, out a4_190, out s2_191);
		if (a0_34 == 0x02)
			return;
		mm_active(mstatus, out a4_46, out s2_51);
	}
	word32 s0_201;
	word32 s1_202;
	word32 a0_203;
	word32 a3_204;
	word32 s2_205;
	word32 s3_206;
	word32 s4_207;
	word32 s8_208;
	ke_msg_send_basic(ra, 35, s2_51, a4_46, mstatus, s2, out s0_201, out s1_202, out a0_203, out a3_204, out s2_205, out s3_206, out s4_207, out s8_208);
}

// 2301B594: void mm_reset_req_handler(Register Eq_2 ra, Register ui32 s0, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack word32 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArgF8, Stack Eq_2 dwArg0148)
void mm_reset_req_handler(Eq_2 ra, ui32 s0, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, word32 dwArgD8, Eq_2 dwArgE8, word32 dwArgF8, Eq_2 dwArg0148)
{
	__csrrc(mstatus, 0x08);
	hal_machw_stop(s0);
	phy_stop();
	ui32 s0_24;
	Eq_2 a3_36;
	Eq_2 a4_37;
	word32 s0_125;
	Eq_2 ra_41 = mm_init(me_init(ra, mstatus, out s0_24), s0_24, mstatus, dwLoc18, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg68, ra, dwArg7C, dwArg8C, dwArgD8, dwArgE8, dwArgF8, dwArg0148, out s0_125, out a3_36, out a4_37);
	__csrrs(mstatus, 0x08);
	word32 s0_126;
	word32 s1_127;
	word32 a0_128;
	word32 a3_129;
	word32 s2_130;
	word32 s3_131;
	word32 s4_132;
	word32 s8_133;
	ke_msg_send_basic(ra_41, 0x01, a3_36, a4_37, mstatus, dwLoc18, out s0_126, out s1_127, out a0_128, out a3_129, out s2_130, out s3_131, out s4_132, out s8_133);
	word32 s1_134;
	word32 a0_135;
	word32 a1_136;
	word32 a4_137;
	word32 a5_138;
	word32 s2_139;
	word32 s3_140;
	word32 s4_141;
	ke_state_set(0x00, 0x00, mstatus, out s1_134, out a0_135, out a1_136, out a4_137, out a5_138, out s2_139, out s3_140, out s4_141);
}

// 2301B5D0: void mm_version_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void mm_version_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_14;
	struct Eq_79204 * a4_18;
	word32 s0_69;
	word32 s1_70;
	word32 a1_71;
	word32 a2_72;
	word32 a3_73;
	word32 a5_74;
	word32 a6_75;
	word32 s2_76;
	word32 s3_77;
	word32 s4_78;
	word32 s8_79;
	ke_msg_alloc(ra, 0x05, a3, 0x18, a4, mstatus, dwArg08, out s0_69, out s1_70, out a0_14, out a1_71, out a2_72, out a3_73, out a4_18, out a5_74, out a6_75, out s2_76, out s3_77, out s4_78, out s8_79);
	*(union Eq_2 *) 0x05040000 = a0_14;
	Eq_2 a5_34 = a4_18->t0004;
	a4_18->t0004 = a0_14;
	*((word32) a0_14 + 4104) = *((word32) a5_34 + 8);
	phy_get_version((word32) a0_14 + 0x0C, (word32) a0_14 + 16);
	*(union Eq_2 *) 0x08FFF9F3 = a0_14;
	word32 s1_80;
	word32 a0_81;
	word32 a1_82;
	word32 a2_83;
	word32 a3_84;
	word32 a4_85;
	word32 a5_86;
	word32 s2_87;
	word32 s3_88;
	word32 s4_89;
	word32 s8_90;
	ke_msg_send(a0_14, mstatus, out s1_80, out a0_81, out a1_82, out a2_83, out a3_84, out a4_85, out a5_86, out s2_87, out s3_88, out s4_89, out s8_90);
}

