pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301B618: void mm_start_req_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack word32 dwArg0148)
void mm_start_req_handler(Eq_2 ra, Eq_2 s0, Eq_2 a2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg28, word32 dwArg38, word32 dwArg0148)
{
	word32 a0_19;
	word32 a2_179;
	word32 a4_180;
	word32 s2_181;
	Eq_2 s1_23 = ke_state_get(a2, dwArg28, out a0_19, out a2_179, out a4_180, out s2_181);
	if (a0_19 == 0x00)
	{
		struct Eq_7733 * s3_43;
		ptr32 fflags_67;
		ptr32 frm_68;
		Eq_2 s2_73;
		word32 s0_182;
		word32 s1_183;
		word32 s3_184;
		Eq_2 ra_69 = phy_set_channel(phy_init(ra, s1_23, dwArg28, out s3_43), 0x00, null, 0x00FFF96C, s3_43, fflags, frm, s0, dwArg14, dwArg0148, out s0_182, out s1_183, out s2_73, out s3_184, out fflags_67, out frm_68);
		struct Eq_79326 * a5_95;
		word32 a4_185;
		tpc_update_tx_power(ra_69, fflags_67, frm_68, out a4_185, out a5_95);
		struct Eq_79332 * s1_100 = a5_95->ptr0040;
		g_ptr4201F9FC = (char *) &a5_95->ptr0040 + 936;
		Eq_2 a4_108 = (word32) s1_100->w0044;
		g_w4201F9A4 = (word16) a4_108;
		Eq_2 a3_115;
		word32 s0_186;
		word32 s1_187;
		word32 a0_188;
		word32 s2_189;
		word32 s3_190;
		word32 s4_191;
		word32 s8_192;
		ke_msg_send_basic(ra_69, 0x03, s2_73, a4_108, mstatus, dwLoc08, out s0_186, out s1_187, out a0_188, out a3_115, out s2_189, out s3_190, out s4_191, out s8_192);
		Eq_2 a4_133;
		word32 s2_193;
		Eq_2 s0_136 = mm_active(mstatus, out a4_133, out s2_193);
		hal_machw_idle_req(a3_115, a4_133, mstatus);
		word32 s1_194;
		word32 a0_195;
		word32 a1_196;
		word32 a4_197;
		word32 a5_198;
		word32 s2_199;
		word32 s3_200;
		word32 s4_201;
		ke_state_set(s0_136, 0x02, mstatus, out s1_194, out a0_195, out a1_196, out a4_197, out a5_198, out s2_199, out s3_200, out s4_201);
		0x00 = dwArg38;
	}
	else
		assert_err();
}

// 2301B6AE: void mm_set_ps_mode_req_handler(Register Eq_2 ra, Register word32 s0, Register (ptr32 byte) a1, Register word32 a3, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0168)
void mm_set_ps_mode_req_handler(Eq_2 ra, word32 s0, byte * a1, word32 a3, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0168)
{
	ui32 a0_9 = (word32) *a1;
	if (a0_9 == 0x03)
	{
		Eq_2 s0_48 = g_t42020B30;
		while (s0_48 != 0x00)
		{
			if ((word32) *((word32) s0_48 + 86) == 0x00 && (word32) (*((word32) s0_48 + 88)) != 0x00)
				ra = ps_polling_frame(ra, fflags, frm, mstatus, dwLoc08, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0118, out s0_48, out a4);
			s0_48 = *s0_48;
		}
		word32 s0_225;
		word32 s1_226;
		word32 a0_227;
		word32 a3_228;
		word32 s2_229;
		word32 s3_230;
		word32 s4_231;
		word32 s8_232;
		ke_msg_send_basic(ra, 50, (word32) g_w4201E9DE, a4, mstatus, dwLoc08, out s0_225, out s1_226, out a0_227, out a3_228, out s2_229, out s3_230, out s4_231, out s8_232);
	}
	else
		ps_set_mode(ra, a0_9, a3, fflags, frm, mstatus, dwLoc10, s0, dwArg18, dwArg38, dwArg48, dwArg7C, dwArg98, dwArgB8, dwArgD8, dwArg0168);
}

// 2301B702: void mm_force_idle_req_handler(Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_force_idle_req_handler(Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_15;
	Eq_2 a4_17;
	word32 a2_117;
	word32 s2_118;
	Eq_2 s1_19 = ke_state_get(a2, dwArg28, out a0_15, out a2_117, out a4_17, out s2_118);
	if (a0_15 == 0x00)
	{
		if ((*(ui32 *) 0x44B00038 & 0x0F) == 0x00)
		{
			word32 a0_33;
			<anonymous> * a5_36;
			word32 a1_45;
			word32 s1_127;
			word32 a4_128;
			word32 s2_129;
			word32 s3_130;
			word32 s4_131;
			ke_state_set(s1_19, 0x03, mstatus, out s1_127, out a0_33, out a1_45, out a4_128, out a5_36, out s2_129, out s3_130, out s4_131);
			a5_36();
		}
		else
			assert_err();
	}
	else if (a0_15 != 0x02)
	{
		hal_machw_idle_req(a3, a4_17, mstatus);
		word32 s1_119;
		word32 a0_120;
		word32 a1_121;
		word32 a4_122;
		word32 a5_123;
		word32 s2_124;
		word32 s3_125;
		word32 s4_126;
		ke_state_set(s1_19, 0x02, mstatus, out s1_119, out a0_120, out a1_121, out a4_122, out a5_123, out s2_124, out s3_125, out s4_126);
	}
}

// 2301B766: void mm_hw_config_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack word32 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118, Stack word32 dwArg0128)
void mm_hw_config_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, word32 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArg0118, word32 dwArg0128)
{
	Eq_2 s0_144 = a1;
	Eq_2 s3_136 = a3;
	word32 a0_33;
	Eq_79582 s2_38;
	word32 a2_1296;
	Eq_2 a4_154;
	Eq_2 s1_37 = ke_state_get(a2, dwArg08, out a0_33, out a2_1296, out a4_154, out s2_38);
	if (a0_33 != 0x00)
	{
		if ((word32) (word16) (a0_33 + ~0x01) > 0x01)
		{
			g_b4201E997 = (byte) (*(ui32 *) 0x44B00038 & 0x0F);
			word32 a0_758;
			Eq_2 a4_760;
			word32 a2_1297;
			word32 s2_1298;
			Eq_2 s1_762 = ke_state_get(s1_37, dwArg08, out a0_758, out a2_1297, out a4_760, out s2_1298);
			g_t4201E996 = (byte) a0_758;
			hal_machw_idle_req(a3, a4_760, mstatus);
			word32 s4_1306;
			word32 s3_1305;
			word32 s2_1304;
			word32 a1_1301;
			word32 a4_1302;
			word32 a5_1303;
			word32 s1_1299;
			word32 a0_1300;
			ke_state_set(s1_762, 0x02, mstatus, out s1_1299, out a0_1300, out a1_1301, out a4_1302, out a5_1303, out s2_1304, out s3_1305, out s4_1306);
		}
		goto l2301B968;
	}
	if ((*(ui32 *) 0x44B00038 & 0x0F) != 0x00)
		assert_err();
	Eq_2 s1_594;
	struct Eq_79650 * s4_597;
	Eq_2 a1_177;
	Eq_2 a0_178;
	if (s2_38 == 22)
	{
		a4_154 = g_t42022D30;
		struct Eq_79659 * s0_54 = *a3;
		*((word32) a3 + 4) = ((word32) *((word32) a1 + 5) + 0x04 << 2) + 1107421572;
		if (a4_154 != 0x00)
		{
			a4_154 = (word32) *((byte) a4_154.u0 + 4);
			if (a4_154 == (word32) s0_54->b0005)
			{
				*(word32 *) 0x44B000DC = 0x10;
				a4_154.u0 = 0x10;
			}
		}
		a1_177 = a3;
		a0_178.u0 = 0x17;
		goto l2301B92C;
	}
	Eq_2 a0_197;
	if (s2_38 <= 22)
	{
		if (s2_38 == 0x0E)
		{
			int32 a4_417 = g_dw4201E988;
			g_dw4201E984 = 0x0E;
			(a4_417 | 0x0E)->dw0060 = 0x44B00000;
			a4_154.u0 = 0x44B00000;
			a1_177 = a3;
			a0_178.u0 = 0x0F;
			goto l2301B92C;
		}
		Eq_2 s2_489;
		if (s2_38 <= 0x0E)
		{
			if (s2_38 != 0x06)
			{
				if (s2_38 != 0x08)
					goto l2301B7E6;
				struct Eq_36534 * a0_603 = (word32) *a1;
				if (a0_603 <= (struct Eq_36534 *) 0x01)
					ra = vif_mgmt_unregister(ra, s1_37, a0_603, a3, a4_154, 0x01, mstatus, dwLoc18, dwArg10, dwArg14, dwArg48, s3, out a4_154, out s3_136);
				if (g_t42020B30 == 0x00)
					a4_154 = hal_machw_monitor_mode(a4_154);
				a1_177 = s3_136;
				a0_178.u0 = 0x09;
l2301B92C:
				word32 s8_1353;
				word32 s3_1352;
				word32 a0_1349;
				word32 a3_1350;
				word32 s2_1351;
				word32 s0_1348;
				ke_msg_send_basic(ra, a0_178, a1_177, a4_154, mstatus, s6, out s0_1348, out s1_594, out a0_1349, out a3_1350, out s2_1351, out s3_1352, out s4_597, out s8_1353);
				goto l2301B930;
			}
			struct Eq_79706 * s0_538;
			Eq_2 s1_539;
			word32 s8_1317;
			word32 s4_1316;
			word32 a6_1313;
			word32 s2_1314;
			word32 s3_1315;
			word32 a4_1311;
			word32 a5_1312;
			word32 a2_1309;
			word32 a3_1310;
			word32 a1_1308;
			word32 a0_1307;
			*s2_489 = (byte) vif_mgmt_register(ke_msg_alloc(ra, 0x07, a3, 0x02, a4_154, mstatus, dwLoc18, out s0_538, out s1_539, out a0_1307, out a1_1308, out a2_1309, out a3_1310, out a4_1311, out a5_1312, out a6_1313, out s2_1314, out s3_1315, out s4_1316, out s8_1317), s1_539, &s0_538->b0000 + 1, (word32) s0_538->b0000, (word32) s0_538->b0007, mstatus, dwLoc18, dwArg10, dwArg14, s3, out s2_489);
l2301B840:
			a0_197 = s2_489;
			goto l2301B842;
		}
		if (s2_38 == 0x12)
		{
			*(int32 *) 0x44B00090 = (word32) *a1 | *((int32 *) 0x44B00090) & -0x0100;
			int32 a4_433 = *(int32 *) 0x44B00090;
			*(int32 *) 0x44B00090 = a4_433 | 0x80000000;
			a1_177 = a3;
			a4_154 = a4_433 | 0x80000000;
			a0_178.u0 = 0x13;
			goto l2301B92C;
		}
		if (s2_38 == 0x14)
		{
			struct Eq_79956 * a5_440 = (word32) *((word32) a1 + 2);
			uint32 a1_445 = (word32) *a1;
			if ((word32) a5_440->b420205A6 == 0x00)
			{
				word32 a4_452 = (word32) a5_440->b420205B0;
				((Eq_582596[]) 4)[a1_445].dw0000 = a4_452 + 1107422224;
				a4_154 = a4_452 + 432;
			}
			else
				a4_154 = vif_mgmt_set_ap_bcn_int((char *) a5_440 + 0x42020550, a1_445, mstatus);
			a1_177 = a3;
			a0_178.u0 = 0x15;
			goto l2301B92C;
		}
		if (s2_38 == 0x10)
		{
			Eq_2 a0_470;
			struct Eq_79975 * s0_478;
			struct Eq_7733 * s3_481;
			word32 s8_1334;
			word32 s2_1332;
			word32 s4_1333;
			word32 a6_1331;
			word32 a5_1330;
			word32 a4_1329;
			word32 a3_1328;
			word32 a2_1327;
			word32 s1_1325;
			word32 a1_1326;
			Eq_2 ra_477 = ke_msg_alloc(ra, 0x11, a3, 0x02, a4_154, mstatus, dwLoc18, out s0_478, out s1_1325, out a0_470, out a1_1326, out a2_1327, out a3_1328, out a4_1329, out a5_1330, out a6_1331, out s2_1332, out s3_481, out s4_1333, out s8_1334);
			s2_489 = a0_470;
			if ((word32) s0_478->b0008 != 0x00)
			{
				word32 frm_1339;
				word32 s1_1336;
				word32 s3_1337;
				word32 fflags_1338;
				word32 s0_1335;
				phy_set_channel(ra_477, (word32) s0_478->b0000, (word32) s0_478->b0001, (word32) s0_478->w0004, s3_481, fflags, frm, s8, dwLoc0C, dwArg0128, out s0_1335, out s1_1336, out s2_489, out s3_1337, out fflags_1338, out frm_1339);
			}
			goto l2301B840;
		}
	}
	else
	{
		if (s2_38 == 0x1E)
		{
			struct Eq_79791 * s7_70 = (word32) *((word32) a1 + 3);
			Eq_2 a4_77 = (word32) s7_70->b420205A6;
			if (a4_77 == 0x00)
			{
				if ((word32) *((word32) a1 + 2) != 0x00)
				{
					struct Eq_80297 * a5_85 = (word32) s7_70->b420205B0;
					struct Eq_80302 * s2_103;
					struct Eq_80303 * s4_105;
					struct Eq_80304 * s8_106;
					word32 a0_1376;
					word32 s1_1375;
					word32 a1_1377;
					word32 a2_1378;
					word32 s3_1381;
					word32 a5_1380;
					word32 a4_1379;
					Eq_2 s0_101 = mm_timer_set((char *) s7_70 + 1107428712, (word32) *(union Eq_2 *) 0x44B00120 + a5_85->dw4201EC14, 432, mstatus, out s1_1375, out a0_1376, out a1_1377, out a2_1378, out a4_1379, out a5_1380, out s2_103, out s3_1381, out s4_105, out s8_106);
					word32 a5_109 = (word32) *s0_101;
					int32 a4_110 = a5_85->dw4201EC14;
					s2_103->w005C = 0x00;
					a5_85->w4201EC28 = (word16) a5_109;
					word32 a5_113 = (word32) s4_105->w0020;
					s2_103->b005E = 0x00;
					a5_85->w4201EC26 = (word16) (a5_113 + 0x14 + a4_110 >> 1000000);
					int32 a5_122 = s8_106->dw0120;
					s2_103->b0074 = 0x00;
					s2_103->dw0070 = 0x00;
					s2_103->dw0064 = a5_122;
					s2_103->dw0004 |= 1;
					s2_103->dw006C = s8_106->dw0120;
					ra = chan_bcn_detect_start(ra, s0_101, mstatus, out s0_144, out a3, out s3_136);
				}
				else
				{
					word32 a5_1374;
					word32 a2_1373;
					mm_timer_clear((char *) s7_70 + 1107428712, a4_77, out a2_1373, out a5_1374);
				}
			}
			a4_154 = (word32) *((word32) s0_144 + 2);
			s7_70->b420205A8 = (byte) a4_154;
			if (a4_154 != 0x00)
			{
				*(union Eq_2 *) 0x44B00200 = a3;
				*(union Eq_2 *) 0x44B00204 = a3;
				struct Eq_80407 * a5_164 = *((word32) a3 + 20);
				*(union Eq_2 *) 0x44B00208 = a3;
				*(union Eq_2 *) 0x44B0020C = a5_164->t0014;
				a4_154 = mm_env_max_ampdu_duration_set();
			}
			a1_177 = s3_136;
			a0_178.u0 = 0x1F;
			goto l2301B92C;
		}
		if (s2_38 <= 0x1E)
		{
			if (s2_38 == 0x1A)
			{
				struct Eq_79809 * s5_273 = (word32) *((word32) a1 + 6);
				struct Eq_79659 * s0_278 = *a3;
				*((word32) a3 + 8) = ((char *) s5_273 + 374 + (word32) (*((word32) a1 + 5)) << 2) + 1107427192;
				a4_154 = (char *) s5_273 + 0x42020550;
				Eq_2 a5_288 = (word32) s5_273->b420205A8;
				if (a5_288 != 0x00)
				{
					word32 a4_289 = (word32) s0_278->b0005;
					s0_278 = (struct Eq_79659 *) *a5_288;
					if (a4_289 != 0x01)
					{
						if (a4_289 != 0x00)
						{
							if (a4_289 != 0x02)
								*(union Eq_2 *) 0x44B0020C = a5_288;
							else
								*(union Eq_2 *) 0x44B00208 = a5_288;
						}
						else
							*(union Eq_2 *) 0x44B00200 = a5_288;
					}
					else
						*(union Eq_2 *) 0x44B00204 = a5_288;
					a4_154 = mm_env_max_ampdu_duration_set();
				}
				if ((word32) s5_273->b420205A6 == 0x00)
					a4_154 = ps_uapsd_set((char *) s5_273 + 0x42020550, (word32) s0_278->b0005, (word32) s0_278->b0004, a4_154, mstatus, out s3_136);
				a1_177 = s3_136;
				a0_178.u0 = 0x1B;
				goto l2301B92C;
			}
			if (s2_38 == 0x1C)
			{
				ui32 a5_345 = (word32) *a1;
				struct Eq_79848 * a5_348 = a5_345 << 0x0E & 0x003E0000;
				if (a5_348 != null)
					assert_err();
				(a5_348 & ~0x1C000000 | a5_345 << 0x0E)->dw004C = a5_348->dw004C;
				a4_154.u0 = ~0x1C000000;
				a1_177 = a3;
				a0_178.u0 = 0x1D;
				goto l2301B92C;
			}
			if (s2_38 == 0x18)
			{
				word32 a7_1324;
				word32 a5_1322;
				word32 a6_1323;
				word32 a4_1321;
				word32 a3_1320;
				word32 a2_1319;
				word32 a1_1318;
				memcpy((word32) *((word32) a1 + 6) + 0x42020588, a1, 0x06, out a1_1318, out a2_1319, out a3_1320, out a4_1321, out a5_1322, out a6_1323, out a7_1324);
				a4_154.u0 = 0x01;
				if (g_b42020B38 + g_b42020B39 == 0x01)
				{
					((word32) *((word32) a1 + 3) << 24 | (((word32) (*((word32) a1 + 1)) << 8 | (word32) (*a1)) | (word32) (*((word32) a1 + 2)) << 16))->dw0020 = 0x44B00000;
					((word32) *((word32) a1 + 5) << 8 | (word32) (*((word32) a1 + 4)))->dw0024 = 0x44B00000;
					a4_154.u0 = 0x44B00000;
				}
				a1_177 = a3;
				a0_178.u0 = 0x19;
				goto l2301B92C;
			}
		}
		else
		{
			if (s2_38 == 40)
			{
				struct Eq_80143 * a5_180 = (word32) *a1;
				if (a5_180 != null)
				{
					a4_154 = a5_180->t0054;
					(a5_180 | 0x0080)->t0054 = a4_154;
				}
				word32 s8_1363;
				struct Eq_80179 * s0_205;
				word32 s2_207;
				word32 a5_1359;
				word32 a4_1358;
				word32 s4_1362;
				word32 s3_1361;
				word32 a3_1357;
				word32 a6_1360;
				word32 a1_1355;
				word32 s1_1354;
				word32 a2_1356;
				ke_msg_alloc(ra, 41, a3, 0x03, a4_154, mstatus, dwLoc18, out s0_205, out s1_1354, out a0_197, out a1_1355, out a2_1356, out a3_1357, out a4_1358, out a5_1359, out a6_1360, out s2_207, out s3_1361, out s4_1362, out s8_1363);
				*a0_197 = (byte) (word32) s0_205->b0001;
				word32 a4_217 = (word32) s0_205->b0002;
				*((word32) a0_197 + 2) = (byte) s2_207;
				*((word32) a0_197 + 1) = (byte) a4_217;
l2301B842:
				word32 a3_1367;
				word32 a1_1365;
				word32 a0_1364;
				word32 a2_1366;
				word32 s2_1370;
				word32 s3_1371;
				word32 a4_1368;
				word32 s8_1372;
				word32 a5_1369;
				ke_msg_send(a0_197, mstatus, out s1_594, out a0_1364, out a1_1365, out a2_1366, out a3_1367, out a4_1368, out a5_1369, out s2_1370, out s3_1371, out s4_597, out s8_1372);
l2301B930:
				ui32 s2_720 = (word32) s4_597->b0013;
				if ((s2_720 << 4 & -0x00F1) != 0x00)
					assert_err();
				*(ui32 *) 0x44B00038 = s2_720 << 4;
				word32 s4_1347;
				word32 s3_1346;
				word32 s2_1345;
				word32 a5_1344;
				word32 a4_1343;
				word32 a1_1342;
				word32 a0_1341;
				word32 s1_1340;
				ke_state_set(s1_594, (word32) s4_597->b0012, mstatus, out s1_1340, out a0_1341, out a1_1342, out a4_1343, out a5_1344, out s2_1345, out s3_1346, out s4_1347);
l2301B968:
				0x00 = dwArg0128;
				return;
			}
			if (s2_38 == 59)
			{
				Eq_2 s3_243;
				ra = chan_ctxt_update(ra, a1, a1, a1, s5, s6, s7, s10, s11, fflags, frm, mstatus, s0, dwLoc18, dwArg08, dwArg0C, dwArg18, dwArg28, dwArg34, dwArg38, dwArg48, s7, s5, s3, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0118, out a4_154, out s3_243);
				a1_177 = s3_243;
				a0_178.u0 = 60;
				goto l2301B92C;
			}
			if (s2_38 == 32)
			{
				ui32 a3_263 = (word32) *a1;
				*(union Eq_19395 *) 0x44B000E8 = a3_263 + (*((union Eq_19347 *) 0x44B000E4) & 0x00FF) << 8 | a3_263;
				a4_154.u0 = 0x44B00000;
				a1_177 = a3;
				a0_178.u0 = 33;
				goto l2301B92C;
			}
		}
	}
l2301B7E6:
	assert_err();
}

// 2301BCB4: void bl60x_edca_get(Register int32 a0, Register (ptr32 byte) a1, Register (ptr32 byte) a2, Register (ptr32 byte) a3, Register (ptr32 word16) a4)
// Called from:
//      wifi_edca_dump_cmd
void bl60x_edca_get(int32 a0, byte * a1, byte * a2, byte * a3, word16 * a4)
{
	Eq_2 a5_10;
	if (a0 != 0x01)
	{
		if (a0 <= 0x01)
		{
			if (a0 != 0x00)
				return;
			Eq_2 a5_35 = *(union Eq_2 *) 0x44B00200;
			*a4 = (word16) (a5_35 >> 0x0C);
			*a3 = (byte) (a5_35 >> 0x08 & 0x0F);
			*a2 = (byte) (a5_35 >> 0x04 & 0x0F);
			*a1 = (byte) (a5_35 & 0x0F);
			return;
		}
		if (a0 != 0x02)
		{
			if (a0 != 0x03)
				return;
			a5_10 = *(union Eq_2 *) 0x44B0020C;
		}
		else
			a5_10 = *(union Eq_2 *) 0x44B00208;
	}
	else
		a5_10 = *(union Eq_2 *) 0x44B00204;
	*a4 = (word16) (a5_10 >> 0x0C);
	*a3 = (byte) (a5_10 >> 0x08 & 0x0F);
	*a2 = (byte) (a5_10 >> 0x04 & 0x0F);
	*a1 = (byte) (a5_10 & 0x0F);
}

