pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301BD3E: void rx_swdesc_init()
// Called from:
//      rxl_init
void rx_swdesc_init()
{
	g_dw42041004 = 0x42022DA4;
	g_dw42041088 = 0x42022DA4;
	g_dw4204110C = 0x42022DA4;
	g_dw42041190 = 0x42022DA4;
	g_dw42022E28 = 0x42041190;
	g_dw42022E48 = 0x420411F4;
	g_dw42022E68 = 0x42041258;
	g_dw42022E88 = 0x420412BC;
	g_dw42022EA8 = 0x42041320;
	g_dw42022EC8 = 0x42041384;
	g_dw42022EE8 = 0x420413E8;
	g_dw42022F08 = 0x4204144C;
	g_dw42022F28 = 0x420414B0;
}

// 2301BDDC: void scan_cancel_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18)
void scan_cancel_req_handler(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18)
{
	word32 a0_9;
	Eq_2 a4_11;
	word32 a2_77;
	word32 s2_78;
	ke_state_get(0x02, dwArg18, out a0_9, out a2_77, out a4_11, out s2_78);
	if (a0_9 != 0x00)
		g_b4201FA53 = 0x01;
	else
		scan_send_cancel_cfm(ra, a3, a4_11, mstatus, dwLoc18);
}

// 2301BE08: void scan_start_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack word32 dwArgE8)
void scan_start_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, word32 dwArg38, word32 dwArgE8)
{
	Eq_2 a0_22;
	word32 a2_126;
	word32 s0_123;
	word32 s1_124;
	word32 a1_125;
	word32 a3_127;
	word32 a4_128;
	word32 a5_129;
	word32 a6_130;
	word32 s2_131;
	word32 s3_132;
	word32 s4_133;
	word32 s8_134;
	ke_msg_alloc(ra, 0x00FFF801, a3, 0x01, a4, mstatus, dwArg08, out s0_123, out s1_124, out a0_22, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129, out a6_130, out s2_131, out s3_132, out s4_133, out s8_134);
	Eq_2 s0_40 = a0_22;
	word32 a0_42;
	word32 s2_47;
	word32 a2_135;
	word32 a4_136;
	Eq_2 s1_46 = ke_state_get(0x02, dwArg28, out a0_42, out a2_135, out a4_136, out s2_47);
	if (a0_42 == 0x00)
	{
		if ((word32) *((word32) s1_46 + 335) == 0x00)
			assert_err();
		*a0_22 = 0x00;
		*((word32) s1_46 + 16) = 1107421752;
		g_b4201EA52 = 0x00;
		g_w4201EA50 = (word16) s2_47;
		s0_40 = scan_ie_download(&g_t4201EA38, mstatus, dwArgE8);
	}
	else
		*a0_22 = 0x08;
	word32 s1_137;
	word32 a0_138;
	word32 a1_139;
	word32 a2_140;
	word32 a3_141;
	word32 a4_142;
	word32 a5_143;
	word32 s2_144;
	word32 s3_145;
	word32 s4_146;
	word32 s8_147;
	ke_msg_send(s0_40, mstatus, out s1_137, out a0_138, out a1_139, out a2_140, out a3_141, out a4_142, out a5_143, out s2_144, out s3_145, out s4_146, out s8_147);
	0x00 = dwArg38;
}

// 2301BE88: void mm_scan_channel_end_ind_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack word32 dwArg0108)
void mm_scan_channel_end_ind_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg28, word32 dwArg0108)
{
	struct Eq_80690 * a0_9;
	word32 a2_178;
	word32 a4_179;
	word32 s2_180;
	ke_state_get(0x02, dwArg28, out a0_9, out a2_178, out a4_179, out s2_180);
	if (a0_9 == (struct Eq_80690 *) 0x03)
	{
		Eq_2 a4_23 = *(union Eq_2 *) 0x07;
		*(union Eq_2 *) 0x07 = a4_23;
		(*a4_23 | 0x03)->dw0060 = 0x44B00000;
		struct Eq_80717 * a4_35 = a0_9->ptr0010;
		uint32 a3_38 = (word32) a0_9->b014F;
		uint32 a5_39 = (word32) g_b4201EA52 + 0x01 & 0x00FF;
		a4_35->b001A = (byte) a5_39;
		if (a5_39 < a3_38)
		{
			struct Eq_29878 * a5_41 = (word32) a4_35->b001B;
			if (a5_41 == null)
			{
				word32 a0_186;
				word32 a4_187;
				scan_set_channel_request(a5_41, mstatus, dwArg0108, out a0_186, out a4_187);
				return;
			}
		}
		Eq_2 a4_48;
		word32 s1_181;
		word32 a3_182;
		word32 a5_183;
		word32 s2_184;
		word32 s4_185;
		Eq_2 s0_51 = ke_msg_free((char *) a0_9 - 0x0C, mstatus, out s1_181, out a3_182, out a4_48, out a5_183, out s2_184, out s4_185);
		Eq_2 a1_60 = (word32) *((word32) s0_51 + 24);
		if ((word32) *((word32) s0_51 + 27) != 0x00)
			scan_send_cancel_cfm(ra, a1_60, a4_48, mstatus, dwLoc08)->b001B = 0x00;
		else
		{
			word32 s0_188;
			word32 s1_189;
			word32 a0_190;
			word32 a3_191;
			word32 s2_192;
			word32 s3_193;
			word32 s4_194;
			word32 s8_195;
			ke_msg_send_basic(ra, 0x00FFF802, a1_60, a4_48, mstatus, dwLoc08, out s0_188, out s1_189, out a0_190, out a3_191, out s2_192, out s3_193, out s4_194, out s8_195);
		}
		word32 s1_196;
		word32 a0_197;
		word32 a1_198;
		word32 a4_199;
		word32 a5_200;
		word32 s2_201;
		word32 s3_202;
		word32 s4_203;
		ke_state_set(0x02, 0x00, mstatus, out s1_196, out a0_197, out a1_198, out a4_199, out a5_200, out s2_201, out s3_202, out s4_203);
	}
	else
		assert_err();
}

// 2301BF3A: void mm_scan_channel_start_ind_handler(Register Eq_2 ra, Register ptr32 s0, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0118)
void mm_scan_channel_start_ind_handler(Eq_2 ra, ptr32 s0, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0118)
{
	word32 a0_14;
	word32 a2_138;
	word32 a4_139;
	word32 s2_140;
	Eq_2 s1_18 = ke_state_get(0x02, dwArg28, out a0_14, out a2_138, out a4_139, out s2_140);
	if (a0_14 == 0x02)
	{
		Eq_2 a4_28 = *(union Eq_2 *) 0x06;
		*(union Eq_2 *) 0x02000206 = a4_28;
		(*a4_28 | 0x02000202)->dw0060 = 0x44B00000;
		if (((word32) (s0 + ((word32) s1_18 + 6))->b0003 & 0x01) == 0x00)
			scan_probe_req_tx(ra, (word32) s1_18 + 6, s5, fflags, frm, mstatus, dwLoc08, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0118);
		word32 s1_141;
		word32 a0_142;
		word32 a1_143;
		word32 a4_144;
		word32 a5_145;
		word32 s2_146;
		word32 s3_147;
		word32 s4_148;
		ke_state_set(0x02, 0x03, mstatus, out s1_141, out a0_142, out a1_143, out a4_144, out a5_145, out s2_146, out s3_147, out s4_148);
	}
	else
		assert_err();
}

// 2301BFBA: void txl_buffer_reinit()
// Called from:
//      txl_reset
//      txl_buffer_init
void txl_buffer_reinit()
{
	g_t42022FFC.u0 = 0x00;
	g_t42023000.u0 = 0x00;
}

// 2301BFCC: void txl_buffer_init(Register (ptr32 Eq_8437) a0, Stack word32 dwArg0128)
// Called from:
//      txl_cntrl_init
void txl_buffer_init(struct Eq_8437 * a0, word32 dwArg0128)
{
	txl_buffer_reinit();
	struct Eq_80915 * s0_13 = g_a4204443C;
	do
	{
		s0_13->dw0000 = 3135023902;
		ui32 a0_39 = phy_get_ntx(a0);
		((Eq_582598[]) 4)[a0_39].ptr0000.dw0000 = s0_13;
		struct Eq_80928 * a0_47 = 0x01 << phy_get_ntx(a0_39 << 0x0E) + 0x01;
		a0_47->ptr0007 = s0_13;
		s0_13->dw000C = 0x00;
		s0_13->dw0010 = 0xF0000704;
		s0_13->dw0014 = 0x00;
		s0_13->dw0018 = 0x00;
		s0_13->dw001C = 0x00;
		s0_13->dw0020 = 0x00;
		++s0_13;
		s0_13->dw0FE8 = *(int32 *) 0x44B000A0 & 0x00FF;
		s0_13->dw0FEC = *(int32 *) 0x44B000A0 & 0x00FF;
		s0_13[0x0044] = (struct Eq_80915) (*(int32 *) 0x44B000A0 & 0x00FF);
		int32 a5_68 = *(int32 *) 0x44B000A0;
		s0_13->dw0FF8 = 0x02000200;
		s0_13->dw0FFC = 0x003F0000;
		s0_13->dw0FF4 = a5_68 & 0x00FF;
		a0 = (struct Eq_8437 *) ((char *) a0_47 - 1);
	} while (s0_13 != g_a42044694);
	struct Eq_81007 * s0_110 = g_a420443C4;
	do
	{
		s0_110->dw0000 = 3135023902;
		ui32 a0_90 = phy_get_ntx(a0);
		((Eq_582612[]) 4)[a0_90].ptr0000.dw0000 = s0_110;
		struct Eq_81020 * a0_98 = 0x01 << phy_get_ntx(a0_90 << 0x0E) + 0x01;
		a0_98->ptr0007 = s0_110;
		s0_110->dw000C = 0x00;
		*(struct Eq_81007 **) 0xF0000714 = s0_110;
		s0_110->dw0014 = 0x00;
		s0_110->dw0018 = 0x00;
		s0_110->dw001C = 0x00;
		s0_110->dw0020 = 0x00;
		int32 a5_109 = *(int32 *) 0x44B000A0;
		++s0_110;
		s0_110->dw0FEC = 0x00;
		s0_110->dw0FE8 = a5_109 & 0x00FF;
		s0_110[0x0044] = (struct Eq_81007) 0x00;
		s0_110->dw0FF4 = 0x00;
		s0_110->dw0FF8 = 0x00;
		s0_110->dw0FFC = 0x003F0000;
		a0 = (struct Eq_8437 *) ((char *) a0_98 - 1);
	} while (s0_110 != g_a4204443C);
	0x00 = dwArg0128;
}

// 2301C112: void txl_buffer_reset()
// Called from:
//      txl_cntrl_flush_ac
void txl_buffer_reset()
{
	g_t42022FFC.u0 = 0x00;
	g_t42023000.u0 = 0x00;
}

