pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301C124: Register (ptr32 Eq_6750) txl_buffer_alloc(Register (ptr32 Eq_6750) a0, Register Eq_2 a1, Register word32 a2, Register out ptr32 a2Out, Register out (ptr32 Eq_33487) a3Out, Register out ptr32 a5Out)
// Called from:
//      txl_cntrl_push
struct Eq_6750 * txl_buffer_alloc(struct Eq_6750 * a0, Eq_2 a1, word32 a2, ptr32 & a2Out, struct Eq_33487 & a3Out, ptr32 & a5Out)
{
	int32 a4_11 = (word32) a0->b005E;
	a0->b01B8 = (byte) a2;
	a0->dw00D4 = (a4_11 + 0x0F & ~0x0F) - a4_11;
	a0->dw0104 = ~0x35010521;
	ui32 a5_22 = (word32) a0->w0032;
	a0->dw00D0 = a4_11;
	if ((a5_22 & 0x08) == 0x00)
		a1 = txu_cntrl_frame_build(a0, &a0->b01B8 + 96 + a4_11 / 441, out a2);
	Eq_2 s0_41 = *((word32) a1 + 84);
	int32 a5_42;
	for (a5_42 = 0x00; a5_42 != 60; a5_42 += 0x04)
	{
		struct Eq_33487 * a3_49 = (word32) s0_41 + a5_42;
		a3_49->dw01BC = a2;
	}
	if (g_t42022FFC == 0x00)
		g_t42022FFC = &a0->b0060 + 0x006C;
	else
		a0->t00DC = g_t42023000;
	g_t42023000 = &a0->b0060 + 0x006C;
	*((word32) s0_41 + 220) = 0x00;
	a2Out = dwArg10;
	a3Out = a3_49;
	a5Out = 0x42022F48;
	return &a0->b0060 + 0x006C;
}

// 2301C1B6: Register Eq_2 txl_buffer_update_thd(Register Eq_2 ra, Register (ptr32 Eq_33477) a2, Register Eq_2 a3, Register (ptr32 Eq_33479) a5, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out (ptr32 Eq_33511) a5Out)
// Called from:
//      txl_cntrl_push
Eq_2 txl_buffer_update_thd(Eq_2 ra, struct Eq_33477 * a2, Eq_2 a3, struct Eq_33479 * a5, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, struct Eq_33511 & a5Out)
{
	struct Eq_81173 * a7_7 = a5->ptr0068->ptr006C;
	struct Eq_33477 * a4_17 = (char *) a5 + 76;
	word32 a1_10 = 0x00;
	while (a3 != 0x00)
	{
		a4_17->dw0000 = ~0x35010521;
		Eq_2 a0_19 = *a3;
		++a4_17;
		a4_17->dw0FF4 = (word32) a3;
		int32 t3_23 = *((word32) a0_19 + 16);
		a4_17->dw0FFC = 0x00;
		ptr32 a3_27 = (word32) a3 + t3_23;
		a4_17->dw0FF8 = a3_27 + ~0x00;
		a4_17->dw0004 = a4_17;
		a2 = a4_17;
		++a1_10;
		a3 = a3_27 + ~0x00;
	}
	if (a1_10 != 0x00)
	{
		Eq_2 a5_32 = a4_17->dw0004;
		*(union Eq_2 *) 3405708054 = a5_32;
		*((word32) a5_32 + 396) = a5_32;
		Mem40[a4_17 + ~0x00 + (a5_32 + 332) + 0x0044:word32] = a5_32;
		*((word32) a5_32 + 60) = (char *) a5 + 76;
		((word32) a5_32 + 72)->u0 = 0x00;
		Mem46[a7_7 + 16:word32] = a5_32 + 56;
		a2->dw0010 = 0x00;
		a7_7->dw003C = 0x0100;
		a2->dw0004 = 0x00;
		a5Out = (struct Eq_33511 *) 0x0100;
		return ~0x35010521;
	}
	else
	{
		word32 a0_102;
		word32 a1_103;
		word32 s1_101;
		word32 a2_104;
		word32 a3_105;
		word32 a4_106;
		word32 a5_107;
		word32 a7_108;
		word32 s2_109;
		word32 s3_110;
		word32 s4_111;
		word32 s5_112;
		word32 s6_113;
		word32 s7_114;
		word32 s8_115;
		word32 s9_116;
		word32 s10_117;
		word32 s11_118;
		word32 t4_119;
		printf(ra, &g_t230AE210, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_101, out a0_102, out a1_103, out a2_104, out a3_105, out a4_106, out a5_107, out a7_108, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115, out s9_116, out s10_117, out s11_118, out t4_119);
		while (true)
			;
	}
}

// 2301C250: Register Eq_2 bam_init(Register ptr32 mstatus)
// Called from:
//      me_init
Eq_2 bam_init(ptr32 mstatus)
{
	g_b42023030 = ~0x00;
	word32 s1_22;
	word32 a0_23;
	word32 a1_24;
	word32 a4_25;
	word32 a5_26;
	word32 s2_27;
	word32 s3_28;
	word32 s4_29;
	return ke_state_set(0x08, 0x00, mstatus, out s1_22, out a0_23, out a1_24, out a4_25, out a5_26, out s2_27, out s3_28, out s4_29);
}

// 2301C262: void bam_send_air_action_frame(Register Eq_2 ra, Register word32 a0, Register word32 a2, Register uint32 a5, Register word32 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_81343 dwArg64, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8)
// Called from:
//      rxu_mgt_ind_handler
void bam_send_air_action_frame(Eq_2 ra, word32 a0, word32 a2, uint32 a5, word32 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg58, Eq_81343 dwArg64, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8)
{
	Eq_2 a4_53;
	Eq_2 a5_54;
	phy_get_channel(fp + -72, out a4_53, out a5_54);
	struct Eq_81357 * s1_66;
	struct Eq_81358 * s4_67;
	word32 s8_68;
	struct Eq_81360 * a0_71;
	word32 s2_75;
	word32 s3_76;
	word32 s0_449;
	word32 a1_450;
	word32 a3_451;
	word32 a4_452;
	word32 a5_453;
	word32 s5_454;
	word32 s6_455;
	word32 s7_456;
	word32 s9_457;
	word32 s10_458;
	word32 s11_459;
	txl_frame_get(ra, (word32) ((word32) (byte) s10 != 0x00), (struct Eq_25902 *) 0x0100, a4_53, a5_54, fflags, frm, mstatus, dwArgA8, dwArgC8, dwArgE8, out s0_449, out s1_66, out a0_71, out a1_450, out a3_451, out a4_452, out a5_453, out s2_75, out s3_76, out s4_67, out s5_454, out s6_455, out s7_456, out s8_68, out s9_457, out s10_458, out s11_459);
	if (a0_71 == null)
		return;
	word32 a5_132;
	struct Eq_81402 * a4_97;
	struct Eq_24474 * a3_193 = tpc_update_frame_tx_power(ra, (char *) s4_67 + 0x42020550, fflags, frm, out a4_97);
	struct Eq_81409 * a1_103 = a0_71->ptr0068;
	a1_103->b014C = 0xD0;
	a1_103->b014D = 0x00;
	a1_103->b014E = 0x00;
	a1_103->b014F = 0x00;
	struct Eq_81429 * s8_89 = s8_68 + (a0 + 0x01CE);
	a1_103->w0150 = (word16) (word32) s8_89->w0000;
	a1_103->w0152 = (word16) (word32) s8_89->w0002;
	a1_103->w0154 = (word16) (word32) s8_89->w0004;
	a1_103->w0156 = (word16) (word32) s4_67->w420205A0;
	a1_103->w0158 = (word16) (word32) s4_67->w420205A2;
	a1_103->w015A = (word16) (word32) s4_67->w420205A4;
	if ((word32) a4_97->b0056 == 0x02)
	{
		a1_103->w015C = (word16) (word32) s4_67->w420205A0;
		a1_103->w015E = (word16) (word32) s4_67->w420205A2;
		a5_132 = (word32) s4_67->w420205A4;
	}
	else
	{
		a1_103->w015C = (word16) (word32) s8_89->w0000;
		a1_103->w015E = (word16) (word32) s8_89->w0002;
		a5_132 = (word32) s8_89->w0004;
	}
	Eq_2 s0_181;
	struct Eq_81560 * a0_185;
	struct Eq_81535 * a5_173;
	word32 a0_170;
	a1_103->w0160 = (word16) a5_132;
	uint32 a6_145 = (word32) g_w4201FF64 + 0x01 << 16;
	g_w4201FF64 = (word16) (a6_145 >> 0x10);
	uint32 a6_150 = (word32) (word16) (a6_145 >> 0x10 << 4);
	a1_103->b0162 = (byte) a6_150;
	a1_103->b0163 = (byte) (a6_150 >> 0x08);
	a0_71->b002F = (byte) s4_67;
	a0_71->b0030 = (byte) s3_76;
	if (a2 != 0x01)
	{
		if (a2 == 0x00)
		{
			s0_181 = (word32) (dwArg64 >> 2 & 0x0F)->b230AD230;
			a0_185 = me_build_add_ba_req(&a1_103->b0163 + 1, s1_66, out a5_173) + 0x18;
			goto l2301C3EE;
		}
		a5_173 = (struct Eq_81535 *) 0x02;
		if (a2 != 0x02)
		{
			assert_warn();
			a0_185 = (struct Eq_81560 *) 0x18;
			goto l2301C43E;
		}
		a0_170 = me_build_del_ba(&a1_103->b0163 + 1, s1_66, a5, out a3_193, out a5_173);
	}
	else
		a0_170 = me_build_add_ba_rsp(&a1_103->b0163 + 1, dwArg64, a3_193, a5, out a5_173);
	a0_185 = a0_170 + 0x18;
l2301C43E:
	s0_181.u0 = 0x03;
l2301C3EE:
	word32 a4_215 = a5_173->dw0014;
	word32 a5_219 = a5_173 + ~0x00 + a0_185;
	a5_219->dw0018 = a4_215;
	a0_185->dw0020 = a4_215;
	if (s2_75 != 0x00)
	{
		a0_71->dw02CC = s2_75;
		a0_71->ptr02D0 = s1_66;
	}
	word32 s7_472;
	word32 s9_473;
	word32 s10_474;
	word32 s11_475;
	word32 a5_466;
	word32 s2_467;
	word32 s3_468;
	word32 s4_469;
	word32 s6_471;
	word32 s5_470;
	word32 s1_461;
	word32 a0_462;
	word32 a1_463;
	word32 a4_465;
	word32 a3_464;
	word32 s0_460;
	txl_frame_push(ra, s0_181, s0_181, a3_193, a5_219, mstatus, dwLoc28, dwArg28, dwArg58, dwArg8C, out s0_460, out s1_461, out a0_462, out a1_463, out a3_464, out a4_465, out a5_466, out s2_467, out s3_468, out s4_469, out s5_470, out s6_471, out s7_472, out s9_473, out s10_474, out s11_475);
}

// 2301C44E: void rxu_mgt_ind_handler(Register Eq_2 ra, Register (ptr32 Eq_81684) a1, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_81343 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8)
void rxu_mgt_ind_handler(Eq_2 ra, struct Eq_81684 * a1, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg38, Eq_81343 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8)
{
	if ((word32) a1->b001D != 0x00)
		return;
	int32 s0_26 = (word32) a1->b0020 << 8 | (word32) a1->b001F;
	word32 s1_301;
	up32 s3_65;
	word32 a1_303;
	word32 a0_302;
	word32 a3_305;
	word32 a2_304;
	word32 a4_306;
	word32 a5_307;
	word32 a7_308;
	word32 s2_309;
	word32 s4_310;
	word32 s5_311;
	word32 s6_312;
	word32 s7_313;
	word32 s8_314;
	word32 s9_315;
	word32 s10_316;
	word32 s11_317;
	word32 t4_318;
	Eq_2 ra_60 = printf(ra, &g_t230AE26C, s0_26 >> 0x02 & 0x0F, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_301, out a0_302, out a1_303, out a2_304, out a3_305, out a4_306, out a5_307, out a7_308, out s2_309, out s3_65, out s4_310, out s5_311, out s6_312, out s7_313, out s8_314, out s9_315, out s10_316, out s11_317, out t4_318);
	up32 a3_75 = s3_65;
	if (s3_65 > 0x08)
		a3_75 = 0x08;
	word32 s1_110;
	word32 s10_111;
	word32 a0_319;
	word32 a1_320;
	word32 a2_321;
	word32 a3_322;
	word32 a4_323;
	word32 a5_324;
	word32 a7_325;
	word32 s2_326;
	word32 s3_327;
	word32 s4_328;
	word32 s5_329;
	word32 s6_330;
	word32 s7_331;
	word32 s8_332;
	word32 s9_333;
	word32 s11_334;
	word32 t4_335;
	bam_send_air_action_frame(printf(ra_60, &g_t230AE2E4, (int32) (word16) ((word32) (word16) a3_75 << 6 | (s0_26 & 62 | 2)) >> 2 & 0x0F, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_110, out a0_319, out a1_320, out a2_321, out a3_322, out a4_323, out a5_324, out a7_325, out s2_326, out s3_327, out s4_328, out s5_329, out s6_330, out s7_331, out s8_332, out s9_333, out s10_111, out s11_334, out t4_335), s1_110, 0x01, 0x00, s10_111, fflags, frm, mstatus, dwArg08, dwArg38, dwArg44, ra, dwArg88, dwArgA8, dwArgC8);
}

// 2301C526: Register word32 co_pack8p(Register word32 a0, Register Eq_2 a1, Register (ptr32 word32) a2, Register out (ptr32 byte) a4Out, Register out (ptr32 word32) a5Out)
// Called from:
//      me_add_ie_ssid
//      me_add_ie_supp_rates
//      me_add_ie_ext_supp_rates
//      me_add_ie_ht_capa
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
word32 co_pack8p(word32 a0, Eq_2 a1, word32 * a2, byte & a4Out, word32 & a5Out)
{
	word32 * a5_12 = null;
	while (a2 != a5_12)
	{
		a3 = CONVERT(Mem8[a1 + a5_12:byte], byte, word32);
		a4 = (byte *) (a5_12 + a0);
		*a4 = (byte) a3;
		a5_12 = (word32 *) ((char *) a5_12 + 1);
	}
	a4Out = a4;
	a5Out = a5_12;
	return a3;
}

// 2301C542: Register Eq_81856 phy_freq_to_channel(Register Eq_81856 a0, Register word32 a1, Register out (ptr32 byte) a3Out, Register out Eq_81859 a4Out, Register out Eq_81856 a5Out)
// Called from:
//      me_add_ie_ht_oper
//      me_build_associate_req
//      me_extract_country_reg
//      me_build_probe_rsp
Eq_81856 phy_freq_to_channel(Eq_81856 a0, word32 a1, byte & a3Out, union Eq_81859 & a4Out, union Eq_81856 & a5Out)
{
	Eq_81859 a4_11;
	Eq_81856 a5_20;
	word32 a5_13;
	if (a0 == 0x00)
	{
		uint32 a4_17 = a1 + 0xFF000694 << 16;
		a4_11 = a4_17 >> 16;
		a3 = (byte *) 72;
		a5_20.u0 = 0x00;
		if (a4_17 >> 16 > 72)
			goto l2301C572;
		a4_11.u0 = 0x00FFF9B4;
		a5_20.u0 = 0x0E;
		if (a1 != 0x00FFF9B4)
		{
			a5_13 = 0xFF000699;
			goto l2301C56A;
		}
	}
	else
	{
		a4_11.u0 = 0x01;
		a5_20.u0 = 0x00;
		if (a0 != 0x01)
			goto l2301C572;
		uint32 a4_10 = a1 + ~0x0100038C << 16;
		a4_11 = a4_10 >> 16;
		a3 = (byte *) 0x0334;
		if (a4_10 >> 16 <= 0x0334)
		{
			a5_13 = ~0x01000387;
l2301C56A:
			a5_20 = a1 + a5_13 ^ 0x05;
			goto l2301C572;
		}
	}
l2301C572:
	a3Out = a3;
	a4Out = a4_11;
	a5Out = a5_20;
	return a5_20;
}

// 2301C598: Register ui32 phy_channel_to_freq(Register ui32 a0, Register Eq_2 a1)
// Called from:
//      me_extract_csa
ui32 phy_channel_to_freq(ui32 a0, Eq_2 a1)
{
	up32 a1_10;
	if (a0 != 0x00)
	{
		if (a1 > -0x00A5)
			return 0x0FFFFFFF;
		a1_10 = 0x01000388;
		return (word32) (word16) ((word32) a1 + 5 + a1_10);
	}
	else
	{
		if (a1 > ~0x0D)
			return 0x0FFFFFFF;
		if (a1 == 0x0E)
			return 0x00FFF9B4;
		a1_10 = 0x00FFF967;
		return (word32) (word16) ((word32) a1 + 5 + a1_10);
	}
}

// 2301C5E2: Register word32 me_add_ie_ssid(Register (ptr32 word32) a1, Register Eq_2 a2, Register (ptr32 Eq_81926) a4)
// Called from:
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
word32 me_add_ie_ssid(word32 * a1, Eq_2 a2, struct Eq_81926 * a4)
{
	a4->t0000.u0 = 0x00;
	Eq_81927 a0_16 = a4->t0000;
	a4->b0001 = (byte) a1;
	word32 * a5_14 = a1;
	if (a1 != null)
	{
		word32 a4_51;
		co_pack8p((word32) *a0_16 + 2, a2, a1, out a4_51, out a5_14);
	}
	Mem35[a5_14 + (a1 + 2):word32] = Mem18[a5_14 + 0x00:word32];
	return (char *) a1 + 2;
}

