pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301C9E8: Register (ptr32 Eq_51269) me_build_authenticate(Register (ptr32 Eq_51269) a0, Register uint32 a1, Register Eq_2 a2, Register uint32 a3, Register Eq_2 a4, Register out Eq_51274 a3Out, Register out Eq_51275 a5Out)
// Called from:
//      sm_auth_send
//      apm_send_mlme
struct Eq_51269 * me_build_authenticate(struct Eq_51269 * a0, uint32 a1, Eq_2 a2, uint32 a3, Eq_2 a4, union Eq_51274 & a3Out, union Eq_51275 & a5Out)
{
	a0->b0000 = (byte) a1;
	a0->b0002 = (byte) a2;
	a0->b0004 = (byte) a3;
	a0->b0001 = (byte) (a1 >> 8);
	a0->b0003 = (byte) (a2 >> 8);
	a0->b0005 = (byte) (a3 >> 8);
	if (a4 == 0x00)
	{
		a3Out = a3 >> 8;
		a5Out = a5;
		return (struct Eq_51269 *) 0x06;
	}
	else
	{
		a0->b0006 = 0x10;
		a0->b0007 = 0x80;
		Eq_51275 a5_24 = 0x00;
		do
		{
			Mem33[a0 + 0x08 + a5_24:byte] = SLICE(CONVERT(Mem28[a4 + a5_24:byte], byte, word32), byte, 0);
			a5_24 = (word32) a5_24.u0 + 1;
		} while (a5_24 != 0x0080);
		a3Out.u0 = 0x0080;
		a5Out = a5_24;
		return (struct Eq_51269 *) 0x0088;
	}
}

// 2301CA3E: Register (ptr32 Eq_50501) me_build_deauthenticate(Register (ptr32 Eq_50501) a0, Register (ptr32 Eq_44272) a1)
// Called from:
//      sm_disconnect
//      sm_handle_supplicant_result
//      apm_send_mlme
struct Eq_50501 * me_build_deauthenticate(struct Eq_50501 * a0, struct Eq_42953 * a1)
{
	a0->b0000 = (byte) a1;
	a0->b0001 = (byte) (a1 >> 8);
	return (struct Eq_50501 *) 0x02;
}

// 2301CA4C: Register Eq_2 me_build_associate_req(Register Eq_2 ra, Register (ptr32 Eq_51630) a1, Register (ptr32 Eq_38316) a3, Register (ptr32 Eq_51643) a4, Register (ptr32 word16) a5, Register Eq_2 a6, Register Eq_2 s6, Register int32 s8, Register (ptr32 byte) s10, Register (ptr32 byte) s11, Stack word32 dwArg04, Stack Eq_2 dwArg40, Register out ptr32 a0Out, Register out Eq_51642 a3Out, Register out Eq_51643 a4Out, Register out (ptr32 Eq_51644) s2Out, Register out Eq_51642 s8Out)
// Called from:
//      sm_assoc_req_send
Eq_2 me_build_associate_req(Eq_2 ra, struct Eq_51630 * a1, struct Eq_38316 * a3, union Eq_51643 * a4, word16 * a5, Eq_2 a6, Eq_2 s6, int32 s8, byte * s10, byte * s11, word32 dwArg04, Eq_2 dwArg40, ptr32 & a0Out, union Eq_51642 & a3Out, union Eq_51643 & a4Out, struct Eq_51644 & s2Out, union Eq_51642 & s8Out)
{
	int8 bLoc50_515 = (int8) s6;
	byte bLoc51_523 = SLICE(s8, byte, 24);
	uint32 s0_31 = (word32) *((word32) a6 + 56);
	word32 s5_41 = (word32) *((word32) a6 + 54);
	Eq_51642 s8_154 = (word32) *((word32) a6 + 60);
	if (s0_31 == 0x00)
		s0_31 = 0x05;
	struct Eq_82749 * a2_52;
	struct Eq_82750 * a5_55;
	word32 a4_835;
	word32 a3_834;
	uint32 a0_51 = me_build_capability(a3, out a2_52, out a3_834, out a4_835, out a5_55);
	0x00 = dwArg04;
	a5_55->b0000 = (byte) a0_51;
	a5_55->b0001 = (byte) (a0_51 >> 0x08);
	a5_55->b0002 = (byte) s0_31;
	a5_55->b0003 = (byte) (s0_31 >> 8);
	struct Eq_81926 * a4_57 = a0_51 >> 0x08;
	int32 s0_66 = 0x04;
	if (a2_52 != null)
	{
		a5_55->w0004 = (word16) (word32) a2_52->w0000;
		a5_55->w0006 = (word16) (word32) a2_52->w0002;
		a4_57 = (word32) a2_52->w0004;
		a5_55->w0008 = (word16) a4_57;
		s0_66 = 0x0A;
	}
	*a4 = (union Eq_51643 *) (a5_55 + s0_66 / 0x0A);
	word32 a0_94 = me_add_ie_ssid((word32) a1->b0026, &a1->b0026 + 1, a4_57);
	word32 a0_105;
	byte * a3_108;
	struct Eq_56849 * s1_111 = me_add_ie_supp_rates(&a1->b0058, out a0_105, out a3_108);
	byte * a5_117 = (byte *) 0x08;
	word32 s0_118 = (word32) (word16) (s0_66 + (a0_105 + a0_94));
	if ((word32) a1->b0058 > 0x08)
	{
		word32 a0_121;
		word32 a4_836;
		s1_111 = me_add_ie_ext_supp_rates(&a1->b0058, (struct Eq_82004 *) 0x08, out a0_121, out a3_108, out a4_836, out a5_117);
		s0_118 = (word32) (word16) (s0_118 + a0_121);
	}
	struct Eq_51644 * s2_134 = a0_51 & 0x0100;
	if ((a0_51 & 0x0100) != 0x00)
	{
		*a5_117 = 33;
		*a5_117 = 0x02;
		Eq_2 s0_153 = phy_get_rf_gain_capab(fp + -80, fp + -81, out s8_154);
		byte * a5_159 = (int32) a1->ptr004C->b0004;
		if (a5_159 < (int32) bLoc50_515)
			bLoc50_515 = (byte) a5_159;
		byte * a6_190;
		*a5_159 = (byte) (word32) bLoc51_523;
		*a5_159 = (byte) (word32) bLoc50_515;
		*a5_159 = 0x24;
		byte * dwArg0C_531 = a3_108 + 1;
		if ((word32) a1->ptr004C->b0002 == 0x00)
		{
			a6_190 = (word32) g_b42020C68;
			s2_134 = (struct Eq_51644 *) &g_t42020B6C;
		}
		else
		{
			a6_190 = (word32) g_b42020C69;
			s2_134 = (struct Eq_51644 *) &g_t42020BC0;
		}
		ui32 a7_197 = 0x00;
		ui32 s4_198 = 0x00;
		byte * s10_199 = null;
		ui32 t1_200 = 0x00;
		a5_117 = null;
		while (true)
		{
			ui32 s9_206 = a7_197 + 2;
			if (s10_199 == a6_190)
				break;
			if (((word32) s2_134->b0003 & 0x02) == 0x00)
			{
				word32 a5_847;
				word32 a4_846;
				ui32 a0_227 = phy_freq_to_channel((word32) s2_134->b0002, (word32) s2_134->w0000, out a3_108, out a4_846, out a5_847);
				null = s11;
				a6_190 = s10;
				ui32 s4_235 = a7_197;
				a5_117 = a0_227 & 0x00FF;
				if (a7_197 != 0x00)
				{
					s0_153 = dwArg40;
					if ((a0_227 & 0x00FF) - t1_200 != dwLoc14)
					{
						*s11 = (byte) (a0_227 & 0x00FF);
						*dwArg0C_531 = (byte) a7_197;
						s8_154 = dwLoc14;
						a7_197 = s9_206 & 0x00FF;
						++dwArg0C_531;
						s4_235 = a7_197 + 1 & 0x00FF;
					}
				}
				s4_198 = s4_235 + 0x01 & 0x00FF;
				++s2_134;
				t1_200 = a0_227 & 0x00FF;
			}
			s10_199 = s10_199 + 1 & 0x00FF;
		}
		*s11 = (byte) a5_117;
		*a5_117 = (byte) s4_198;
		*a3_108 = (byte) (s9_206 & 0x00FF);
		s0_118 = (word32) (word16) ((word32) s0_153 + 6 + (s9_206 & 0x00FF));
	}
	struct Eq_56849 * a4_299 = s1_111 + s5_41;
	struct Eq_56849 * a6_300;
	int32 a5_302 = a5_117 - s1_111;
	for (a6_300 = s1_111; a4_299 != a6_300; ++a6_300)
		a6_300[a5_302] = (struct Eq_56849) (byte) (word32) a6_300[64];
	word32 s5_319 = s5_41 + a5_302;
	ptr32 s0_328 = (word32) (word16) (s0_118 + s5_41);
	if ((a1->dw0088 & 0x01) != 0x00)
	{
		word32 a3_841;
		word32 a4_842;
		word32 a1_839;
		word32 t1_837;
		word32 a0_838;
		word32 a5_843;
		word32 a2_840;
		memset(ra, fp + -78, 0x00, 0x0E, out t1_837, out a0_838, out a1_839, out a2_840, out a3_841, out a4_842, out a5_843);
		if (g_t4201E9FC != 0x00)
			(int32) a1->b0068 >= 0x00;
		word32 a4_844;
		word32 a5_845;
		co_pack8p(s5_319, fp + -80, (word32 *) 0x09, out a4_844, out a5_845);
		a4_299 = (struct Eq_56849 *) 0x07;
		s0_328 = (word32) (word16) (s0_328 + 0x09);
	}
	int32 a5_396 = a1->dw0088;
	ui32 a5_397 = a5_396 & 0x02;
	if ((a5_396 & 0x02) != 0x00)
	{
		a5_397 = (word32) g_b42020B6A;
		if (a5_397 != 0x00)
		{
			word32 a0_403;
			me_add_ie_ht_capa(a4_299, out a0_403, out a5_397);
			s0_328 = (word32) (word16) (s0_328 + a0_403);
		}
	}
	Eq_51643 a4_427 = *a4;
	*a5 = (word16) (a5_397 - a4_427);
	a0Out = s0_328;
	a3Out = dwLoc14;
	a4Out = a4_427;
	s2Out = s2_134;
	s8Out = s8_154;
	return dwArg0158;
}

