pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301CD4A: Register (ptr32 Eq_81552) me_build_add_ba_req(Register (ptr32 Eq_81552) a0, Register (ptr32 Eq_81357) a1, Register out Eq_81554 a5Out)
// Called from:
//      bam_send_air_action_frame
struct Eq_81552 * me_build_add_ba_req(struct Eq_81552 * a0, struct Eq_81357 * a1, union Eq_81554 & a5Out)
{
	a0->b0000 = 0x03;
	a0->b0001 = 0x00;
	a0->b0002 = (byte) (word32) a1->b0011;
	uint32 a5_17 = (word32) a1->b000E << 1 | (word32) a1->b0010 << 2 | (word32) a1->b000F << 6;
	a0->b0003 = (byte) a5_17;
	a0->b0004 = (byte) (a5_17 >> 8);
	uint32 a5_21 = (word32) a1->w000A;
	a0->b0005 = (byte) a5_21;
	a0->b0006 = (byte) (a5_21 >> 8);
	uint32 a5_28 = (word32) a1->w0008 << 20 >> 16;
	a0->b0007 = (byte) a5_28;
	a0->b0008 = (byte) (a5_28 >> 8);
	a5Out = a5_28 >> 8;
	return (struct Eq_81552 *) 0x09;
}

// 2301CDA2: Register (ptr32 Eq_81528) me_build_add_ba_rsp(Register (ptr32 Eq_81528) a0, Register Eq_81343 a2, Register (ptr32 Eq_24474) a3, Register uint32 a4, Register out (ptr32 byte) a5Out)
// Called from:
//      bam_send_air_action_frame
struct Eq_81528 * me_build_add_ba_rsp(struct Eq_81528 * a0, Eq_81343 a2, struct Eq_24474 * a3, uint32 a4, byte & a5Out)
{
	a0->b0000 = 0x03;
	a0->b0001 = 0x01;
	a0->b0005 = (byte) a2;
	a0->b0004 = (byte) (a4 >> 0x08);
	a0->b0002 = (byte) a3;
	a0->b0003 = (byte) a4;
	a0->b0006 = (byte) (a2 >> 8);
	if (a4 != 0x00)
	{
		a0->b0007 = 0x00;
		a0->b0008 = 0x00;
	}
	else
	{
		a0->b0007 = 0xD0;
		a0->b0008 = 0x07;
	}
	a5Out = &a0->b0007;
	return (struct Eq_81528 *) 0x09;
}

// 2301CDEA: Register (ptr32 Eq_81567) me_build_del_ba(Register (ptr32 Eq_81567) a0, Register (ptr32 Eq_81357) a1, Register uint32 a2, Register out (ptr32 byte) a3Out, Register out Eq_81571 a5Out)
// Called from:
//      bam_send_air_action_frame
struct Eq_81567 * me_build_del_ba(struct Eq_81567 * a0, struct Eq_81357 * a1, uint32 a2, byte & a3Out, union Eq_81571 & a5Out)
{
	a0->b0000 = 0x03;
	a0->b0001 = 0x02;
	uint32 a5_15 = (word32) a1->b0010 << 28 >> 16;
	if ((word32) a1->b000D == 0x01)
		a5_15 = (word32) (word16) (a5_15 | 0x00FFF800);
	a0->b0002 = 0x00;
	Eq_81571 a5_24 = a5_15 >> 8;
	a0->b0003 = (byte) a5_24;
	a0->b0004 = (byte) a2;
	a0->b0005 = (byte) (a2 >> 8);
	a3Out = &a0->b0002;
	a5Out = a5_24;
	return (struct Eq_81567 *) 0x06;
}

// 2301CE32: void me_extract_rate_set(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_46618) a2, Stack Eq_2 dwArg38)
// Called from:
//      rxu_mgt_ind_handler
void me_extract_rate_set(Eq_2 a0, byte * a1, struct Eq_46618 * a2, Eq_2 dwArg38)
{
	a2->b0000 = 0x00;
	word32 a5_120;
	Eq_2 a0_22 = mac_ie_find(a0, a1, 0x01, out a5_120);
	if (a0_22 != 0x00)
	{
		up32 a4_23 = (word32) *((word32) a0_22 + 1);
		if (a4_23 <= 0x0C)
		{
			struct Eq_83343 * a5_25 = a2 + 1;
			up32 a3_26 = a4_23;
			while (true)
			{
				a3_26 += ~0x00;
				if (a3_26 == ~0x00)
					break;
				++a5_25;
				a5_25[0x0FFF] = (struct Eq_83343) (byte) (word32) *((word32) a0_22 + (a5_25 - a2));
			}
			a2->b0000 = (byte) a4_23;
			word32 a5_121;
			Eq_2 a0_49 = mac_ie_find(a0, a1, 50, out a5_121);
			if (a0_49 != 0x00)
			{
				int32 s1_51 = (word32) *((word32) a0_49 + 1);
				if ((word32) a2->b0000 + s1_51 > 0x0C)
					assert_err();
				word32 a5_60 = (word32) a2->b0000;
				if (a5_60 + s1_51 <= 0x0C)
				{
					int32 a5_65;
					for (a5_65 = 0x00; s1_51 != a5_65; ++a5_65)
						a2[a5_60 + 1 + a5_65] = (struct Eq_46618) (byte) (word32) ((word32) a0_49 + 2 + a5_65);
					a2->b0000 = (byte) (s1_51 + (word32) a2->b0000);
				}
			}
		}
	}
	0x00 = (int8) dwArg38;
}

// 2301CEFA: void me_extract_power_constraint(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_38960) a2)
// Called from:
//      me_beacon_check
//      rxu_mgt_ind_handler
void me_extract_power_constraint(Eq_2 a0, byte * a1, struct Eq_38960 * a2)
{
	word32 a5_32;
	Eq_2 a0_15 = mac_ie_find(a0, a1, 32, out a5_32);
	word32 a5_16 = 0x00;
	if (a0_15 != 0x00)
		a5_16 = (word32) *((word32) a0_15 + 2);
	a2->b0084 = (byte) a5_16;
}

// 2301CF1E: void me_extract_country_reg(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_46618) a2, Stack Eq_2 dwArg38)
// Called from:
//      rxu_mgt_ind_handler
void me_extract_country_reg(Eq_2 a0, byte * a1, struct Eq_46618 * a2, Eq_2 dwArg38)
{
	word32 a5_118;
	Eq_2 a0_19 = mac_ie_find(a0, a1, 0x07, out a5_118);
	if (a0_19 != 0x00)
	{
		struct Eq_83447 * s0_20 = a2[76];
		word32 s2_22 = 0x01;
		Eq_81856 a0_23 = (word32) s0_20->b0002;
		if (a0_23 != 0x00)
			s2_22 = 0x04;
		word32 a3_119;
		word32 a4_120;
		word32 a5_121;
		ui32 a0_29 = phy_freq_to_channel(a0_23, (word32) s0_20->w0000, out a3_119, out a4_120, out a5_121);
		word32 a2_35 = (word32) *((word32) a0_19 + 1);
		int32 a5_37 = 0x05;
		while (a2_35 + 0x01 >= a5_37)
		{
			struct Eq_83481 * a1_42 = (word32) a0_19 + a5_37;
			ui32 a3_44 = (word32) a1_42->b0000;
			ui32 a6_45 = (word32) a1_42->b0001;
			ui32 a4_46 = 0x00;
			while (a4_46 != a6_45)
			{
				if (a3_44 == (a0_29 & 0x00FF))
				{
					s0_20->b0004 = (byte) (word32) a1_42->b0002;
					goto l2301CF7E;
				}
				a3_44 = a3_44 + s2_22 & 0x00FF;
				a4_46 = a4_46 + 0x01 & 0x00FF;
			}
			a5_37 = a5_37 + 0x03 & 0x00FF;
		}
	}
l2301CF7E:
	0x00 = (int8) dwArg38;
}

// 2301CF98: void me_extract_mobility_domain(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_46618) a2)
// Called from:
//      rxu_mgt_ind_handler
void me_extract_mobility_domain(Eq_2 a0, byte * a1, struct Eq_46618 * a2)
{
	word32 a5_40;
	Eq_2 a0_15 = mac_ie_find(a0, a1, 54, out a5_40);
	if (a0_15 == 0x00)
	{
		a2[0x008C] = (struct Eq_46618) 0x00;
		a2[0x008E] = (struct Eq_46618) 0x00;
	}
	else
	{
		a2[0x008C] = (struct Eq_46618) (word16) ((word32) *((word32) a0_15 + 3) << 8 | (word32) (*((word32) a0_15 + 2)));
		a2[0x008E] = (struct Eq_46618) (byte) (word32) *((word32) a0_15 + 4);
	}
}

// 2301CFD4: Register word32 me_extract_csa(Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 byte) a2, Register (ptr32 Eq_38978) a3, Stack Eq_2 dwArgA8, Register out (ptr32 byte) s1Out, Register out (ptr32 byte) a0Out, Register out Eq_2 s2Out, Register out Eq_38983 s3Out, Register out ptr32 s4Out, Register out (ptr32 byte) s5Out, Register out Eq_2 s6Out, Register out ptr32 s8Out)
// Called from:
//      me_beacon_check
word32 me_extract_csa(Eq_2 a0, byte * a1, byte * a2, struct Eq_38978 * a3, Eq_2 dwArgA8, byte & s1Out, byte & a0Out, union Eq_2 & s2Out, union Eq_38983 & s3Out, ptr32 & s4Out, byte & s5Out, union Eq_2 & s6Out, ptr32 & s8Out)
{
	byte * a0_163;
	word32 a5_289;
	Eq_2 a0_31 = mac_ie_find(a0, a1, 37, out a5_289);
	word32 a5_290;
	Eq_2 a0_38 = mac_ie_find(a0, a1, 60, out a5_290);
	byte * s5_276 = a2;
	byte * s1_160 = a1;
	Eq_2 s2_102 = a0_31;
	if ((a0_31 | a0_38) == 0x00)
	{
		a0_163 = null;
		goto l2301D0BA;
	}
	word32 a5_291;
	Eq_2 a0_47 = mac_ie_find(a0, a1, 62, out a5_291);
	word32 a5_292;
	Eq_2 a0_54 = mac_ie_find(a0, a1, 0x00C4, out a5_292);
	s6 = a0_47;
	Eq_2 s0_55 = a0_54;
	if (a0_54 != 0x00)
	{
		word32 a5_293;
		s0_55 = mac_ie_find((word32) a0_54 + 2, (word32) *((word32) a0_54 + 1), 0x00C2, out a5_293);
	}
	Eq_2 a1_70;
	if (a0_31 != 0x00)
	{
		s1_160 = (word32) *((word32) a0_31 + 4);
		*a2 = (byte) (word32) *((word32) a0_31 + 2);
		a1_70 = (word32) *((word32) a0_31 + 3);
	}
	else
	{
		s1_160 = (word32) *((word32) a0_38 + 5);
		*a2 = (byte) (word32) *((word32) a0_38 + 2);
		a1_70 = (word32) *((word32) a0_38 + 4);
	}
	if (s1_160 == null)
		s1_160 = (byte *) 0x02;
	byte * s0_100;
	byte * a0_101;
	word32 s3_79 = (word32) (a1_70 < 0x0F);
	byte * a0_82 = phy_channel_to_freq(s3_79 ^ 1, a1_70);
	s3 = s3_79 ^ 1;
	s5_276 = a0_82;
	if (s0_55 != 0x00)
	{
		Eq_2 a1_111 = (word32) *((word32) s0_55 + 3);
		struct Eq_83673 * a5_113 = (word32) *((word32) s0_55 + 2) + ~0x00 & 0x00FF;
		s6 = (word32) *((word32) s0_55 + 4);
		s2_102.u0 = 0x01;
		if (a5_113 <= (struct Eq_83673 *) 0x02)
			s2_102 = (word32) a5_113->b230CB8F4;
		s0_100 = phy_channel_to_freq(s3_79 ^ 1, a1_111);
		a0_101 = null;
		if (s6 != 0x00)
			a0_101 = phy_channel_to_freq(s3_79 ^ 1, s6);
l2301D0A4:
		a3->w0006 = (word16) a0_101;
		a3->b0000 = (byte) (s3_79 ^ 1);
		a3->b0001 = (byte) s2_102;
		a3->w0002 = (word16) a0_82;
		a3->w0004 = (word16) s0_100;
		a0_163 = s1_160;
l2301D0BA:
		0x00 = (int8) dwArgA8;
		s1Out = s1_160;
		a0Out = a0_163;
		s2Out = s2_102;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5_276;
		s6Out = s6;
		s8Out = s4;
		return s1;
	}
	if (a0_47 != 0x00)
	{
		word32 a5_95 = (word32) *((word32) a0_47 + 2);
		word32 s0_103 = a0_82 + 0x0A;
		if (a5_95 == 0x01)
		{
l2301D0FC:
			s0_100 = (word32) (word16) s0_103;
			a0_101 = null;
			s2_102.u0 = 0x01;
			goto l2301D0A4;
		}
		if (a5_95 == 0x03)
		{
			s0_103 = a0_82 + -0x0A;
			goto l2301D0FC;
		}
	}
	s0_100 = a0_82;
	a0_101 = null;
	s2_102.u0 = 0x00;
	goto l2301D0A4;
}

// 2301D112: Register Eq_2 me_build_beacon(Register Eq_2 ra, Register (ptr32 Eq_83744) a0, Register (ptr32 Eq_38316) a1, Register (ptr32 word16) a2, Register (ptr32 byte) a3, Register Eq_2 s5, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg94, Register out (ptr32 Eq_83753) s0Out, Register out ptr32 a0Out, Register out (ptr32 Eq_83755) a4Out, Register out (ptr32 Eq_83756) s2Out, Register out ptr32 s4Out)
// Called from:
//      apm_start_req_handler
Eq_2 me_build_beacon(Eq_2 ra, struct Eq_83744 * a0, struct Eq_38316 * a1, word16 * a2, byte * a3, Eq_2 s5, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg6C, Eq_2 dwArg94, struct Eq_83753 & s0Out, ptr32 & a0Out, struct Eq_83755 & a4Out, struct Eq_83756 & s2Out, ptr32 & s4Out)
{
	ptr32 s3_163 = (word32) a1->b42020968;
	a0->b0000 = 0x80;
	a0->b0001 = 0x00;
	a0->b0002 = 0x00;
	a0->b0003 = 0x00;
	word32 a3_621;
	word32 a1_619;
	word32 a2_620;
	word32 a4_622;
	word32 a5_623;
	word32 a6_624;
	word32 a7_625;
	memcpy(&a0->b0003 + 1, 0x230CB890, 0x06, out a1_619, out a2_620, out a3_621, out a4_622, out a5_623, out a6_624, out a7_625);
	word32 a3_628;
	word32 a4_629;
	word32 a1_626;
	word32 a2_627;
	word32 a7_632;
	word32 a6_631;
	word32 a5_630;
	memcpy(&a0->b0003 + 7, (char *) a1 + 0x420205A0, 0x06, out a1_626, out a2_627, out a3_628, out a4_629, out a5_630, out a6_631, out a7_632);
	word32 a4_636;
	word32 a1_633;
	word32 a2_634;
	word32 a3_635;
	word32 a5_637;
	word32 a6_638;
	word32 a7_639;
	memcpy(&a0->b0003 + 0x0D, (char *) a1 + 0x420205A0, 0x06, out a1_633, out a2_634, out a3_635, out a4_636, out a5_637, out a6_638, out a7_639);
	uint32 a5_102 = (word32) g_w4201FF64 + 0x01 << 16;
	g_w4201FF64 = (word16) (a5_102 >> 16);
	uint32 a5_107 = (word32) (word16) (a5_102 >> 16 << 4);
	a0->b0016 = (byte) a5_107;
	a0->b0017 = (byte) (a5_107 >> 8);
	uint32 a5_111 = (word32) a1->w42020962;
	g_b4201FF30 = (byte) a5_111;
	g_b4201FF31 = (byte) (a5_111 >> 8);
	ptr32 s4_164 = (char *) a1 + 0x05D8;
	word16 * s6_166 = a2;
	byte * s5_165 = a3;
	int32 s2_100 = 1107427192;
	Eq_2 a3_118;
	struct Eq_83890 * a5_120;
	word32 a2_640;
	struct Eq_81926 * a4_119;
	uint32 a0_116 = me_build_capability(a1, out a2_640, out a3_118, out a4_119, out a5_120);
	if (s3_163 != 0x00)
		a0_116 = (word32) (word16) (a0_116 | 16);
	word32 * a1_144;
	a5_120->b0022 = (byte) a0_116;
	a5_120->b0023 = (byte) (a0_116 >> 8);
	Eq_2 a2_135 = dwArg94;
	if (a4_119 != null)
	{
		word32 s10_651;
		word32 s11_652;
		word32 t4_653;
		word32 a5_646;
		word32 a7_647;
		word32 s7_648;
		word32 s8_649;
		word32 s9_650;
		word32 a1_643;
		word32 a2_644;
		word32 a3_645;
		word32 s1_641;
		word32 a0_642;
		ra = printf(ra, &g_t230AE35C, a3_118, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_641, out a0_642, out a1_643, out a2_644, out a3_645, out a4_119, out a5_646, out a7_647, out s2_100, out s3_163, out s4_164, out s5_165, out s6_166, out s7_648, out s8_649, out s9_650, out s10_651, out s11_652, out t4_653);
		a2_135.u0 = 0x00;
		a1_144 = null;
	}
	else
		a1_144 = (word32) a1->b420208CE;
	struct Eq_56849 * s7_191 = s4_164 + 944 + s2_100;
	word32 s0_206 = (word32) (word16) (me_add_ie_ssid(a1_144, a2_135, a4_119) + 36) + a0_195;
	word32 a0_195;
	word32 a3_665;
	struct Eq_56849 * s1_201 = me_add_ie_supp_rates(s7_191, out a0_195, out a3_665);
	word32 s0_208 = (word32) (word16) s0_206;
	if ((word32) (s1_201 + 0x05D8 + s2_100)[944] > 0x08)
	{
		word32 a0_215;
		word32 a3_662;
		word32 a4_663;
		word32 a5_664;
		s1_201 = me_add_ie_ext_supp_rates(s7_191, (struct Eq_82004 *) 0x08, out a0_215, out a3_662, out a4_663, out a5_664);
		s0_208 = (word32) (word16) ((word32) (word16) s0_206 + a0_215);
	}
	struct Eq_83963 * s7_232 = s1_201 + 0x05D8 + s2_100;
	struct Eq_82454 * a5_245;
	word32 a4_654;
	word32 s0_249 = (word32) (word16) (s0_208 + me_add_ie_ds(((word32) (*s7_232->ptr03A4) + 0xFF000694 ^ 0x05) + 0x01 & 0x00FF, (struct Eq_82057 *) 0x05, out a4_654, out a5_245));
	*s6_166 = (word16) s0_249;
	struct Eq_82107 * a4_257;
	ui32 a0_256 = me_add_ie_tim((word32) s7_232->b03AC, a5_245, out a4_257);
	*s5_165 = (byte) (a0_256 & 0x00FF);
	word32 a2_655;
	word32 a5_656;
	ui32 a0_270 = me_add_ie_rsn(s3_163, a4_257, out a2_655, out a5_656);
	struct Eq_82083 * a5_283;
	word32 a3_658;
	word32 a4_659;
	word32 a6_660;
	word32 a7_661;
	word32 a1_657;
	struct Eq_82321 * a2_286;
	memcpy(0x42022C68, s3_163 - (a0_270 & 0x00FF), a0_270 & 0x00FF, out a1_657, out a2_286, out a3_658, out a4_659, out a5_283, out a6_660, out a7_661);
	struct Eq_56849 * a4_298;
	word32 s0_308 = (word32) (word16) ((word32) (word16) (s0_249 + (a0_256 & 0x00FF)) + me_add_ie_erp(0x00, a5_283, out a4_298) + (a0_270 & 0x00FF));
	if ((s7_232->dw03E0 & 0x02) != 0x00)
	{
		word32 a0_310;
		struct Eq_82576 * a5_315;
		s1_201 = me_add_ie_ht_capa(a4_298, out a0_310, out a5_315);
		word32 a3_667;
		s0_308 = (word32) (word16) (s0_308 + (me_add_ie_ht_oper(s1_201, a5_315, out a2_286, out a3_667) + a0_310));
	}
	word32 a3_666;
	struct Eq_83755 * a4_339;
	ptr32 s0_349 = (word32) (word16) (s0_308 + me_add_ie_wpa(s3_163, a2_286, out a3_666, out a4_339));
	struct Eq_83756 * s2_351 = s1_201 + 0x05D8 + s2_100;
	if ((s2_351->dw03E0 & 0x01) != 0x00)
	{
		word32 a1_669;
		word32 a2_670;
		word32 a3_671;
		word32 a4_672;
		word32 a5_673;
		word32 a0_361;
		word32 t1_668;
		memset(ra, fp + -62, 0x00, 0x0E, out t1_668, out a0_361, out a1_669, out a2_670, out a3_671, out a4_672, out a5_673);
		word32 a5_674;
		struct Eq_84177 * a4_384;
		struct Eq_81960 * a3_383 = co_pack8p(a0_361, fp + -64, (word32 *) 0x09, out a4_384, out a5_674);
		struct Eq_84186 * a5_387 = (word32) a4_384->b0001;
		a4_384->b0001 = (byte) ((char *) a5_387 + 0x0011);
		a5_387->b001A = 0x00;
		Eq_84201 a5_397 = s2_351->t000C;
		a3_383->b0001 = (byte) a5_397;
		a3_383->b0002 = (byte) (a5_397 >> 0x08);
		a3_383->b0003 = (byte) (a5_397 >> 0x10);
		a3_383->b0004 = (byte) (a5_397 >> 24);
		Eq_84227 a5_408 = s2_351->t0008;
		(a5_397 >> 0x10)->b0004 = (byte) a5_408;
		struct Eq_84236 * a4_409 = (a5_397 >> 0x10) + 4;
		a4_409->b0001 = (byte) (a5_408 >> 0x08);
		a4_409->b0002 = (byte) (a5_408 >> 0x10);
		a4_409->b0003 = (byte) (a5_408 >> 24);
		Eq_84258 a5_419 = s2_351->t0010;
		(a5_408 >> 0x10)->b0004 = (byte) a5_419;
		a4_339 = (a5_408 >> 0x10) + 4;
		a4_339->b0001 = (byte) (a5_419 >> 0x08);
		a4_339->b0002 = (byte) (a5_419 >> 0x10);
		a4_339->b0003 = (byte) (a5_419 >> 24);
		Eq_84288 a5_429 = s2_351->t0014;
		a4_339->b0004 = (byte) a5_429;
		a4_339->b0005 = (byte) (a5_429 >> 0x08);
		a4_339->b0006 = (byte) (a5_429 >> 0x10);
		a4_339->b0007 = (byte) (a5_429 >> 24);
		s0_349 = (word32) (word16) (s0_349 + 0x1A);
	}
	s0Out = dwArgCC;
	a0Out = s0_349;
	a4Out = a4_339;
	s2Out = s2_351;
	s4Out = dwArg0168;
	return dwLoc08;
}

