pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301D432: Register Eq_2 me_build_probe_rsp(Register Eq_2 ra, Register (ptr32 Eq_56776) a0, Register (ptr32 Eq_38316) a1, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_56780) s1Out, Register out ptr32 a0Out, Register out Eq_56782 a3Out, Register out Eq_56783 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      apm_send_mlme
Eq_2 me_build_probe_rsp(Eq_2 ra, struct Eq_56776 * a0, struct Eq_38316 * a1, Eq_2 dwArgA4, Eq_2 dwArg0198, struct Eq_56780 & s1Out, ptr32 & a0Out, union Eq_56782 & a3Out, union Eq_56783 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 s3_26 = (word32) a1->b42020968;
	uint32 a5_27 = (word32) a1->w42020962;
	a0->b0008 = (byte) a5_27;
	a0->b0009 = (byte) (a5_27 >> 8);
	struct Eq_81926 * a4_38;
	struct Eq_84339 * a5_39;
	word32 a3_403;
	word32 a2_402;
	uint32 a0_35 = me_build_capability(a1, out a2_402, out a3_403, out a4_38, out a5_39);
	if (s3_26 != 0x00)
		a0_35 = (word32) (word16) (a0_35 | 16);
	a5_39->b000A = (byte) a0_35;
	a5_39->b000B = (byte) (a0_35 >> 8);
	word32 a0_67 = me_add_ie_ssid((word32) a1->b420208CE, dwArgA4, a4_38);
	uint32 s0_89 = a0_67 + a0_78 + 0x0C << 16;
	word32 a0_78;
	word32 a3_404;
	struct Eq_56849 * s1_100 = me_add_ie_supp_rates(&a1->b42020900, out a0_78, out a3_404);
	uint32 s0_104 = s0_89 >> 16;
	if ((word32) a1->b42020900 > 0x08)
	{
		word32 a0_94;
		word32 a4_409;
		word32 a5_410;
		word32 a3_408;
		s1_100 = me_add_ie_ext_supp_rates(&a1->b42020900, (struct Eq_82004 *) 0x08, out a0_94, out a3_408, out a4_409, out a5_410);
		s0_104 = (word32) (word16) ((s0_89 >> 16) + a0_94);
	}
	struct Eq_84396 * s5_107 = s1_100 + 0x05D8;
	struct Eq_84399 * a5_111 = s5_107->ptr4202031C;
	struct Eq_82057 * a5_116;
	struct Eq_82107 * a4_123;
	struct Eq_82083 * a5_132;
	struct Eq_56849 * a4_142;
	word32 a5_407;
	word32 a4_406;
	word32 a3_405;
	struct Eq_82321 * a2_134;
	word32 s0_150 = (word32) (word16) ((word32) (word16) (s0_104 + (me_add_ie_rsn(s3_26, a4_123, out a2_134, out a5_132) + me_add_ie_ds(phy_freq_to_channel((word32) a5_111->b0002, (word32) a5_111->w0000, out a3_405, out a4_406, out a5_116) & 0x00FF, a5_116, out a4_123, out a5_407))) + me_add_ie_erp(0x00, a5_132, out a4_142));
	if ((s5_107->dw42020358 & 0x02) != 0x00)
	{
		word32 a0_152;
		struct Eq_82576 * a5_157;
		s1_100 = me_add_ie_ht_capa(a4_142, out a0_152, out a5_157);
		word32 a3_412;
		s0_150 = (word32) (word16) (s0_150 + (me_add_ie_ht_oper(s1_100, a5_157, out a2_134, out a3_412) + a0_152));
	}
	struct Eq_56780 * s1_187 = s1_100 + 0x05D8;
	word32 a4_411;
	Eq_56782 a3_183;
	ptr32 s0_191 = (word32) (word16) (s0_150 + me_add_ie_wpa(s3_26, a2_134, out a3_183, out a4_411));
	int32 a5_195 = s1_187->dw42020358;
	Eq_56783 a5_196 = a5_195 & 0x01;
	if ((a5_195 & 0x01) != 0x00)
	{
		word32 a0_203;
		word32 a4_417;
		word32 a5_418;
		word32 t1_413;
		word32 a1_414;
		word32 a2_415;
		word32 a3_416;
		ra = memset(ra, fp + -46, 0x00, 0x0E, out t1_413, out a0_203, out a1_414, out a2_415, out a3_416, out a4_417, out a5_418);
		struct Eq_84532 * a4_226;
		word32 a5_419;
		struct Eq_81960 * a3_225 = co_pack8p(a0_203, fp + -48, (word32 *) 0x09, out a4_226, out a5_419);
		struct Eq_84542 * a5_229 = (word32) a4_226->b0001;
		a4_226->b0001 = (byte) ((char *) a5_229 + 0x0011);
		a5_229->b001A = 0x00;
		Eq_84557 a5_239 = s1_187->t4201FF84;
		a3_225->b0001 = (byte) a5_239;
		a3_225->b0002 = (byte) (a5_239 >> 0x08);
		a3_225->b0003 = (byte) (a5_239 >> 0x10);
		a3_225->b0004 = (byte) (a5_239 >> 24);
		Eq_84583 a5_250 = s1_187->t4201FF80;
		(a5_239 >> 0x10)->b0004 = (byte) a5_250;
		struct Eq_84592 * a4_251 = (a5_239 >> 0x10) + 4;
		a4_251->b0001 = (byte) (a5_250 >> 0x08);
		a4_251->b0002 = (byte) (a5_250 >> 0x10);
		a4_251->b0003 = (byte) (a5_250 >> 24);
		Eq_84614 a5_261 = s1_187->t4201FF88;
		(a5_250 >> 0x10)->b0004 = (byte) a5_261;
		struct Eq_84623 * a4_262 = (a5_250 >> 0x10) + 4;
		a4_262->b0001 = (byte) (a5_261 >> 0x08);
		a4_262->b0002 = (byte) (a5_261 >> 0x10);
		a4_262->b0003 = (byte) (a5_261 >> 24);
		Eq_84645 a5_271 = s1_187->t4201FF8C;
		a4_262->b0004 = (byte) a5_271;
		a4_262->b0005 = (byte) (a5_271 >> 0x08);
		a4_262->b0006 = (byte) (a5_271 >> 0x10);
		a4_262->b0007 = (byte) (a5_271 >> 24);
		a3_183 = a5_271 >> 0x10;
		a5_196 = a5_271 >> 24;
		s0_191 = (word32) (word16) (s0_191 + 0x1A);
	}
	0x00 = (int8) dwArg0198;
	s1Out = s1_187;
	a0Out = s0_191;
	a3Out = a3_183;
	a5Out = a5_196;
	s2Out = (char *) s1_187 + 1107427192;
	s3Out = s3_26;
	s4Out = dwArgF4;
	return ra;
}

// 2301D672: Register Eq_2 me_build_associate_rsp(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_38316) a1, Register (ptr32 Eq_56558) a3, Stack Eq_2 dwArgA4, Register out (ptr32 Eq_56849) s1Out, Register out Eq_56850 a0Out, Register out Eq_56851 a3Out, Register out (ptr32 Eq_56852) a5Out, Register out (ptr32 Eq_38316) s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_56855) s4Out)
// Called from:
//      apm_send_mlme
Eq_2 me_build_associate_rsp(Eq_2 ra, ptr32 a0, struct Eq_38316 * a1, struct Eq_56558 * a3, Eq_2 dwArgA4, struct Eq_56849 & s1Out, union Eq_56850 & a0Out, union Eq_56851 & a3Out, struct Eq_56852 & a5Out, struct Eq_38316 & s2Out, ptr32 & s3Out, struct Eq_56855 & s4Out)
{
	struct Eq_84677 * a5_35;
	word32 a2_344;
	word32 a4_346;
	word32 a3_345;
	uint32 a0_31 = me_build_capability(a1, out a2_344, out a3_345, out a4_346, out a5_35);
	if (a0 != 0x00)
		a0_31 = (word32) (word16) (a0_31 | 16);
	a5_35->b0000 = (byte) a0_31;
	a5_35->b0001 = (byte) (a0_31 >> 8);
	a5_35->b0002 = (byte) dwArgA4;
	a5_35->b0003 = (byte) (dwArgA4 >> 0x08);
	ui32 a5_56 = (word32) a3->w0044;
	(dwArgA4 >> 0x08)->b0004 = (byte) (a5_56 | 0x0C000000);
	uint32 a5_60 = (a5_56 | 0x0C000000) >> 8;
	(dwArgA4 >> 0x08)->b0005 = (byte) a5_60;
	Eq_56851 a3_121 = 0x0C000000;
	Eq_56850 s0_126 = 0x06;
	struct Eq_56852 * a5_133 = a5_60 + 0x06;
	if (dwArgA4 == 0x00)
	{
		word32 a0_68;
		s1 = me_add_ie_supp_rates(&a3->b0006, out a0_68, out a3_121);
		uint32 s0_78 = a0_68 + 0x06 << 0x10;
		struct Eq_56849 * a4_100 = (word32) a3->b0006;
		s0_126 = s0_78 >> 16;
		if (a4_100 > (struct Eq_56849 *) 0x08)
		{
			word32 a0_83;
			word32 a5_347;
			s1 = me_add_ie_ext_supp_rates(s1, (struct Eq_82004 *) 0x08, out a0_83, out a3_121, out a4_100, out a5_347);
			s0_126 = (word32) (word16) ((s0_78 >> 16) + a0_83);
		}
		if ((a3->dw0040 & 0x02) != 0x00)
		{
			struct Eq_56849 * a0_101;
			struct Eq_82576 * a5_106;
			me_add_ie_ht_capa(a4_100, out a0_101, out a5_106);
			s1 = a0_101;
			word32 a2_348;
			s0_126 = CONVERT(SLICE(s0_126 + (me_add_ie_ht_oper(a0_101, a5_106, out a2_348, out a3_121) + a0_101), word16, 0), word16, word32);
		}
		int32 a5_132 = a3->dw0040;
		a5_133 = a5_132 & 0x01;
		if ((a5_132 & 0x01) != 0x00)
		{
			word32 t1_349;
			word32 a1_350;
			word32 a2_351;
			word32 a0_144;
			word32 a3_352;
			word32 a4_353;
			word32 a5_354;
			ra = memset(ra, fp + -46, 0x00, 0x0E, out t1_349, out a0_144, out a1_350, out a2_351, out a3_352, out a4_353, out a5_354);
			struct Eq_84833 * a4_169;
			word32 a5_355;
			struct Eq_81960 * a3_168 = co_pack8p(a0_144, fp + -48, (word32 *) 0x09, out a4_169, out a5_355);
			struct Eq_84843 * a5_172 = (word32) a4_169->b0001;
			a4_169->b0001 = (byte) ((char *) a5_172 + 0x0011);
			a5_172->b001A = 0x00;
			a3_168->b0001 = (byte) &a5_172->b001A;
			a3_168->b0002 = (byte) (&a5_172->b001A >> 0x08);
			a3_168->b0003 = (byte) (&a5_172->b001A >> 0x10);
			a3_168->b0004 = (byte) (&a5_172->b001A >> 24);
			(&a5_172->b001A >> 0x10)->b0004 = (byte) (&a5_172->b001A >> 24);
			struct Eq_84892 * a4_194 = (&a5_172->b001A >> 0x10) + 4;
			a4_194->b0001 = (byte) (&a5_172->b001A >> 0x20);
			a4_194->b0002 = (byte) (&a5_172->b001A >> 0x28);
			a4_194->b0003 = (byte) (&a5_172->b001A >> 48);
			(&a5_172->b001A >> 0x28)->b0004 = (byte) (&a5_172->b001A >> 48);
			struct Eq_84926 * a4_205 = (&a5_172->b001A >> 0x28) + 4;
			a4_205->b0001 = (byte) (&a5_172->b001A >> 0x38);
			a4_205->b0002 = (byte) (&a5_172->b001A >> 0x40);
			a4_205->b0003 = (byte) (&a5_172->b001A >> 72);
			s1 = (&a5_172->b001A >> 72)->ptr0014;
			a4_205->b0004 = (byte) (&a5_172->b001A >> 72);
			a4_205->b0005 = (byte) (&a5_172->b001A >> 0x50);
			a4_205->b0006 = (byte) (&a5_172->b001A >> 88);
			a4_205->b0007 = (byte) (&a5_172->b001A >> 96);
			a3_121 = &a5_172->b001A >> 88;
			a5_133 = &a5_172->b001A >> 96;
			s0_126 = (word32) (word16) ((word32) s0_126 + 26);
		}
	}
	s1Out = s1;
	a0Out = s0_126;
	a3Out = a3_121;
	a5Out = a5_133;
	s2Out = a1;
	s3Out = 1107427192;
	s4Out = dwArgF4;
	return ra;
}

// 2301D856: void me_rc_set_rate_req_handler(Register (ptr32 Eq_84992) a1, Stack Eq_2 dwArgB8)
void me_rc_set_rate_req_handler(struct Eq_84992 * a1, Eq_2 dwArgB8)
{
	struct Eq_84994 * s2_15 = (word32) a1->b0000;
	struct Eq_40042 * s0_23 = s2_15->ptr4201ED20;
	if (s0_23 != null)
	{
		Eq_39371 s3_29 = (word32) a1->w0002;
		if (s3_29 != 0x0FFFFFFF)
		{
			word32 a0_67;
			struct Eq_85061 * s0_72 = rc_check_fixed_rate_config(s0_23, s3_29, out a0_67);
			if (a0_67 != 0x00)
			{
				ui32 a5_77 = (word32) s0_72->b00AF;
				s0_72->w00C6 = (word16) s3_29;
				s0_72->b00AF = (byte) (a5_77 & -97 | 32);
			}
		}
		else
		{
			s0_23->w00C6 = ~0x00;
			uint32 a2_35 = (word32) s0_23->b00BC;
			Eq_39286 a1_36 = (word32) s0_23->b00BB;
			s0_23->b00AF = (byte) ((word32) s0_23->b00AF & -97);
			word32 s0_130;
			word32 s1_131;
			word32 a1_132;
			word32 a4_133;
			word32 s3_134;
			word32 s5_135;
			word32 s6_136;
			word32 s7_137;
			rc_update_bw_nss_max((word32) s2_15->b4201EC2B, a1_36, a2_35, dwArgB8, out s0_130, out s1_131, out a1_132, out a4_133, out s3_134, out s5_135, out s6_136, out s7_137);
		}
	}
	else
		assert_err();
}

// 2301D904: void me_rc_stats_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg38)
void me_rc_stats_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg38)
{
	Eq_2 a0_21;
	byte * s1_30;
	word32 a3_188;
	word32 a4_189;
	word32 a5_190;
	word32 a6_191;
	word32 s2_192;
	word32 a2_187;
	word32 a1_186;
	word32 s0_185;
	word32 s3_193;
	word32 s4_194;
	word32 s8_195;
	ke_msg_alloc(ra, 0x0100040F, a3, 0x00D0, a4, mstatus, dwArg08, out s0_185, out s1_30, out a0_21, out a1_186, out a2_187, out a3_188, out a4_189, out a5_190, out a6_191, out s2_192, out s3_193, out s4_194, out s8_195);
	struct Eq_85121 * a3_39 = (word32) *s1_30;
	Eq_2 s1_112 = a3_39->t4201ED20;
	*a0_21 = (byte) a3_39;
	Eq_2 s0_106 = a0_21;
	if (s1_112 != 0x00)
	{
		*((word32) a0_21 + 2) = (word16) (word32) *((word32) s1_112 + 0x00C0);
		*((word32) a0_21 + 4100) = (word16) (word32) *((word32) s1_112 + 0x00A4);
		*((word32) a0_21 + 0x00001006) = (word16) (word32) *((word32) s1_112 + 166);
		*((word32) a0_21 + 4104) = *((word32) s1_112 + 0x00A8);
		*((word32) a0_21 + 0x0000100C) = (byte) (word32) *((word32) s1_112 + 0x00B0);
		*((word32) a0_21 + 0x0000100D) = (byte) (word32) *((word32) s1_112 + 0x00AC);
		word32 a1_196;
		word32 a2_197;
		word32 a3_198;
		word32 a4_199;
		word32 a5_200;
		word32 a6_201;
		word32 a7_202;
		memcpy((word32) a0_21 + 16, (word32) s1_112 + 0x007C, 32, out a1_196, out a2_197, out a3_198, out a4_199, out a5_200, out a6_201, out a7_202);
		word32 a1_203;
		word32 a2_204;
		word32 a3_205;
		word32 a4_206;
		word32 a5_207;
		word32 a6_208;
		word32 a7_209;
		memcpy((word32) a0_21 + 48, (word32) s1_112 + 4, 0x0078, out a1_203, out a2_204, out a3_205, out a4_206, out a5_207, out a6_208, out a7_209);
		uint32 s2_122 = 0x00;
		while (s2_122 < (word32) (*((word32) s1_112 + 0x00C0)))
		{
			struct Eq_85231 * a0_101;
			word32 s2_113;
			word32 a3_210;
			word32 s3_211;
			word32 s4_212;
			word32 s8_213;
			s0_106 = rc_calc_tp(s1_112, s2_122 & 0x00FF, dwArg08, out s1_112, out a0_101, out a3_210, out s2_113, out s3_211, out s4_212, out s8_213);
			a0_101->dw0008 = (word32) s0_106 + (s2_113 + 40 << 2);
			s2_122 = (word32) (word16) (s2_113 + 0x01);
		}
	}
	else
		*((word32) a0_21 + 2) = 0x00;
	word32 s1_214;
	word32 a0_215;
	word32 a1_216;
	word32 a2_217;
	word32 a3_218;
	word32 a4_219;
	word32 a5_220;
	word32 s2_221;
	word32 s3_222;
	word32 s4_223;
	word32 s8_224;
	ke_msg_send(s0_106, mstatus, out s1_214, out a0_215, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out s2_221, out s3_222, out s4_223, out s8_224);
	0x00 = dwArg38;
}

// 2301D9D2: void me_traffic_ind_req_handler(Register Eq_2 ra, Register (ptr32 Eq_85291) a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus)
void me_traffic_ind_req_handler(Eq_2 ra, struct Eq_85291 * a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus)
{
	struct Eq_85295 * s1_17 = (word32) a1->b0000;
	Eq_2 s3_100 = a3;
	word32 a3_28 = (word32) a1->b0001;
	Eq_2 a4_116 = (char *) s1_17 + 1107422224;
	ui32 a5_31 = (word32) s1_17->b4201EC42;
	if ((word32) a1->b0002 != 0x00)
	{
		ui32 a4_37 = a5_31 & 0x00FB;
		if (a3_28 != 0x00)
			a4_37 = a5_31 | 4;
		s1_17->b4201EC42 = (byte) a4_37;
		a4_116 = (word32) s1_17->b4201ED02;
		if (a4_116 != 0x0F)
		{
l2301DA64:
			word32 a3_208;
			word32 a0_207;
			word32 s4_211;
			word32 s8_212;
			word32 s3_210;
			word32 s2_209;
			word32 s1_206;
			word32 s0_205;
			ke_msg_send_basic(ra, 0x0100040D, s3_100, a4_116, mstatus, s2, out s0_205, out s1_206, out a0_207, out a3_208, out s2_209, out s3_210, out s4_211, out s8_212);
			return;
		}
	}
	else
	{
		ui32 a5_32;
		if (a3_28 != 0x00)
			a5_32 = a5_31 | 1;
		else
			a5_32 = a5_31 & ~0x01;
		s1_17->b4201EC42 = (byte) a5_32;
	}
	Eq_2 a0_64;
	word32 s0_72;
	word32 s1_73;
	struct Eq_85347 * s2_74;
	word32 s8_195;
	word32 a5_191;
	word32 a6_192;
	word32 s4_194;
	word32 s3_193;
	word32 a1_187;
	word32 a2_188;
	word32 a4_190;
	word32 a3_189;
	ra = ke_msg_alloc(ra, 65, 0x00, 0x04, a4_116, mstatus, dwLoc08, out s0_72, out s1_73, out a0_64, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191, out a6_192, out s2_74, out s3_193, out s4_194, out s8_195);
	struct Eq_85376 * s0_84 = s0_72 + (s1_73 + 432);
	*a0_64 = (word16) (word32) s0_84->w0018;
	*((word32) a0_64 + 3) = (byte) (word32) s0_84->b001A;
	*((word32) a0_64 + 2) = (byte) (word32) s2_74->b0001;
	word32 s4_203;
	word32 s8_204;
	word32 a2_199;
	word32 a3_200;
	word32 s2_202;
	word32 a5_201;
	word32 s1_196;
	word32 a1_198;
	word32 a0_197;
	ke_msg_send(a0_64, mstatus, out s1_196, out a0_197, out a1_198, out a2_199, out a3_200, out a4_116, out a5_201, out s2_202, out s3_100, out s4_203, out s8_204);
	goto l2301DA64;
}

// 2301DA94: void me_sta_del_req_handler(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg38)
void me_sta_del_req_handler(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg38)
{
	Eq_2 a0_24;
	byte * s0_32;
	word32 a4_159;
	word32 a3_158;
	word32 a2_157;
	word32 a1_156;
	word32 s1_155;
	word32 a5_160;
	word32 a6_161;
	word32 s2_162;
	word32 s3_163;
	word32 s4_164;
	word32 s8_165;
	Eq_2 ra_113 = ke_msg_alloc(ra, 0x0C, 0x00, 0x01, a4, mstatus, dwArg08, out s0_32, out s1_155, out a0_24, out a1_156, out a2_157, out a3_158, out a4_159, out a5_160, out a6_161, out s2_162, out s3_163, out s4_164, out s8_165);
	*a0_24 = (byte) (word32) *s0_32;
	word32 a0_166;
	word32 a1_167;
	word32 a2_168;
	word32 a3_169;
	word32 a5_170;
	word32 s2_171;
	word32 s3_172;
	word32 s4_173;
	word32 s8_174;
	Eq_2 s1_110;
	Eq_2 a4_115;
	if ((word32) *((word32) ke_msg_send(a0_24, mstatus, out s1_110, out a0_166, out a1_167, out a2_168, out a3_169, out a4_115, out a5_170, out s2_171, out s3_172, out s4_173, out s8_174) + 1) != 0x00)
	{
		Eq_2 a0_65;
		byte * s0_73;
		word32 s1_183;
		word32 a1_184;
		word32 a2_185;
		word32 a3_186;
		word32 a4_187;
		word32 a5_188;
		word32 a6_189;
		word32 s2_190;
		word32 s3_191;
		word32 s4_192;
		word32 s8_193;
		ra_113 = ke_msg_alloc(ra_113, 0x01000413, 0x05, 0x02, a4_115, mstatus, dwArg08, out s0_73, out s1_183, out a0_65, out a1_184, out a2_185, out a3_186, out a4_187, out a5_188, out a6_189, out s2_190, out s3_191, out s4_192, out s8_193);
		*a0_65 = 0x00;
		*((word32) a0_65 + 1) = (byte) (word32) g_a4201EC2A[(word32) *s0_73];
		word32 a0_194;
		word32 a1_195;
		word32 a2_196;
		word32 a3_197;
		word32 a5_198;
		word32 s2_199;
		word32 s3_200;
		word32 s4_201;
		word32 s8_202;
		ke_msg_send(a0_65, mstatus, out s1_110, out a0_194, out a1_195, out a2_196, out a3_197, out a4_115, out a5_198, out s2_199, out s3_200, out s4_201, out s8_202);
	}
	word32 s0_175;
	word32 s1_176;
	word32 a0_177;
	word32 a3_178;
	word32 s2_179;
	word32 s3_180;
	word32 s4_181;
	word32 s8_182;
	ke_msg_send_basic(ra_113, 0x0100040A, s1_110, a4_115, mstatus, dwLoc08, out s0_175, out s1_176, out a0_177, out a3_178, out s2_179, out s3_180, out s4_181, out s8_182);
	0x00 = dwArg38;
}

// 2301DB14: void me_set_control_port_req_handler(Register Eq_2 ra, Register (ptr32 Eq_85615) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg38)
void me_set_control_port_req_handler(Eq_2 ra, struct Eq_85615 * a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg38)
{
	struct Eq_85620 * a5_13 = (word32) a1->b0000;
	struct Eq_85625 * a3_26 = (word32) a5_13->b4201EC2A;
	word32 a5_29 = (word32) ((word32) a1->b0001 != 0x00);
	a5_13->b4201EC41 = (byte) (a5_29 + 0x01);
	Eq_2 s1_19 = a3;
	Eq_2 a4_33 = (word32) a3_26->b420205A6;
	if (a4_33 == 0x00)
	{
		a4_33.u0 = 0x02;
		if (a5_29 == ~0x00)
		{
			Eq_2 a0_41;
			struct Eq_85677 * s0_49;
			word32 s1_133;
			word32 a1_134;
			word32 a2_135;
			word32 a3_136;
			word32 a4_137;
			word32 a5_138;
			word32 a6_139;
			word32 s2_140;
			word32 s3_141;
			word32 s4_142;
			word32 s8_143;
			ra = ke_msg_alloc(ra, 0x01000413, 0x05, 0x02, 0x02, mstatus, dwArg08, out s0_49, out s1_133, out a0_41, out a1_134, out a2_135, out a3_136, out a4_137, out a5_138, out a6_139, out s2_140, out s3_141, out s4_142, out s8_143);
			*a0_41 = 0x00;
			*((word32) a0_41 + 1) = (byte) (word32) s0_49->b001A;
			word32 a0_144;
			word32 a1_145;
			word32 a2_146;
			word32 a3_147;
			word32 a5_148;
			word32 s2_149;
			word32 s3_150;
			word32 s4_151;
			word32 s8_152;
			ke_msg_send(a0_41, mstatus, out s1_19, out a0_144, out a1_145, out a2_146, out a3_147, out a4_33, out a5_148, out s2_149, out s3_150, out s4_151, out s8_152);
		}
	}
	word32 s2_129;
	word32 a3_128;
	word32 a0_127;
	word32 s1_126;
	word32 s0_125;
	word32 s3_130;
	word32 s4_131;
	word32 s8_132;
	ke_msg_send_basic(ra, 0x01000405, s1_19, a4_33, mstatus, dwLoc08, out s0_125, out s1_126, out a0_127, out a3_128, out s2_129, out s3_130, out s4_131, out s8_132);
	0x00 = dwArg38;
}

// 2301DBA4: void me_chan_config_req_handler(Register Eq_2 ra, Register Eq_2 a1, Register ptr32 mstatus)
void me_chan_config_req_handler(Eq_2 ra, Eq_2 a1, ptr32 mstatus)
{
	Eq_2 a4_16;
	Eq_2 a3_21;
	word32 a1_64;
	word32 a2_65;
	word32 a5_66;
	word32 a6_67;
	word32 a7_68;
	memcpy(0x42020B6C, a1, 0x00FE, out a1_64, out a2_65, out a3_21, out a4_16, out a5_66, out a6_67, out a7_68);
	word32 s0_69;
	word32 s1_70;
	word32 a0_71;
	word32 a3_72;
	word32 s2_73;
	word32 s3_74;
	word32 s4_75;
	word32 s8_76;
	ke_msg_send_basic(ra, 0x01000403, a3_21, a4_16, mstatus, dwLoc18, out s0_69, out s1_70, out a0_71, out a3_72, out s2_73, out s3_74, out s4_75, out s8_76);
}

// 2301DBD8: void mm_set_ps_mode_cfm_handler(Register Eq_2 ra, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_set_ps_mode_cfm_handler(Eq_2 ra, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_11;
	Eq_2 a4_13;
	word32 a2_87;
	word32 s2_88;
	ke_state_get(a2, dwArg28, out a0_11, out a2_87, out a4_13, out s2_88);
	Eq_2 s0_10 = a2;
	if (a0_11 == 0x01)
	{
		Eq_2 a1_25 = (word32) g_w42020B44;
		if (a1_25 != 0x00FF)
		{
			word32 s1_97;
			word32 a0_98;
			word32 a3_99;
			word32 s2_100;
			word32 s3_101;
			word32 s4_102;
			word32 s8_103;
			ke_msg_send_basic(ra, 0x01000414, a1_25, a4_13, mstatus, dwLoc08, out s0_10, out s1_97, out a0_98, out a3_99, out s2_100, out s3_101, out s4_102, out s8_103);
		}
		word32 s1_89;
		word32 a0_90;
		word32 a1_91;
		word32 a4_92;
		word32 a5_93;
		word32 s2_94;
		word32 s3_95;
		word32 s4_96;
		ke_state_set(s0_10, 0x00, mstatus, out s1_89, out a0_90, out a1_91, out a4_92, out a5_93, out s2_94, out s3_95, out s4_96);
	}
	else
		assert_err();
}

// 2301DC32: void mm_set_idle_cfm_handler(Register Eq_2 ra, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_set_idle_cfm_handler(Eq_2 ra, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_11;
	Eq_2 a4_13;
	word32 a2_87;
	word32 s2_88;
	ke_state_get(a2, dwArg28, out a0_11, out a2_87, out a4_13, out s2_88);
	Eq_2 s0_10 = a2;
	if (a0_11 == 0x01)
	{
		Eq_2 a1_25 = (word32) g_w42020B44;
		if (a1_25 != 0x00FF)
		{
			word32 s1_97;
			word32 a0_98;
			word32 a3_99;
			word32 s2_100;
			word32 s3_101;
			word32 s4_102;
			word32 s8_103;
			ke_msg_send_basic(ra, 0x01000412, a1_25, a4_13, mstatus, dwLoc08, out s0_10, out s1_97, out a0_98, out a3_99, out s2_100, out s3_101, out s4_102, out s8_103);
		}
		word32 s1_89;
		word32 a0_90;
		word32 a1_91;
		word32 a4_92;
		word32 a5_93;
		word32 s2_94;
		word32 s3_95;
		word32 s4_96;
		ke_state_set(s0_10, 0x00, mstatus, out s1_89, out a0_90, out a1_91, out a4_92, out a5_93, out s2_94, out s3_95, out s4_96);
	}
	else
		assert_err();
}

