pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301DC8C: void me_config_req_handler(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus)
void me_config_req_handler(Eq_2 ra, Eq_2 a4, Eq_2 s2, ptr32 mstatus)
{
	Eq_2 s1_39;
	Eq_2 s4_42;
	word32 s8_223;
	word32 s2_221;
	word32 s3_222;
	word32 a5_219;
	word32 a6_220;
	word32 a3_217;
	word32 a4_218;
	word32 a1_215;
	word32 a2_216;
	word32 s0_213;
	word32 a0_214;
	Eq_2 ra_37 = ke_msg_alloc(ra, 49, 0x00, 0x01, a4, mstatus, dwLoc08, out s0_213, out s1_39, out a0_214, out a1_215, out a2_216, out a3_217, out a4_218, out a5_219, out a6_220, out s2_221, out s3_222, out s4_42, out s8_223);
	g_b42020B6A = (byte) (word32) *((word32) s1_39 + 46);
	Eq_2 a4_56;
	word32 a2_225;
	word32 a5_227;
	word32 a7_229;
	word32 a3_226;
	word32 a6_228;
	word32 a1_224;
	memcpy(0x42020B48, s1_39, 32, out a1_224, out a2_225, out a3_226, out a4_56, out a5_227, out a6_228, out a7_229);
	uint32 a0_73;
	struct Eq_85972 * s0_81;
	struct Eq_85973 * s1_82;
	struct Eq_85974 * s2_83;
	Eq_2 s3_84;
	word32 a3_230;
	word32 s4_231;
	word32 s8_232;
	ke_msg_send_basic(ra_37, 0x01000401, s4_42, a4_56, mstatus, s2, out s0_81, out s1_82, out a0_73, out a3_230, out s2_83, out s3_84, out s4_231, out s8_232);
	if ((word32) s2_83->b002E != 0x00)
	{
		word32 a0_94 = phy_get_nss(a0_73);
		ui32 a5_100 = (word32) s0_81->wFFFFFB48 >> 1 & 0x01;
		s0_81->tFFFFFC6A = (byte) (a0_94 + 0x01 >> 1);
		s0_81->bFFFFFC6B = (byte) a5_100;
	}
	else
		s0_81->tFFFFFC6A.u1 = 0x00;
	s0_81->wFFFFFB68 = (word16) (word32) s1_82->w002C;
	word32 a5_108 = (word32) s1_82->b0030;
	s0_81->bFFFFFC6C = (byte) a5_108;
	if (a5_108 != 0x00)
	{
		s0_81->wFFFFFB44 = 0xFF;
		*s3_84 = 0x02;
		word32 s1_233;
		word32 a0_234;
		word32 a1_235;
		word32 a2_236;
		word32 a3_237;
		word32 a4_238;
		word32 a5_239;
		word32 s2_240;
		word32 s3_241;
		word32 s4_242;
		word32 s8_243;
		ke_msg_send(s3_84, mstatus, out s1_233, out a0_234, out a1_235, out a2_236, out a3_237, out a4_238, out a5_239, out s2_240, out s3_241, out s4_242, out s8_243);
		word32 s1_244;
		word32 a0_245;
		word32 a1_246;
		word32 a4_247;
		word32 a5_248;
		word32 s2_249;
		word32 s3_250;
		word32 s4_251;
		ke_state_set(0x05, 0x01, mstatus, out s1_244, out a0_245, out a1_246, out a4_247, out a5_248, out s2_249, out s3_250, out s4_251);
	}
}

// 2301DD48: void me_set_ps_disable_req_handler(Register Eq_2 ra, Register (ptr32 Eq_86097) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18)
void me_set_ps_disable_req_handler(Eq_2 ra, struct Eq_86097 * a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18)
{
	Eq_2 s2_125 = a3;
	if ((word32) g_b42020C6C != 0x00)
	{
		word32 a0_26;
		word32 a2_236;
		word32 a4_237;
		ke_state_get(0x05, dwArg18, out a0_26, out a2_236, out a4_237, out s2_125);
		if (a0_26 == 0x01)
			return;
		a4 = g_t42020B40;
		word32 a3_37 = (word32) a1->b0000;
		if (a4 != 0x00)
		{
			if (a3_37 != 0x00)
			{
				g_t42020B40 = 0x01 << (word32) a1->b0001 | a4;
				goto l2301DD68;
			}
		}
		else if (a3_37 == 0x00)
			goto l2301DD68;
		struct Eq_86162 * a5_77;
		struct Eq_86163 * s0_75;
		Eq_2 a0_53;
		word32 s2_63;
		struct Eq_86166 * s3_64;
		word32 s0_246;
		word32 s1_247;
		word32 a1_248;
		word32 a2_249;
		word32 a3_250;
		word32 a4_251;
		word32 a5_252;
		word32 a6_253;
		word32 s4_254;
		word32 s8_255;
		ke_msg_alloc(ra, 49, 0x00, 0x01, a4, mstatus, dwLoc08, out s0_246, out s1_247, out a0_53, out a1_248, out a2_249, out a3_250, out a4_251, out a5_252, out a6_253, out s2_63, out s3_64, out s4_254, out s8_255);
		struct Eq_86196 * a4_72 = (word32) s3_64->b0001;
		if ((word32) s3_64->b0000 != 0x00)
		{
			s0_75 = a4_72->ptr0004;
			a5_77 = 0x01 << a4_72 | a4_72;
		}
		else
		{
			s0_75 = a4_72->ptr0004;
			a5_77 = ~(0x01 << a4_72) & a4_72;
		}
		a5_77->ptr0004 = s0_75;
		s0_75->w0008 = (word16) s2_63;
		*a0_53 = (byte) ((word32) (a5_77 < (struct Eq_86162 *) 1) << 1);
		Eq_2 s1_99;
		word32 a0_256;
		word32 a1_257;
		word32 a2_258;
		word32 a3_259;
		word32 a4_260;
		word32 a5_261;
		word32 s2_262;
		word32 s3_263;
		word32 s4_264;
		word32 s8_265;
		ke_msg_send(a0_53, mstatus, out s1_99, out a0_256, out a1_257, out a2_258, out a3_259, out a4_260, out a5_261, out s2_262, out s3_263, out s4_264, out s8_265);
		word32 s1_266;
		word32 a0_267;
		word32 a1_268;
		word32 a4_269;
		word32 a5_270;
		word32 s2_271;
		word32 s3_272;
		word32 s4_273;
		ke_state_set(s1_99, 0x01, mstatus, out s1_266, out a0_267, out a1_268, out a4_269, out a5_270, out s2_271, out s3_272, out s4_273);
	}
	else
	{
l2301DD68:
		word32 a3_241;
		word32 s3_243;
		word32 a0_240;
		word32 s1_239;
		word32 s4_244;
		word32 s8_245;
		word32 s2_242;
		word32 s0_238;
		ke_msg_send_basic(ra, 0x01000414, s2_125, a4, mstatus, s2, out s0_238, out s1_239, out a0_240, out a3_241, out s2_242, out s3_243, out s4_244, out s8_245);
	}
}

// 2301DE0E: void me_set_active_req_handler(Register Eq_2 ra, Register (ptr32 Eq_86280) a1, Register (ptr32 Eq_2) a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg18)
void me_set_active_req_handler(Eq_2 ra, struct Eq_86280 * a1, union Eq_2 * a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg18)
{
	word32 a0_21;
	Eq_2 s2_26;
	word32 a2_226;
	word32 a4_227;
	ke_state_get(0x05, dwArg18, out a0_21, out a2_226, out a4_227, out s2_26);
	if (a0_21 == 0x01)
		return;
	Eq_2 a4_31 = *a3;
	word32 a2_32 = (word32) a1->b0000;
	if (a3 != null)
	{
		if (a2_32 == 0x00)
		{
l2301DE44:
			struct Eq_86324 ** a5_102;
			struct Eq_86324 * s0_100;
			Eq_2 a0_78;
			word32 s2_88;
			struct Eq_86327 * s3_89;
			word32 s0_228;
			word32 s1_229;
			word32 a1_230;
			word32 a2_231;
			word32 a3_232;
			word32 a4_233;
			word32 a5_234;
			word32 a6_235;
			word32 s4_236;
			word32 s8_237;
			ke_msg_alloc(ra, 0x0022, 0x00, 0x01, a4_31, mstatus, dwLoc08, out s0_228, out s1_229, out a0_78, out a1_230, out a2_231, out a3_232, out a4_233, out a5_234, out a6_235, out s2_88, out s3_89, out s4_236, out s8_237);
			struct Eq_86324 ** a4_97 = (word32) s3_89->b0001;
			if ((word32) s3_89->b0000 != 0x00)
			{
				s0_100 = (struct Eq_86324 *) *a4_97;
				a5_102 = 0x01 << a4_97 | a4_97;
			}
			else
			{
				s0_100 = (struct Eq_86324 *) *a4_97;
				a5_102 = ~(0x01 << a4_97) & a4_97;
			}
			*a5_102 = (struct Eq_86324 **) s0_100;
			s0_100->w0008 = (word16) s2_88;
			*a0_78 = (byte) (word32) (a5_102 < (struct Eq_86324 **) 1);
			Eq_2 s1_123;
			word32 a0_238;
			word32 a1_239;
			word32 a2_240;
			word32 a3_241;
			word32 a4_242;
			word32 a5_243;
			word32 s2_244;
			word32 s3_245;
			word32 s4_246;
			word32 s8_247;
			ke_msg_send(a0_78, mstatus, out s1_123, out a0_238, out a1_239, out a2_240, out a3_241, out a4_242, out a5_243, out s2_244, out s3_245, out s4_246, out s8_247);
			word32 s1_248;
			word32 a0_249;
			word32 a1_250;
			word32 a4_251;
			word32 a5_252;
			word32 s2_253;
			word32 s3_254;
			word32 s4_255;
			ke_state_set(s1_123, 0x01, mstatus, out s1_248, out a0_249, out a1_250, out a4_251, out a5_252, out s2_253, out s3_254, out s4_255);
			return;
		}
		*(0x01 << (word32) a1->b0001 | a3) = (union Eq_2 *) a4_31;
	}
	else if (a2_32 != 0x00)
		goto l2301DE44;
	word32 s0_256;
	word32 s1_257;
	word32 a0_258;
	word32 a3_259;
	word32 s2_260;
	word32 s3_261;
	word32 s4_262;
	word32 s8_263;
	ke_msg_send_basic(ra, 0x01000412, s2_26, a4_31, mstatus, s2, out s0_256, out s1_257, out a0_258, out a3_259, out s2_260, out s3_261, out s4_262, out s8_263);
}

// 2301DEC2: void me_sta_add_req_handler(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_6667) s4, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack word32 dwArg0138)
void me_sta_add_req_handler(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, struct Eq_6667 * s4, Eq_2 s7, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, word32 dwArg0138)
{
	word16 wLoc46_502 = SLICE(dwLoc48, word16, 16);
	Eq_2 s2_112;
	struct Eq_21638 * s1_107;
	byte * a0_35;
	word32 a3_679;
	word32 s0_675;
	word32 a2_678;
	word32 s1_676;
	word32 a1_677;
	word32 a4_680;
	word32 a5_681;
	word32 s3_684;
	word32 a6_682;
	word32 s4_685;
	word32 s2_683;
	word32 s8_686;
	Eq_2 ra_42 = ke_msg_alloc(ra, 0x01000408, a3, 0x03, a4, mstatus, dwLoc48, out s0_675, out s1_676, out a0_35, out a1_677, out a2_678, out a3_679, out a4_680, out a5_681, out a6_682, out s2_683, out s3_684, out s4_685, out s8_686);
	struct Eq_54297 * a5_55 = rxu_cntrl_get_pm();
	Eq_2 s0_56 = a5_55->t0040;
	if ((a5_55 & 0x02) != 0x00)
	{
		int32 a5_62 = (word32) *((word32) s0_56 + 22);
		s2_112.u0 = 0x01;
		int32 a5_67 = a5_62 >> 2 & 0x07;
		if (a5_67 > 0x02)
			s2_112 = 0x01 << a5_67 + ~0x02 & 0x00FF;
		s1_107 = (word32) (word16) ((0x01 << (a5_62 & 3) + 0x0D) + ~0x00);
	}
	else
	{
		s2_112.u0 = 0x00;
		s1_107 = null;
	}
	Eq_2 a4_86;
	word32 a3_689;
	word32 a6_691;
	word32 a7_692;
	word32 a5_690;
	word32 a2_688;
	word32 a1_687;
	memcpy(fp + -70, s0_56, 0x06, out a1_687, out a2_688, out a3_689, out a4_86, out a5_690, out a6_691, out a7_692);
	Eq_2 a5_99 = (word32) *((word32) s0_56 + 84);
	Eq_2 dwLoc48_504 = SEQ(wLoc46_502, (word16) s1_107);
	word32 s0_135;
	word32 s4_141;
	word32 a0_154;
	Eq_2 s5_142;
	Eq_2 ra_134 = mm_sta_add(ra_42, s1_107, fp + -80, a0_35, a4_86, (word32) *((word32) *((word32) a5_99 + 80) + 0x0055), s2_112, s7, mstatus, dwLoc50, a5_99, dwLoc48_504, dwLoc28, dwLoc04, dwArg08, dwArg18, 0x00, s9, s1, dwArg58, dwArg78, dwArg98, dwArgB8, out s0_135, out a0_154, out s4_141, out s5_142);
	*((word32) s5_142 + 1) = (byte) a0_154;
	if (a0_154 != 0x00)
	{
l2301E0AA:
		word32 s8_703;
		word32 a3_697;
		word32 a5_699;
		word32 s2_700;
		word32 s3_701;
		word32 s4_702;
		word32 a4_698;
		word32 a1_695;
		word32 a2_696;
		word32 s1_693;
		word32 a0_694;
		ke_msg_send(s5_142, mstatus, out s1_693, out a0_694, out a1_695, out a2_696, out a3_697, out a4_698, out a5_699, out s2_700, out s3_701, out s4_702, out s8_703);
		return;
	}
	Eq_2 s9_221;
	struct Eq_86636 * s1_156 = (word32) *s5_142;
	struct Eq_86641 * a5_169;
	word32 a7_709;
	word32 a2_705;
	word32 a3_706;
	word32 a4_707;
	word32 a6_708;
	word32 a1_704;
	memcpy(&s1_156->w4201EC28 + 76, s0_135 + 6, 0x0D, out a1_704, out a2_705, out a3_706, out a4_707, out a5_169, out a6_708, out a7_709);
	struct Eq_86662 * s0_181 = a5_169->ptr0040;
	if ((a5_169 & 0x01) != 0x00)
	{
		int32 a5_183 = s1_156->dw4201ECFC;
		s1_156->dw4201ECFC = a5_183 | 1;
		s0_181 = (a5_183 | 1)->ptr0040;
		if (((a5_183 | 1) & 0x02) != 0x00 && (word32) g_b42020B6A != 0x00)
		{
			s1_156->dw4201ECFC = a5_183 | 3;
			word32 a1_713;
			word32 a7_719;
			word32 a3_715;
			word32 a4_716;
			word32 a5_717;
			word32 a6_718;
			word32 a2_714;
			memcpy(&s1_156->w4201EC28 + 84, (char *) s0_181 + 20, 32, out a1_713, out a2_714, out a3_715, out a4_716, out a5_717, out a6_718, out a7_719);
			word32 a4_720;
			s9_221 = me_set_sta_ht_vht_param((char *) s1_156 + 1107422224, s4_141 + 0x420208A8, out a4_720);
l2301DFAE:
			s1_156->b4201ED02 = (byte) (word32) s0_181->b0046;
			s1_156->b4201ED03 = (byte) (word32) s0_181->b0047;
			s1_156->w4201EC28 = (word16) (word32) s0_181->w0044;
			struct Eq_86795 * a5_265;
			struct Eq_86706 * s8_279;
			word32 s9_280;
			word32 a3_721;
			ptr32 s1_270;
			int32 s3_274;
			word32 s7_278;
			word32 s6_277;
			word32 s4_275;
			Eq_2 ra_268 = me_init_rate(ra_134, (char *) s1_156 + 1107422224, s9_221, fflags, frm, mstatus, dwLoc54, s4, dwLoc28, dwArg08, dwArg88, dwArgB8, dwArg0138, out s1_270, out a3_721, out a5_265, out s3_274, out s4_275, out s5_142, out s6_277, out s7_278, out s8_279, out s9_280);
			struct Eq_86693 * s0_288 = a5_265->ptr0040;
			if ((a5_265 & 0x10) != 0x00)
			{
				uint32 a1_290 = (word32) s0_288->b0048;
				if ((int32) (byte) a1_290 >= 0x00)
				{
					word32 a4_711;
					word32 a5_712;
					word32 a1_710;
					ra_268 = me_sta_bw_nss_max_upd((word32) s8_279->b001B, a1_290 & 0x03, a1_290 >> 0x04, dwArg58, out s1_270, out a1_710, out a4_711, out a5_712, out s3_274, out s4_275, out s5_142, out s6_277, out s7_278);
				}
			}
			if (s9_280 != 0x00)
			{
				word32 a4_723;
				word32 a5_724;
				word32 a1_722;
				ra_268 = me_sta_bw_nss_max_upd((word32) (s1_270 + 432 + s3_274)->b001B, 0x00FF, 0x00, dwArg58, out s1_270, out a1_722, out a4_723, out a5_724, out s3_274, out s4_275, out s5_142, out s6_277, out s7_278);
			}
			struct Eq_86818 * a5_355 = s1_270 + 432 + s3_274;
			a5_355->b011A = (byte) ((word32) a5_355->b011A | 16);
			Eq_2 a4_366 = s4_275 + 0x05D8 + s7_278;
			a5_355->b0031 = (byte) ((word32) ((*((word32) a4_366 + 0x05C4) & 0x01) < 1) + 0x01);
			uint32 a3_372 = (word32) *((word32) a4_366 + 844);
			a5_355->w0038 = (word16) (a3_372 >> 8 | a3_372 << 0x08);
			*((word32) s5_142 + 2) = (byte) s6_277;
			if (s6_277 != 0x00)
			{
				a5_355->b001C = (byte) s6_277;
				if ((word32) *((word32) a4_366 + 842) == 0x00)
				{
					Eq_2 a0_397;
					word32 s0_405;
					int32 s2_407;
					ptr32 s3_408;
					word32 s8_733;
					word32 s1_725;
					word32 a6_731;
					word32 s4_732;
					word32 a2_727;
					word32 a3_728;
					word32 a4_729;
					word32 a5_730;
					word32 a1_726;
					ke_msg_alloc(ra_268, 73, 0x0D, 0x02, a4_366, mstatus, dwLoc48_504, out s0_405, out s1_725, out a0_397, out a1_726, out a2_727, out a3_728, out a4_729, out a5_730, out a6_731, out s2_407, out s3_408, out s4_732, out s8_733);
					(s3_408 + s2_407)->b001C = 0x01;
					*a0_397 = (byte) s0_405;
					*((word32) a0_397 + 1) = 0x01;
					word32 s2_741;
					word32 s3_742;
					word32 s8_743;
					word32 a4_739;
					word32 a5_740;
					word32 a0_735;
					word32 a1_736;
					word32 a2_737;
					word32 a3_738;
					word32 s1_734;
					ke_msg_send(a0_397, mstatus, out s1_734, out a0_735, out a1_736, out a2_737, out a3_738, out a4_739, out a5_740, out s2_741, out s3_742, out s4_275, out s8_743);
				}
				struct Eq_86903 * s7_439 = s7_278 + (s4_275 + 0x05D8);
				s7_439->b034A = (byte) ((word32) s7_439->b034A + 0x01);
			}
			goto l2301E0AA;
		}
	}
	s9_221.u0 = 0x00;
	goto l2301DFAE;
}

// 2301E122: void cfm_raw_send(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cfm_raw_send(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 a7_43;
	word32 s2_44;
	word32 s3_45;
	word32 s4_46;
	word32 s5_47;
	word32 s6_48;
	word32 s7_49;
	word32 s8_50;
	word32 s9_51;
	word32 s10_52;
	word32 s11_53;
	word32 t4_54;
	printf(ra, &g_t230AE450, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42, out a7_43, out s2_44, out s3_45, out s4_46, out s5_47, out s6_48, out s7_49, out s8_50, out s9_51, out s10_52, out s11_53, out t4_54);
}

// 2301E12E: void scanu_raw_send_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg18, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void scanu_raw_send_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg18, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a3_26;
	Eq_2 a4_27;
	Eq_2 a4_51;
	Eq_2 a5_52;
	word32 s1_206;
	word32 a0_207;
	word32 a1_208;
	word32 a2_209;
	word32 a5_210;
	word32 a7_211;
	word32 s2_212;
	word32 s3_213;
	word32 s4_214;
	word32 s5_215;
	word32 s6_216;
	word32 s7_217;
	word32 s8_218;
	word32 s9_219;
	word32 s10_220;
	word32 s11_221;
	word32 t4_222;
	Eq_2 ra_54 = scanu_raw_send_cfm(printf(ra, &g_t230AE4C4, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_206, out a0_207, out a1_208, out a2_209, out a3_26, out a4_27, out a5_210, out a7_211, out s2_212, out s3_213, out s4_214, out s5_215, out s6_216, out s7_217, out s8_218, out s9_219, out s10_220, out s11_221, out t4_222), a3_26, a4_27, mstatus, s2, out a4_51, out a5_52);
	Eq_2 s1_76;
	struct Eq_87100 * a0_81;
	Eq_2 s2_85;
	word32 s0_223;
	word32 a1_224;
	word32 a3_225;
	word32 a4_226;
	word32 a5_227;
	word32 s3_228;
	word32 s4_229;
	word32 s5_230;
	word32 s6_231;
	word32 s7_232;
	word32 s8_233;
	word32 s9_234;
	word32 s10_235;
	word32 s11_236;
	txl_frame_get(ra_54, 0x00, (struct Eq_25902 *) 0x0100, a4_51, a5_52, fflags, frm, mstatus, dwArgE8, dwArg0108, dwArg0128, out s0_223, out s1_76, out a0_81, out a1_224, out a3_225, out a4_226, out a5_227, out s2_85, out s3_228, out s4_229, out s5_230, out s6_231, out s7_232, out s8_233, out s9_234, out s10_235, out s11_236);
	if (a0_81 != null)
	{
		struct Eq_87139 * a4_97;
		word32 a1_237;
		word32 a2_238;
		word32 a3_239;
		word32 a5_240;
		word32 a6_241;
		word32 a7_242;
		memcpy(a0_81->dw0068 + 332, s2_85, s1_76, out a1_237, out a2_238, out a3_239, out a4_97, out a5_240, out a6_241, out a7_242);
		a0_81->b0030 = ~0x00;
		a0_81->dw02CC = 0x2301E122;
		struct Eq_87168 * s0_115 = g_ptr2301E18E;
		s0_115->b002F = 0x00;
		s0_115->b005E = 0x00;
		s0_115->b0060 = 0x00;
		s0_115->ptr02D0 = s0_115;
		Eq_2 a5_120 = a4_97->t0014;
		*((char *) &(a4_97 + ((word32) s1_76 - 1) / 24)->t0014 + 4) = (struct Eq_87139 *) a5_120;
		*((word32) s1_76 + 32) = a5_120;
		txl_frame_push_force(ra_54, 0x03, (word32) s1_76 - 1, a5_120, mstatus, dwArg18, dwArg78, dwArgA8, dwArgDC);
	}
}

struct Eq_87168 * g_ptr2301E18E = &g_tF230204;
// 2301E1C0: void scanu_join_req_handler(Register Eq_2 ra, Register (ptr32 Eq_48384) s0, Register (ptr32 Eq_87206) a1, Register word32 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void scanu_join_req_handler(Eq_2 ra, struct Eq_48384 * s0, struct Eq_87206 * a1, word32 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	g_a42020930[(word32) a1->b014E] = 0x00;
	g_w42021714 = (word16) a3;
	g_t42021716.u1 = 0x01;
	Eq_46250 a4_20 = a1->t0140;
	a1->dw0000 = 0x420215AC;
	g_t42021718 = a4_20;
	g_t4202171C = (word16) (word32) a1->w0144;
	if (((word32) a1->t0140 & 0x01) == 0x00)
		scanu_start(ra, s0, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158);
	else
		assert_err();
}

// 2301E22E: void scanu_start_req_handler(Register Eq_2 ra, Register (ptr32 Eq_48384) s0, Register (ptr32 Eq_87259) a1, Register word32 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void scanu_start_req_handler(Eq_2 ra, struct Eq_48384 * s0, struct Eq_87259 * a1, word32 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	g_w42021714 = (word16) a3;
	g_t42021716.u1 = 0x00;
	Eq_46250 a4_12 = a1->t0140;
	a1->dw0000 = 0x420215AC;
	g_t42021718 = a4_12;
	g_t4202171C = (word16) (word32) a1->w0144;
	scanu_start(ra, s0, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158);
}

// 2301E260: void rxu_mgt_ind_handler(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 s3, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg98)
void rxu_mgt_ind_handler(Eq_2 ra, Eq_2 a1, Eq_2 s3, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg98)
{
	scanu_frame_handler(ra, a1, s3, s6, dwArg08, dwArg98);
}

// 2301E266: void scan_done_ind_handler(Register Eq_2 ra, Register ptr32 mstatus)
void scan_done_ind_handler(Eq_2 ra, ptr32 mstatus)
{
	word32 a4_8 = (word32) g_b42021717;
	g_b42021717 = (byte) (a4_8 + 0x01);
	scanu_scan_next(ra, a4_8 + 0x01, mstatus);
}

