pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301E288: void scan_start_cfm_handler(Register Eq_2 ra, Register (ptr32 byte) a1, Register Eq_2 a4, Register ptr32 mstatus)
void scan_start_cfm_handler(Eq_2 ra, byte * a1, Eq_2 a4, ptr32 mstatus)
{
	if ((word32) *a1 == 0x00)
		return;
	scanu_confirm(ra, a4, mstatus);
}

// 2301E2A2: void me_set_ps_disable_cfm_handler(Register ptr32 mstatus, Stack Eq_2 dwArg28)
void me_set_ps_disable_cfm_handler(ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	word32 s2_107;
	word32 a4_106;
	word32 a2_105;
	ke_state_get(0x06, dwArg28, out a0_7, out a2_105, out a4_106, out s2_107);
	if (a0_7 != 0x04)
	{
		word32 a0_16;
		word32 s2_112;
		word32 a4_111;
		word32 a2_110;
		ke_state_get(0x06, dwArg28, out a0_16, out a2_110, out a4_111, out s2_112);
		if (a0_16 != 0x00)
		{
			word32 a0_24;
			word32 a2_113;
			word32 a4_114;
			word32 s2_115;
			ke_state_get(0x06, dwArg28, out a0_24, out a2_113, out a4_114, out s2_115);
			if (a0_24 != 0x08)
				assert_err();
		}
	}
	word32 a0_40;
	Eq_2 a4_42;
	word32 s2_109;
	word32 a2_108;
	ke_state_get(0x06, dwArg28, out a0_40, out a2_108, out a4_42, out s2_109);
	if (a0_40 == 0x04)
		sm_send_next_bss_param(a4_42, 0x04, mstatus);
}

// 2301E2F6: void mm_bss_param_setting_handler(Register ptr32 mstatus, Stack Eq_2 dwArg28)
void mm_bss_param_setting_handler(ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	Eq_2 a4_9;
	word32 a2_42;
	word32 s2_43;
	ke_state_get(0x06, dwArg28, out a0_7, out a2_42, out a4_9, out s2_43);
	if (a0_7 == 0x04)
		sm_send_next_bss_param(a4_9, 0x04, mstatus);
	else
		assert_err();
}

// 2301E32A: void sm_rsp_timeout_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArg0118)
void sm_rsp_timeout_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgB8, Eq_2 dwArg0118)
{
	word32 a0_7;
	word32 a2_131;
	word32 a4_132;
	word32 s2_133;
	ke_state_get(0x06, dwArg28, out a0_7, out a2_131, out a4_132, out s2_133);
	if (a0_7 != 0x05)
	{
		word32 a0_16;
		word32 a2_134;
		word32 a4_135;
		word32 s2_136;
		ke_state_get(0x06, dwArg28, out a0_16, out a2_134, out a4_135, out s2_136);
		if (a0_16 != 0x06)
			return;
	}
	word32 a4_137;
	word32 s2_138;
	word32 s3_139;
	word32 s4_140;
	word32 s10_141;
	sm_connect_ind(ra, s0, s5, s6, mstatus, dwLoc08, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArg0118, out a4_137, out s2_138, out s3_139, out s4_140, out s10_141);
}

// 2301E356: void scanu_start_cfm_handler(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack word32 dwArg0178)
void scanu_start_cfm_handler(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0108, word32 dwArg0178)
{
	word32 a0_9;
	word32 a2_169;
	word32 a4_170;
	word32 s2_171;
	Eq_2 s1_13 = ke_state_get(0x06, dwArg18, out a0_9, out a2_169, out a4_170, out s2_171);
	if (a0_9 == 0x01)
	{
		Eq_2 a0_25;
		word32 a1_26;
		Eq_2 a4_29;
		Eq_2 s5_41;
		Eq_2 s6_42;
		Eq_2 ra_33 = sm_get_bss_params(ra, s1_13, fp + ~0x17, fp + ~0x13, a3, dwArg10, dwArg14, dwArg5C, dwArgC8, dwArg0178, out a0_25, out a1_26, out a4_29, out s5_41, out s6_42);
		if (a0_25 != 0x00 && a1_26 != 0x00)
			sm_join_bss(ra_33, a0_25, a4_29, mstatus);
		else
		{
			word32 a4_172;
			word32 s2_173;
			word32 s3_174;
			word32 s4_175;
			word32 s10_176;
			sm_connect_ind(ra_33, dwArg24, s5_41, s6_42, mstatus, dwLoc18, dwArg20, dwArg24, dwArg48, ra, dwArgA8, dwArg0108, out a4_172, out s2_173, out s3_174, out s4_175, out s10_176);
		}
	}
	else
		assert_err();
}

// 2301E3A8: void mm_connection_loss_ind_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0138)
void mm_connection_loss_ind_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg68, Eq_2 dwArgD8, Eq_2 dwArg0138)
{
	word32 a0_15;
	struct Eq_87535 * s2_20;
	word32 a2_132;
	word32 a4_133;
	ke_state_get(0x06, dwArg28, out a0_15, out a2_132, out a4_133, out s2_20);
	if (a0_15 == 0x00 && ((word32) s2_20->b420205A6 == 0x00 && (word32) s2_20->b420205A8 != 0x00))
	{
		Eq_2 a4_36;
		word32 s1_134;
		word32 a0_135;
		word32 a1_136;
		word32 a5_137;
		word32 s2_138;
		word32 s3_139;
		word32 s4_140;
		ke_state_set(0x06, 0x08, mstatus, out s1_134, out a0_135, out a1_136, out a4_36, out a5_137, out s2_138, out s3_139, out s4_140);
		word32 a4_141;
		word32 s4_142;
		sm_disconnect_process(ra, a4_36, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg68, dwArgD8, dwArg0138, out a4_141, out s4_142);
	}
	0x00 = dwArg38;
}

// 2301E3FE: void scanu_join_cfm_handler(Register Eq_2 ra, Register Eq_2 s3, Register word32 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void scanu_join_cfm_handler(Eq_2 ra, Eq_2 s3, word32 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgF8, word32 dwArg0128)
{
	Eq_2 s3_12 = g_t42021740;
	word32 a0_19;
	word32 s2_402;
	word32 a2_400;
	word32 a4_401;
	ke_state_get(0x06, dwArg08, out a0_19, out a2_400, out a4_401, out s2_402);
	byte bLoc21_302 = SLICE(s4, byte, 24);
	if (a0_19 == 0x02)
	{
		struct Eq_87619 * s4_33 = (word32) *((word32) s3_12 + 61);
		if (s4_33->dw42020930 < 0x00)
		{
			word32 s2_133;
			struct Eq_87638 * s3_134;
			word32 s4_135;
			word32 a0_102;
			Eq_2 a4_106;
			Eq_2 s5_114;
			Eq_2 s6_115;
			Eq_2 s0_109 = sm_add_chan_ctx(fp + -33, dwArg58, out a0_102, out a4_106, out s5_114, out s6_115);
			if (a0_102 == 0x00)
			{
				Eq_2 a3_155;
				Eq_2 s2_162;
				struct Eq_87669 * s3_163;
				struct Eq_87670 * s1_181;
				struct Eq_87671 * s3_183;
				word32 s2_416;
				word32 s4_417;
				word32 s8_414;
				word32 a4_415;
				word32 a6_412;
				word32 s4_413;
				word32 a4_410;
				word32 a5_411;
				word32 a1_408;
				word32 a2_409;
				word32 s1_406;
				word32 a0_407;
				word32 s0_405;
				Eq_2 s0_180 = chan_ctxt_link(ke_msg_alloc(ra, 0x0A, 0x00, 32, a4_106, mstatus, dwLoc18, out s0_405, out s1_406, out a0_407, out a1_408, out a2_409, out a3_155, out a4_410, out a5_411, out a6_412, out s2_162, out s3_163, out s4_413, out s8_414), (word32) s3_163->b003D, (word32) bLoc21_302, a3_155, s2_162, mstatus, out s1_181, out a4_415, out s2_416, out s3_183, out s4_417);
				*((word32) s0_180 + 0x0011) = (byte) (word32) s3_183->b003D;
				word32 a3_420;
				word32 a4_421;
				word32 a5_422;
				word32 a6_423;
				word32 a7_424;
				word32 a1_418;
				word32 a2_419;
				memcpy((word32) s0_180 + 0x0A, &s1_181->b035A + 30, 0x06, out a1_418, out a2_419, out a3_420, out a4_421, out a5_422, out a6_423, out a7_424);
				*((word32) s0_180 + 18) = 0x00;
				if ((s1_181->dw03E0 & 0x02) != 0x00)
				{
					int32 a5_208 = (word32) s1_181->b035A;
					ui32 a4_210 = 0x01;
					int32 a5_213 = a5_208 >> 2 & 0x07;
					if (a5_213 > 0x02)
						a4_210 = 0x01 << a5_213 + ~0x02 & 0x00FF;
					*((word32) s0_180 + 16) = (byte) a4_210;
					*((word32) s0_180 + 8) = (word16) ((0x01 << (a5_208 & 3) + 0x0D) + ~0x00);
				}
				*((word32) s0_180 + 4) = 0x00;
				word32 s1_425;
				word32 a0_426;
				word32 a1_427;
				word32 a2_428;
				word32 a3_429;
				word32 a4_430;
				word32 a5_431;
				word32 s2_432;
				word32 s3_433;
				word32 s4_434;
				word32 s8_435;
				ke_msg_send(s0_180, mstatus, out s1_425, out a0_426, out a1_427, out a2_428, out a3_429, out a4_430, out a5_431, out s2_432, out s3_433, out s4_434, out s8_435);
				word32 s1_436;
				word32 a0_437;
				word32 a1_438;
				word32 a4_439;
				word32 a5_440;
				ke_state_set(0x06, 0x03, mstatus, out s1_436, out a0_437, out a1_438, out a4_439, out a5_440, out s2_133, out s3_134, out s4_135);
			}
			else
			{
				word32 s10_404;
				word32 a4_403;
				sm_connect_ind(ra, s0_109, s5_114, s6_115, mstatus, dwLoc28, dwArg10, dwArg14, dwArg38, s3, dwArg98, dwArgF8, out a4_403, out s2_133, out s3_134, out s4_135, out s10_404);
			}
			struct Eq_87856 * a5_268 = s4_135 + 0x05D8 + s2_133;
			a5_268->dw05C4 = s3_134->dw0030;
			if ((s3_134->dw0030 & 0x04) != 0x00)
				a5_268->dw03E0 &= ~0x06;
		}
		else
		{
			Eq_2 a4_41 = (word32) g_b42021750;
			if (a4_41 != 0x00)
				sm_join_bss(ra, (char *) s4_33 + 0x420208C8, a4_41, mstatus);
			else
			{
				word32 a4_441;
				word32 s2_442;
				word32 s3_443;
				word32 s4_444;
				word32 s10_445;
				sm_connect_ind(ra, 0x42021740, s5, s6, mstatus, dwLoc28, dwArg10, dwArg14, dwArg38, s3, dwArg98, dwArgF8, out a4_441, out s2_442, out s3_443, out s4_444, out s10_445);
			}
		}
		0x00 = dwArg0128;
	}
	else
		assert_err();
}

// 2301E54A: void sm_connect_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgB8, Stack word32 dwArgF8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack word32 dwArg0168)
void sm_connect_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgB8, word32 dwArgF8, Eq_2 dwArg0118, word32 dwArg0128, word32 dwArg0168)
{
	word32 a0_30;
	Eq_2 a4_32;
	word32 a2_595;
	word32 s2_596;
	ke_state_get(0x06, dwArg08, out a0_30, out a2_595, out a4_32, out s2_596);
	if (a0_30 == 0x08)
	{
l2301E688:
		0x00 = dwArg0128;
		return;
	}
	word32 a5_103;
	Eq_2 a0_45;
	struct Eq_87915 * s0_53;
	struct Eq_87916 * s3_56;
	word32 s1_597;
	word32 a1_598;
	word32 a3_600;
	word32 a2_599;
	word32 a5_602;
	word32 a4_601;
	word32 s2_604;
	word32 a6_603;
	word32 s8_606;
	word32 s4_605;
	Eq_2 ra_52 = ke_msg_alloc(ra, 33552385, a3, 0x01, a4_32, mstatus, dwLoc18, out s0_53, out s1_597, out a0_45, out a1_598, out a2_599, out a3_600, out a4_601, out a5_602, out a6_603, out s2_604, out s3_56, out s4_605, out s8_606);
	word32 a0_65;
	word32 a4_608;
	word32 a2_607;
	word32 s2_609;
	ke_state_get(0x06, dwArg08, out a0_65, out a2_607, out a4_608, out s2_609);
	Eq_2 s4_249 = a0_45;
	if (a0_65 != 0x00)
	{
		a5_103 = 0x08;
		goto l2301E67E;
	}
	word32 a3_78 = (word32) s0_53->b003B;
	Eq_2 a4_136 = (word32) s3_56->b420205A6;
	if (a4_136 == 0x00)
	{
		a4_136 = (word32) s3_56->b420205A8;
		if (a4_136 == 0x00)
		{
			a4_136.u0 = 0x02;
			if (a3_78 != 0x02)
			{
				a4_136 = (word32) s3_56->b420205B0;
				if (a4_136 != 0x00FF)
					assert_err();
				if (s3_56->dw42020590 != 0x00)
					assert_err();
			}
l2301E5C2:
			Eq_2 a5_107 = g_t42021740;
			if (a5_107 != 0x00)
				assert_err();
			s0_53->dw0000 = (word32) *((word32) a5_107 + 4);
			if (a5_107 != 0x00)
				assert_err();
			word32 a1_621;
			word32 a2_622;
			word32 a5_624;
			word32 a4_623;
			word32 a6_625;
			word32 s2_626;
			word32 s4_628;
			word32 s3_627;
			struct Eq_88036 * a0_140;
			Eq_2 a3_143;
			struct Eq_88038 * s0_148;
			Eq_2 s1_149;
			word32 s8_629;
			Eq_2 ra_147 = ke_msg_alloc(ra_52, 0x01FFF802, a3, 852, a4_136, mstatus, dwLoc18, out s0_148, out s1_149, out a0_140, out a1_621, out a2_622, out a3_143, out a4_623, out a5_624, out a6_625, out s2_626, out s3_627, out s4_628, out s8_629);
			a0_140->t0004 = s1_149;
			*(union Eq_2 *) 0x13 = s1_149;
			*((word32) s1_149 + 0x0011) = 0x00;
			word32 a2_630;
			Eq_2 a3_170;
			Eq_2 s1_174;
			word32 s2_177;
			word32 a4_631;
			word32 a5_632;
			word32 a7_633;
			word32 s3_634;
			word32 s4_635;
			word32 s5_636;
			word32 s6_637;
			word32 s7_638;
			word32 s8_639;
			word32 s9_640;
			word32 s10_641;
			word32 s11_642;
			word32 t4_643;
			Eq_2 a0_165;
			word32 a1_168;
			Eq_2 ra_173 = printf(ra_147, &g_t230AE718, a3_143, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_174, out a0_165, out a1_168, out a2_630, out a3_170, out a4_631, out a5_632, out a7_633, out s2_177, out s3_634, out s4_635, out s5_636, out s6_637, out s7_638, out s8_639, out s9_640, out s10_641, out s11_642, out t4_643);
			if ((word32) s0_148->b003B == 0x02)
			{
				word32 a1_283 = (word32) s0_148->b003D;
				*((word32) s1_174 + 0x0011) = 0x01;
				word32 a1_644;
				word32 a2_645;
				word32 a3_646;
				word32 a4_647;
				word32 a5_648;
				word32 a6_649;
				word32 a7_650;
				memcpy(1107433304, a1_283 + 1552 + s2_177, 0x06, out a1_644, out a2_645, out a3_646, out a4_647, out a5_648, out a6_649, out a7_650);
				Eq_2 a4_310;
				word32 s1_651;
				word32 a0_652;
				word32 a1_653;
				word32 a5_654;
				word32 s2_655;
				word32 s3_656;
				word32 s4_657;
				ke_state_set(0x06, 0x08, mstatus, out s1_651, out a0_652, out a1_653, out a4_310, out a5_654, out s2_655, out s3_656, out s4_657);
				word32 a4_658;
				sm_disconnect_process(ra_173, a4_310, mstatus, s6, dwLoc18, dwLoc08, dwArg08, dwArg48, dwArgB8, dwArg0118, out a4_658, out s4_249);
			}
			else
			{
				Eq_2 a4_189 = (word32) s0_148->w0028;
				if (a4_189 == 0x0FFFFFFF)
				{
					word32 s5_659;
					word32 s6_660;
					ra_173 = sm_get_bss_params(ra_173, s1_174, fp + -40, fp + -36, a3_170, dwArg00, dwArg04, dwArg4C, dwArgB8, dwArg0168, out a0_165, out a1_168, out a4_189, out s5_659, out s6_660);
				}
				if (a0_165 != 0x00 && a1_168 != 0x00)
					s4_249 = sm_join_bss(ra_173, a0_165, a4_189, mstatus);
				else
					s4_249 = sm_scan_bss(ra_173, a4_189, mstatus, dwArgF8);
			}
			a5_103 = 0x00;
l2301E67E:
			*s4_249 = (byte) a5_103;
			word32 s4_619;
			word32 s8_620;
			word32 s2_617;
			word32 s3_618;
			word32 a4_615;
			word32 a5_616;
			word32 a2_613;
			word32 a3_614;
			word32 a0_611;
			word32 a1_612;
			word32 s1_610;
			ke_msg_send(s4_249, mstatus, out s1_610, out a0_611, out a1_612, out a2_613, out a3_614, out a4_615, out a5_616, out s2_617, out s3_618, out s4_619, out s8_620);
			goto l2301E688;
		}
	}
	if (a3_78 != 0x02)
	{
		a5_103 = 0x09;
		goto l2301E67E;
	}
	goto l2301E5C2;
}

// 2301E738: void rxu_mgt_ind_handler(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s9, Register Eq_2 s10, Register (ptr32 byte) s11, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack word32 dwArg0148, Stack word32 dwArg0188)
void rxu_mgt_ind_handler(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s9, Eq_2 s10, byte * s11, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, word32 dwArg0148, word32 dwArg0188)
{
	ui32 a5_5 = (word32) *((word32) a1 + 2);
	if ((a5_5 & 252) != 0x00B0)
	{
		if ((a5_5 & 252) != 0x10 && (a5_5 & 252) != 48)
		{
			if ((a5_5 & 252) != 0x00C0 && (a5_5 & 252) != 0x00A0)
				return;
			word32 a0_21;
			Eq_2 s2_26;
			word32 a4_349;
			word32 a2_348;
			ke_state_get(0x06, dwArg28, out a0_21, out a2_348, out a4_349, out s2_26);
			if (a0_21 != 0x00)
				return;
			sm_deauth_handler(ra, a3, s2_26, s5, s6, mstatus, dwArg08, dwArg18, dwArg20, dwArg24, dwArg48, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgA8, dwArgC8, dwArg0108, dwArg0128);
		}
		else
		{
			word32 a0_73;
			word32 s2_347;
			word32 a4_346;
			word32 a2_345;
			Eq_2 s1_77 = ke_state_get(0x06, dwArg28, out a0_73, out a2_345, out a4_346, out s2_347);
			if (a0_73 == 0x06)
				sm_assoc_rsp_handler(ra, a1, s1_77, a1, s7, s9, fflags, frm, mstatus, dwLoc10, s0, dwArg18, dwArg20, dwArg24, dwArg38, dwArg6C, dwArg78, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0188);
		}
	}
	else
	{
		word32 a0_122;
		word32 s2_344;
		word32 a4_343;
		word32 a2_342;
		Eq_2 s1_126 = ke_state_get(0x06, dwArg28, out a0_122, out a2_342, out a4_343, out s2_344);
		if (a0_122 == 0x05)
			sm_auth_handler(ra, a1, s1_126, a1, s5, s6, s7, s9, s10, s11, fflags, frm, mstatus, dwLoc10, s0, dwLoc08, dwArg08, dwArg18, dwArg20, dwArg24, dwArg30, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0188);
	}
}

// 2301E7B2: void mm_set_vif_state_cfm_handler(Register Eq_2 ra, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0108)
void mm_set_vif_state_cfm_handler(Eq_2 ra, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArgA8, Eq_2 dwArg0108)
{
	word32 a0_17;
	Eq_2 a4_19;
	word32 s2_275;
	word32 a2_274;
	ke_state_get(0x06, dwArg18, out a0_17, out a2_274, out a4_19, out s2_275);
	if (a0_17 == 0x07)
	{
		Eq_2 a0_40;
		struct Eq_88363 * s1_49;
		word32 a4_280;
		word32 a5_281;
		word32 a3_279;
		word32 a2_278;
		word32 a1_277;
		word32 s0_276;
		word32 a6_282;
		word32 s2_283;
		word32 s3_284;
		word32 s4_285;
		word32 s8_286;
		Eq_2 ra_107 = ke_msg_alloc(ra, 75, 0x00, 0x06, a4_19, mstatus, dwLoc08, out s0_276, out s1_49, out a0_40, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a6_282, out s2_283, out s3_284, out s4_285, out s8_286);
		*((word32) a0_40 + 4) = (byte) (word32) s1_49->b003A;
		*((word32) a0_40 + 2) = (word16) (word32) s1_49->w0038;
		*a0_40 = (byte) (word32) s1_49->b003D;
		struct Eq_88419 * s1_71;
		struct Eq_88420 * s3_73;
		struct Eq_88421 * s4_74;
		word32 a0_287;
		word32 a1_288;
		word32 a2_289;
		word32 a3_290;
		word32 a4_291;
		word32 a5_292;
		word32 s8_293;
		word32 s2_129;
		Eq_2 s0_127 = ke_msg_send(a0_40, mstatus, out s1_71, out a0_287, out a1_288, out a2_289, out a3_290, out a4_291, out a5_292, out s2_129, out s3_73, out s4_74, out s8_293);
		word32 a5_85 = (word32) ((s3_73->dw05C4 & 0x01) < 1);
		s4_74->b4201EC41 = (byte) (a5_85 + 0x01);
		uint32 a3_89 = (word32) s1_71->w0034;
		s4_74->w4201EC48 = (word16) (a3_89 >> 8 | a3_89 << 0x08);
		if (a5_85 == ~0x00)
		{
			Eq_2 a0_100;
			struct Eq_88487 * s1_109;
			word32 s0_294;
			word32 a1_295;
			word32 a2_296;
			word32 a3_297;
			word32 a4_298;
			word32 a5_299;
			word32 a6_300;
			word32 s2_301;
			word32 s3_302;
			word32 s4_303;
			word32 s8_304;
			ra_107 = ke_msg_alloc(ra_107, 0x01000413, 0x05, 0x02, 0x02, mstatus, dwLoc08, out s0_294, out s1_109, out a0_100, out a1_295, out a2_296, out a3_297, out a4_298, out a5_299, out a6_300, out s2_301, out s3_302, out s4_303, out s8_304);
			*a0_100 = 0x00;
			*((word32) a0_100 + 1) = (byte) (word32) s1_109->b003D;
			word32 s1_305;
			word32 a0_306;
			word32 a1_307;
			word32 a2_308;
			word32 a3_309;
			word32 a4_310;
			word32 a5_311;
			word32 s3_312;
			word32 s4_313;
			word32 s8_314;
			s0_127 = ke_msg_send(a0_100, mstatus, out s1_305, out a0_306, out a1_307, out a2_308, out a3_309, out a4_310, out a5_311, out s2_129, out s3_312, out s4_313, out s8_314);
		}
		Eq_2 s0_142 = (word32) s0_127 + (s2_129 + 0x05D8);
		if ((*((word32) s0_142 + 1000) & 0x12FFF800) == 0x00)
		{
			word32 a4_315;
			word32 s2_316;
			word32 s3_317;
			word32 s4_318;
			word32 s10_319;
			sm_connect_ind(ra_107, s0_142, s5, s6, mstatus, s2, dwArg20, dwArg24, dwArg48, ra, dwArgA8, dwArg0108, out a4_315, out s2_316, out s3_317, out s4_318, out s10_319);
		}
	}
}

