pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301F282: Register Eq_2 dump_cfg_entries(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack word32 dwArg0198, Register out Eq_2 s1Out, Register out ptr32 a4Out)
// Called from:
//      cfg_start_req_handler
Eq_2 dump_cfg_entries(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, word32 dwArg0198, union Eq_2 & s1Out, ptr32 & a4Out)
{
	Eq_2 s0_183 = 588038536;
	word32 a0_325;
	word32 a1_326;
	word32 a2_327;
	word32 a4_328;
	word32 a5_329;
	word32 s4_330;
	word32 s8_331;
	Eq_2 s1_240 = (word32) puts(587917796, out a0_325, out a1_326, out a2_327, out a4_328, out a5_329, out s4_330, out s8_331) + 476;
	word32 s2_222 = 0x230AF000;
	while (s0_183 < s1_240)
	{
		struct Eq_90615 ** a1_59;
		Eq_2 a3_61;
		word32 s3_69;
		word32 s1_332;
		word32 a0_333;
		word32 a2_334;
		word32 a4_335;
		word32 a5_336;
		word32 a7_337;
		word32 s2_338;
		word32 s4_339;
		word32 s5_340;
		word32 s6_341;
		word32 s7_342;
		word32 s8_343;
		word32 s9_344;
		word32 s10_345;
		word32 s11_346;
		word32 t4_347;
		Eq_2 ra_64 = printf(ra, s2_222 + -1516, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_332, out a0_333, out a1_59, out a2_334, out a3_61, out a4_335, out a5_336, out a7_337, out s2_338, out s3_69, out s4_339, out s5_340, out s6_341, out s7_342, out s8_343, out s9_344, out s10_345, out s11_346, out t4_347);
		struct Eq_90615 * s0_78 = *a1_59;
		Eq_2 a3_86;
		word32 s4_95;
		Eq_2 a3_110;
		word32 s5_120;
		Eq_2 a3_134;
		word32 s6_145;
		Eq_2 a3_158;
		word32 s7_170;
		Eq_2 a3_191;
		word32 s8_204;
		word32 s1_348;
		word32 a0_349;
		word32 a1_350;
		word32 a2_351;
		word32 a4_352;
		word32 a5_353;
		word32 a7_354;
		word32 s2_355;
		word32 s3_356;
		word32 s5_357;
		word32 s6_358;
		word32 s7_359;
		word32 s8_360;
		word32 s9_361;
		word32 s10_362;
		word32 s11_363;
		word32 t4_364;
		word32 s1_365;
		word32 a0_366;
		word32 a1_367;
		word32 a2_368;
		word32 a4_369;
		word32 a5_370;
		word32 a7_371;
		word32 s2_372;
		word32 s3_373;
		word32 s4_374;
		word32 s6_375;
		word32 s7_376;
		word32 s8_377;
		word32 s9_378;
		word32 s10_379;
		word32 s11_380;
		word32 t4_381;
		word32 s1_382;
		word32 a0_383;
		word32 a1_384;
		word32 a2_385;
		word32 a4_386;
		word32 a5_387;
		word32 a7_388;
		word32 s2_389;
		word32 s3_390;
		word32 s4_391;
		word32 s5_392;
		word32 s7_393;
		word32 s8_394;
		word32 s9_395;
		word32 s10_396;
		word32 s11_397;
		word32 t4_398;
		word32 s1_399;
		word32 a0_400;
		word32 a1_401;
		word32 a2_402;
		word32 a4_403;
		word32 a5_404;
		word32 a7_405;
		word32 s2_406;
		word32 s3_407;
		word32 s4_408;
		word32 s5_409;
		word32 s6_410;
		word32 s8_411;
		word32 s9_412;
		word32 s10_413;
		word32 s11_414;
		word32 t4_415;
		word32 s1_416;
		word32 a0_417;
		word32 a1_418;
		word32 a2_419;
		word32 a4_420;
		word32 a5_421;
		word32 a7_422;
		word32 s2_423;
		word32 s3_424;
		word32 s4_425;
		word32 s5_426;
		word32 s6_427;
		word32 s7_428;
		word32 s9_429;
		word32 s10_430;
		word32 s11_431;
		word32 t4_432;
		word32 s1_433;
		word32 a0_434;
		word32 a1_435;
		word32 a2_436;
		word32 a4_437;
		word32 a5_438;
		word32 a7_439;
		word32 s3_440;
		word32 s4_441;
		word32 s5_442;
		word32 s6_443;
		word32 s7_444;
		word32 s8_445;
		word32 s9_446;
		word32 s10_447;
		word32 s11_448;
		word32 t4_449;
		ra = printf(printf(cfg_api_element_dump(printf(printf(printf(printf(ra_64, s3_69 + -0x05E0, a3_61, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_348, out a0_349, out a1_350, out a2_351, out a3_86, out a4_352, out a5_353, out a7_354, out s2_355, out s3_356, out s4_95, out s5_357, out s6_358, out s7_359, out s8_360, out s9_361, out s10_362, out s11_363, out t4_364), s4_95 + -0x05CC, a3_86, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_365, out a0_366, out a1_367, out a2_368, out a3_110, out a4_369, out a5_370, out a7_371, out s2_372, out s3_373, out s4_374, out s5_120, out s6_375, out s7_376, out s8_377, out s9_378, out s10_379, out s11_380, out t4_381), s5_120 + -1464, a3_110, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_382, out a0_383, out a1_384, out a2_385, out a3_134, out a4_386, out a5_387, out a7_388, out s2_389, out s3_390, out s4_391, out s5_392, out s6_145, out s7_393, out s8_394, out s9_395, out s10_396, out s11_397, out t4_398), s6_145 + -1444, a3_134, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_399, out a0_400, out a1_401, out a2_402, out a3_158, out a4_403, out a5_404, out a7_405, out s2_406, out s3_407, out s4_408, out s5_409, out s6_410, out s7_170, out s8_411, out s9_412, out s10_413, out s11_414, out t4_415), &s0_78->b0006 + 22, (word32) s0_78->b0006, fp + -64, out s0_183), s7_170 + -1424, a3_158, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_416, out a0_417, out a1_418, out a2_419, out a3_191, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_204, out s9_429, out s10_430, out s11_431, out t4_432), s8_204 + -1404, a3_191, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_433, out a0_434, out a1_435, out a2_436, out a3, out a4_437, out a5_438, out a7_439, out s2_222, out s3_440, out s4_441, out s5_442, out s6_443, out s7_444, out s8_445, out s9_446, out s10_447, out s11_448, out t4_449);
		word32 a0_450;
		word32 a1_451;
		word32 a2_452;
		word32 a4_453;
		word32 a5_454;
		word32 s4_455;
		word32 s8_456;
		s1_240 = puts(0x230B4438, out a0_450, out a1_451, out a2_452, out a4_453, out a5_454, out s4_455, out s8_456);
	}
	ptr32 a4_251;
	word32 a0_457;
	word32 a1_458;
	word32 a2_459;
	word32 a5_460;
	word32 s4_461;
	word32 s8_462;
	Eq_2 s1_252 = puts(0x230B4C64, out a0_457, out a1_458, out a2_459, out a4_251, out a5_460, out s4_461, out s8_462);
	0x00 = dwArg0198;
	s1Out = s1_252;
	a4Out = a4_251;
	return ra;
}

// 2301F362: void cfg_start_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_90938)) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArg0108, Stack word32 dwArg0178)
void cfg_start_req_handler(Eq_2 ra, Eq_2 a3, struct Eq_90938 ** a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArg0108, word32 dwArg0178)
{
	Eq_2 a4_116;
	struct Eq_90938 * a1_13 = *a5;
	Eq_2 s1_109 = a3;
	if (a5 != null)
	{
		a4_116.u0 = 0x02;
		if (a5 > (struct Eq_90938 **) 0x02)
			ra = dump_cfg_entries(ra, a3, a3, dwArg10, dwArg14, dwArg5C, dwArg0178, out s1_109, out a4_116);
	}
	else
	{
		utils_tlv_bl_unpack_auto(a1_13->dw0010, (word32) a1_13->w000C, fp + ~0x13);
		Eq_2 a0_29;
		Eq_2 a5_30;
		Eq_2 a1_32;
		ptr32 a2_33;
		Eq_2 s6_45;
		word32 s1_203;
		word32 a3_204;
		word32 a4_205;
		word32 a7_206;
		word32 s2_207;
		word32 s3_208;
		word32 s4_209;
		word32 s5_210;
		word32 s7_211;
		word32 s8_212;
		word32 s9_213;
		word32 s10_214;
		word32 s11_215;
		word32 t4_216;
		ra = cfg_api_element_set(printf(ra, &g_t230AE9C0, fp + ~0x13, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_203, out a0_29, out a1_32, out a2_33, out a3_204, out a4_205, out a5_30, out a7_206, out s2_207, out s3_208, out s4_209, out s5_210, out s6_45, out s7_211, out s8_212, out s9_213, out s10_214, out s11_215, out t4_216), a0_29, a1_32, a2_33, fp + ~0x13, 0x00, a5_30, s6_45, dwArg20, dwArg24, dwArg48, ra, dwArg0108, out s1_109, out a4_116);
	}
	Eq_2 a0_119;
	word32 s0_217;
	word32 s1_218;
	word32 a1_219;
	word32 a2_220;
	word32 a3_221;
	word32 a4_222;
	word32 a5_223;
	word32 a6_224;
	word32 s2_225;
	word32 s3_226;
	word32 s4_227;
	word32 s8_228;
	ke_msg_alloc(ra, 0x03000001, s1_109, 0x01, a4_116, mstatus, dwLoc08, out s0_217, out s1_218, out a0_119, out a1_219, out a2_220, out a3_221, out a4_222, out a5_223, out a6_224, out s2_225, out s3_226, out s4_227, out s8_228);
	*a0_119 = 0x00;
	word32 s1_229;
	word32 a0_230;
	word32 a1_231;
	word32 a2_232;
	word32 a3_233;
	word32 a4_234;
	word32 a5_235;
	word32 s2_236;
	word32 s3_237;
	word32 s4_238;
	word32 s8_239;
	ke_msg_send(a0_119, mstatus, out s1_229, out a0_230, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235, out s2_236, out s3_237, out s4_238, out s8_239);
}

// 2301F3D6: Register word32 dbg_test_print(Register (ptr32 byte) a0, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_60132) s1Out, Register out ptr32 a2Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out (ptr32 byte) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      GetTxEAPOLBuffer
//      UpdateEAPOLWcbLenAndTransmit
//      keyMgmtProcessMsgExt
//      KeyMgmtInitSta
//      keyMgmtSta_StartSession
//      init_customApp_mibs
//      supplicantIsEnabled
//      supplicantInitSession
//      supplicantDisable
//      supplicantEnable
//      keyMgmtFormatWpaRsnIe
//      GeneratePWKMsg2
//      KeyMgmtStaHsk_Recvd_PWKMsg1
//      supplicantInit
//      allocSupplicantData
//      keyMgmtGetKeySize
//      keyMgmtKeyGroupTxDone.isra.1
//      GenerateGrpMsg2
//      KeyMgmtStaHsk_Recvd_GrpMsg1
//      keyMgmtPlumbPairwiseKey
//      keyMgmtKeyPairwiseTxDone.isra.2
//      GeneratePWKMsg4
//      KeyMgmtStaHsk_Recvd_PWKMsg3
//      ProcessKeyMgmtDataSta
//      ProcessEAPoLPkt
//      keyMgmtStaRsnSecuredTimeoutHandler
//      supplicantGenerateRand
//      isApReplayCounterFresh
//      updateApReplayCounter
//      formEAPOLEthHdr
//      IsEAPOL_MICValid
//      KeyMgmtSta_PopulateEAPOLLengthMic
//      parseKeyKDE
//      parseKeyKDE_DataType
//      parseKeyDataGTK
//      KeyMgmtSta_ApplyKEK
//      KeyMgmtSta_IsRxEAPOLValid
//      KeyMgmtSta_PrepareEAPOLFrame
//      supplicantAkmIsWpaWpa2
//      supplicantAkmIsWpa2
//      supplicantAkmIsWpaWpa2Psk
//      supplicantAkmUsesKdf
//      supplicantConstructContext
//      KeyMgmt_DerivePTK
//      KeyMgmtSta_DeriveKeys
//      SetEAPOLKeyDescTypeVersion
//      GetKeyMsgNonceFromEAPOL
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
//      KeyMgmtResetCounter
//      keyMgmtSta_StartSession_internal
//      KeyMgmtSta_InitSession
//      set_psk
//      remove_psk
//      pmkCacheFindPSK
//      pmkCacheSetPassphrase
//      pmkCacheInit
//      pmkCacheRomInit
//      pmkCacheNewElement
//      pmkCacheUpdateReplacementRank
//      pmkCacheFindPSKElement
//      pmkCacheAddPSK
//      pmkCacheDeletePSK
//      pmkCacheGetHexNibble
//      pmkCacheGeneratePSK
//      supplicantRestoreDefaults
//      supplicantFuncInit
word32 dbg_test_print(byte * a0, Eq_2 dwArg0178, struct Eq_60132 & s1Out, ptr32 & a2Out, union Eq_2 & a5Out, ptr32 & a6Out, byte & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	struct Eq_60132 * s1_156 = &g_t42021000;
	Eq_2 a5_155 = g_t420217C4;
	if (a5_155 != 0x00)
	{
		s2 = a0;
		s1_156 = (struct Eq_60132 *) &g_t420217C0;
		s3 = a0 + 2;
		s5 = 0x05;
		s6 = 0x230AA000;
		s7 = 0x230AF000;
		do
		{
			Eq_91103 s0_49 = (word32) *s2;
			if ((int32) (byte) s0_49 >= 0x00)
				break;
			if (s0_49 <= 0x0087)
			{
				a5_155 = ~(int32) (byte) s0_49;
				s1_156 = null[(int32) (byte) s0_49 / 4];
				if ((a5_155 >> (word32) s0_49.u1 - 0x0080 & 0x01) != 0x00)
					goto l2301F42E;
			}
			else
			{
				a5_155 = (word32) s0_49.u1 + 0x0066 & 0x00FF;
				if (a5_155 > 0x05)
					assert_err();
				s1_156 = (struct Eq_60132 *) *((word32) a5_155 + 4);
				if ((word32) s0_49.u1 - 0x009A >= a5_155)
					goto l2301F42E;
			}
			++s2;
		} while (a0 + 2 != s2);
		a5_155 = fp + -28;
	}
l2301F42E:
	0x00 = (int8) dwArg0178;
	s1Out = s1_156;
	a2Out = dwArg0118;
	a5Out = a5_155;
	a6Out = dwArgF8;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArgD4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArgB4;
	return dwArg0138;
}

// 2301F48A: void dbg_get_sys_stat_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void dbg_get_sys_stat_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_12;
	word32 s0_54;
	word32 s1_55;
	word32 a1_56;
	word32 a2_57;
	word32 a3_58;
	word32 a4_59;
	word32 a5_60;
	word32 a6_61;
	word32 s2_62;
	word32 s3_63;
	word32 s4_64;
	word32 s8_65;
	ke_msg_alloc(ra, 0x040A, a3, 0x0C, a4, mstatus, dwArg08, out s0_54, out s1_55, out a0_12, out a1_56, out a2_57, out a3_58, out a4_59, out a5_60, out a6_61, out s2_62, out s3_63, out s4_64, out s8_65);
	*a0_12 = 0x00;
	*((word32) a0_12 + 4) = 0x00;
	*((word32) a0_12 + 8) = 0x00;
	word32 s1_66;
	word32 a0_67;
	word32 a1_68;
	word32 a2_69;
	word32 a3_70;
	word32 a4_71;
	word32 a5_72;
	word32 s2_73;
	word32 s3_74;
	word32 s4_75;
	word32 s8_76;
	ke_msg_send(a0_12, mstatus, out s1_66, out a0_67, out a1_68, out a2_69, out a3_70, out a4_71, out a5_72, out s2_73, out s3_74, out s4_75, out s8_76);
}

// 2301F4B2: void dbg_mem_write_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void dbg_mem_write_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_16;
	union Eq_2 ** a3_19;
	union Eq_2 * a4_20;
	word32 s0_64;
	word32 s1_65;
	word32 a1_66;
	word32 a2_67;
	word32 a5_68;
	word32 a6_69;
	word32 s2_70;
	word32 s3_71;
	word32 s4_72;
	word32 s8_73;
	ke_msg_alloc(ra, 0x0403, a3, 0x08, a4, mstatus, dwArg08, out s0_64, out s1_65, out a0_16, out a1_66, out a2_67, out a3_19, out a4_20, out a5_68, out a6_69, out s2_70, out s3_71, out s4_72, out s8_73);
	*a3_19 = (union Eq_2 **) a4_20;
	*a4_20 = (union Eq_2 *) a0_16;
	*((char *) *a4_20 + 4) = (union Eq_2 *) a0_16;
	word32 s1_74;
	word32 a0_75;
	word32 a1_76;
	word32 a2_77;
	word32 a3_78;
	word32 a4_79;
	word32 a5_80;
	word32 s2_81;
	word32 s3_82;
	word32 s4_83;
	word32 s8_84;
	ke_msg_send(a0_16, mstatus, out s1_74, out a0_75, out a1_76, out a2_77, out a3_78, out a4_79, out a5_80, out s2_81, out s3_82, out s4_83, out s8_84);
}

// 2301F4E2: void dbg_mem_read_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void dbg_mem_read_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_16;
	struct Eq_91327 ** a4_20;
	word32 s0_62;
	word32 s1_63;
	word32 a1_64;
	word32 a2_65;
	word32 a3_66;
	word32 a5_67;
	word32 a6_68;
	word32 s2_69;
	word32 s3_70;
	word32 s4_71;
	word32 s8_72;
	ke_msg_alloc(ra, 0x0401, a3, 0x08, a4, mstatus, dwArg08, out s0_62, out s1_63, out a0_16, out a1_64, out a2_65, out a3_66, out a4_20, out a5_67, out a6_68, out s2_69, out s3_70, out s4_71, out s8_72);
	struct Eq_91327 * a4_35 = *a4_20;
	a4_35->t0004 = a0_16;
	a4_35->t0000 = a0_16;
	word32 s1_73;
	word32 a0_74;
	word32 a1_75;
	word32 a2_76;
	word32 a3_77;
	word32 a4_78;
	word32 a5_79;
	word32 s2_80;
	word32 s3_81;
	word32 s4_82;
	word32 s8_83;
	ke_msg_send(a0_16, mstatus, out s1_73, out a0_74, out a1_75, out a2_76, out a3_77, out a4_78, out a5_79, out s2_80, out s3_81, out s4_82, out s8_83);
}

// 2301F50E: void dbg_set_sev_filter_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
void dbg_set_sev_filter_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	g_t420217C4 = a4;
	word32 s0_38;
	word32 s1_39;
	word32 a0_40;
	word32 a3_41;
	word32 s2_42;
	word32 s3_43;
	word32 s4_44;
	word32 s8_45;
	ke_msg_send_basic(ra, 1031, a3, a4, mstatus, dwLoc08, out s0_38, out s1_39, out a0_40, out a3_41, out s2_42, out s3_43, out s4_44, out s8_45);
}

