pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301F52E: void dbg_set_mod_filter_req_handler(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
void dbg_set_mod_filter_req_handler(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	g_t420217C0 = a4;
	word32 s0_38;
	word32 s1_39;
	word32 a0_40;
	word32 a3_41;
	word32 s2_42;
	word32 s3_43;
	word32 s4_44;
	word32 s8_45;
	ke_msg_send_basic(ra, 0x0405, a3, a4, mstatus, dwLoc08, out s0_38, out s1_39, out a0_40, out a3_41, out s2_42, out s3_43, out s4_44, out s8_45);
}

// 2301F54E: Register Eq_2 ke_queue_extract(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register ui32 a2, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 s2Out)
// Called from:
//      apm_bcn_set
//      ke_timer_set
//      ke_timer_clear
Eq_2 ke_queue_extract(Eq_2 ra, Eq_2 s0, Eq_2 a1, ui32 a2, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & s2Out)
{
	struct Eq_91413 * sp_23 = fp + -48;
	Eq_2 s2_15 = *s0;
	Eq_2 s3_17 = a1;
	Eq_2 s1_18 = 0x00;
	while (true)
	{
		ui32 a2_42;
		if (s0 == 0x00)
			break;
		sp_23->dw0084 = a2;
		word32 a0_35;
		Eq_2 a5_38;
		s3_17();
		Eq_2 s0_41 = *a5_38;
		a2_42 = sp_23->dw0084;
		if (a0_35 != 0x00)
		{
			if (s1_18 != 0x00)
				*a5_38 = s1_18;
			else
				*s2_15 = a5_38;
			s0 = *a5_38;
			if (a5_38 != 0x00)
				s0->u0 = 0x00;
			else
				*((word32) s2_15 + 4) = s1_18;
			break;
		}
		s1_18 = s0_41;
		s0 = a5_38;
		a2 = a2_42;
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_18;
	a0Out = s0;
	s2Out = s2_15;
	return ra;
}

// 2301F5A0: Register (ptr32 Eq_65767) bl_aes_128(Register Eq_2 a0, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out, Register out ptr32 s10Out)
// Called from:
//      generate_subkey
//      bl_aes_cmac
struct Eq_65767 * bl_aes_128(Eq_2 a0, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s7Out, ptr32 & s10Out)
{
	ptr32 s10_17;
	ptr32 s3_19;
	ptr32 s4_20;
	ptr32 s7_23;
	word32 s5_38;
	word32 s6_39;
	word32 s8_40;
	struct Eq_65767 * s2_18 = BL_AesEncrypt(a0, 0x02, out s3_19, out s4_20, out s5_38, out s6_39, out s7_23, out s8_40, out s10_17);
	s3Out = s3_19;
	s4Out = s4_20;
	s7Out = s7_23;
	s10Out = s10_17;
	return s2_18;
}

// 2301F5A8: void xor_128(Register Eq_91497 a0, Register (arr byte) a1, Register (arr int8) a2)
// Called from:
//      generate_subkey
//      bl_aes_cmac
void xor_128(Eq_91497 a0, byte a1[], int8 a2[])
{
	int32 a5_15;
	for (a5_15 = 0x00; a5_15 != 0x10; ++a5_15)
		a2[a5_15] = (byte) ((word32) *((word32) a0.u1 + a5_15) ^ (word32) a1[a5_15]);
}

// 2301F5D0: void leftshift_onebit(Register (arr int8) a0, Register (arr int8) a1)
// Called from:
//      generate_subkey
void leftshift_onebit(int8 a0[], int8 a1[])
{
	uint32 a5_15 = 0x00;
	int32 a4_13;
	for (a4_13 = 0x0F; a4_13 != ~0x00; a4_13 += ~0x00)
	{
		byte * a2_8 = a0 + a4_13;
		a1[a4_13] = (byte) (a5_15 | (word32) (*a2_8) << 1);
		a5_15 = (word32) *a2_8 >> 7;
	}
}

// 2301F5F8: Register Eq_2 generate_subkey(Register Eq_2 ra, Register Eq_2 a0, Register (arr int8) a1, Register (ptr32 (arr int8)) a2, Register out (ptr32 (arr int8)) s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      bl_aes_cmac
Eq_2 generate_subkey(Eq_2 ra, Eq_2 a0, int8 a1[], int8 (* a2)[], int8 (& s1Out, ptr32 & s2Out, ptr32 & s4Out)
{
	word32 a4_185;
	word32 a5_186;
	word32 a2_183;
	word32 a3_184;
	word32 a0_181;
	word32 a1_182;
	word32 t1_180;
	Eq_2 ra_27 = memset(ra, fp + -48, 0x00, 0x10, out t1_180, out a0_181, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186);
	word32 s7_189;
	word32 s10_190;
	word32 s3_187;
	word32 s4_188;
	ptr32 s2_42 = bl_aes_128(a0, out s3_187, out s4_188, out s7_189, out s10_190);
	if ((int32) bLoc40 >= 0x00)
		leftshift_onebit(fp + -64, a1);
	else
	{
		leftshift_onebit(fp + -64, fp + -32);
		xor_128(fp + -32, g_a230AEAF0, a1);
	}
	if ((int32) a1[0] >= 0x00)
		leftshift_onebit(a1, a2);
	else
	{
		leftshift_onebit(a1, fp + -32);
		xor_128(fp + -32, g_a230AEAF0, a2);
	}
	s1Out = a2;
	s2Out = s2_42;
	s4Out = dwArgF4;
	return ra_27;
}

// 2301F67C: void padding(Register Eq_91623 a0, Register (arr byte) a1, Register int32 a2)
// Called from:
//      bl_aes_cmac
void padding(Eq_91623 a0, byte a1[], int32 a2)
{
	int32 a5_24;
	byte * a3_6 = a1 + a2;
	for (a5_24 = 0x00; a5_24 != 0x10; ++a5_24)
	{
		if (a5_24 < a2)
			a1[a5_24] = (byte) (word32) *((word32) a0.u1 + a5_24);
		else if (a2 == a5_24)
			*a3_6 = 0x80;
		else
			a1[a5_24] = 0x00;
	}
}

// 2301F6B8: Register Eq_2 bl_aes_cmac(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out (ptr32 (arr byte)) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      ComputeEAPOL_MIC
Eq_2 bl_aes_cmac(Eq_2 ra, Eq_2 a0, ptr32 & s1Out, ptr32 & s2Out, byte (& s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	byte (* a1_75)[];
	Eq_91497 a0_76;
	ui32 s1_35;
	ptr32 s2_113;
	Eq_2 s4_123;
	Eq_2 ra_33 = generate_subkey(ra, a0, fp + -64, fp + -48, out s1_35, out s2_113, out s4_123);
	ui32 s0_106 = s1_35 + 0x0F ^ 0x10;
	if (s0_106 != 0x00)
	{
		if ((s1_35 & 0x0F) == 0x00)
		{
			a1_75 = fp + -64;
			a0_76 = (s0_106 + -1 << 4) + s2_113;
l2301F6F4:
			xor_128(a0_76, a1_75, fp + -96);
			word32 a3_282;
			word32 a1_280;
			word32 a0_279;
			word32 t1_278;
			word32 a5_284;
			word32 a4_283;
			word32 a2_281;
			Eq_2 ra_102 = memset(ra_33, fp + -0x0080, 0x00, 0x10, out t1_278, out a0_279, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284);
			int32 s1_105;
			int32 s0_107 = s0_106 + ~0x00;
			for (s1_105 = 0x00; s1_105 < s0_107; ++s1_105)
			{
				xor_128(fp + -0x0080, (s1_105 << 0x04) + s2_113, fp + -112);
				word32 s10_277;
				word32 s7_276;
				word32 s3_275;
				s2_113 = bl_aes_128(s4_123, out s3_275, out s4_123, out s7_276, out s10_277);
			}
			xor_128(fp + -0x0080, fp + -96, fp + -112);
			ptr32 s10_170;
			byte s3_172[];
			ptr32 s4_173;
			ptr32 s7_176;
			ptr32 s2_171 = bl_aes_128(s4_123, out s3_172, out s4_173, out s7_176, out s10_170);
			int32 a5_187;
			for (a5_187 = 0x00; a5_187 != 0x10; ++a5_187)
				s3_172[a5_187] = (byte) (word32) (fp + -0x0080 + a5_187);
			s1Out = dwArg0118;
			s2Out = s2_171;
			s3Out = s3_172;
			s4Out = s4_173;
			s5Out = dwArgB4;
			s7Out = s7_176;
			s9Out = dwArg94;
			s10Out = s10_170;
			return ra_102;
		}
	}
	else
		s0_106 = 0x01;
	padding((s0_106 + -1 << 4) + s2_113, fp + -80, s1_35 | 0x10);
	a1_75 = fp + -48;
	a0_76 = fp + -80;
	goto l2301F6F4;
}

