pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301F782: Register ptr32 BL_AES_MEMCMP(Register ptr32 a0, Register (arr byte) a1, Register int32 a2, Register out ptr32 a3Out)
// Called from:
//      BL_AesUnWrap
ptr32 BL_AES_MEMCMP(ptr32 a0, byte a1[], int32 a2, ptr32 & a3Out)
{
	int32 a5_18 = 0x00;
	a2_15 = a2;
	while (true)
	{
		int32 a2_15;
		if (a2 == a5_18)
			break;
		a3 = (word32) (a0 + a5_18);
		if (a3 == (word32) a1[a5_18])
			a2_15 += ~0x00;
		++a5_18;
	}
	a3Out = a3;
	return 0x00 - (word32) (a2_15 != 0x00);
}

// 2301F7AE: void BL_AES_MEMSET(Register (ptr32 Eq_91810) a0, Register word32 a1, Register word32 a2)
// Called from:
//      BL_AesWrap
//      BL_AesUnWrap
void BL_AES_MEMSET(struct Eq_91810 * a0, word32 a1, word32 a2)
{
	struct Eq_91810 * a2_5 = a0 + a2;
	while (a0 != a2_5)
	{
		++a0;
		a0[0x0FFF] = (struct Eq_91810) (byte) a1;
	}
}

// 2301F7BE: void BL_AES_MEMCPY(Register (ptr32 Eq_65767) a0, Register (ptr32 Eq_65767) a1, Register int32 a2)
// Called from:
//      BL_AesWrap
//      BL_AesUnWrap
void BL_AES_MEMCPY(struct Eq_65767 * a0, struct Eq_65767 * a1, int32 a2)
{
	if (a0 >= a1)
	{
		while (true)
		{
			a2 += ~0x00;
			if (a2 == ~0x00)
				break;
			a0[a2 / 0x0C] = (struct Eq_65767) (byte) (word32) a1[a2 / 0x0C];
		}
	}
	else
	{
		int32 a5_16;
		for (a5_16 = 0x00; a5_16 != a2; ++a5_16)
			a0[a5_16 / 0x0C] = (struct Eq_65767) (byte) (word32) a1[a5_16 / 0x0C];
	}
}

// 2301F7F8: Register word32 BL_AesEncrypt(Register Eq_2 a0, Register ui32 a1, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out Eq_91486 s8Out, Register out ptr32 s10Out)
// Called from:
//      bl_aes_128
//      BL_AesWrap
word32 BL_AesEncrypt(Eq_2 a0, ui32 a1, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, union Eq_91486 & s8Out, ptr32 & s10Out)
{
	struct Eq_91848 * s1_29;
	ptr32 s10_49;
	ptr32 s3_51;
	ptr32 s4_52;
	ptr32 s5_53;
	ptr32 s6_54;
	ptr32 s7_55;
	Eq_91486 s8_56;
	word32 s2_84;
	word32 s3_85;
	word32 s2_50 = rijndael_encrypt(rijndael_set_key(fp + -416, a0, a1 << 0x06, (struct Eq_91878 *) 0x01, out s1_29, out s2_84, out s3_85), s1_29, dwLoc0164, dwLocBC, dwLoc58, out s3_51, out s4_52, out s5_53, out s6_54, out s7_55, out s8_56, out s10_49);
	s3Out = s3_51;
	s4Out = s4_52;
	s5Out = s5_53;
	s6Out = s6_54;
	s7Out = s7_55;
	s8Out = s8_56;
	s10Out = s10_49;
	return s2_50;
}

// 2301F834: Register word32 BL_AesWrap(Register Eq_2 a0, Register ui32 a1, Register uint32 a2, Register (ptr32 Eq_65767) a3, Register (ptr32 Eq_65767) a4, Register (ptr32 Eq_65767) a5, Register out ptr32 s0Out, Register out (ptr32 Eq_65767) s2Out, Register out Eq_72509 s3Out, Register out ptr32 s5Out, Register out ptr32 s10Out)
// Called from:
//      Encrypt_keyData
word32 BL_AesWrap(Eq_2 a0, ui32 a1, uint32 a2, struct Eq_65767 * a3, struct Eq_65767 * a4, struct Eq_65767 * a5, ptr32 & s0Out, struct Eq_65767 & s2Out, union Eq_72509 & s3Out, ptr32 & s5Out, ptr32 & s10Out)
{
	if (a2 == 0x00)
	{
		s0Out = s0;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s10Out = s10;
		return ra;
	}
	else
	{
		BL_AES_MEMSET(fp + -64, 0x00, 0x10);
		ui32 s7_110 = a1;
		Eq_2 s6_109 = a0;
		struct Eq_65767 * s2_105 = a5;
		struct Eq_65767 * a1_44 = a4;
		if (a4 == null)
			a1_44 = &g_t230CB940;
		BL_AES_MEMCPY(fp + -72, a1_44, 0x08);
		BL_AES_MEMCPY(&a5->dw0008, a3, a2 << 0x03);
		ui32 s8_111 = a2 & 0x00FF;
		Eq_72509 s3_106 = 0x00;
		ptr32 s5_108;
		for (s5_108 = 0x06; s5_108 != 0x00; s5_108 += ~0x00)
		{
			ui32 s1_136 = 0x01;
			while (true)
			{
				struct Eq_65767 * s4_73 = s2_105 + (s1_136 << 0x03) / 0x0C;
				if (s1_136 == a2 + 0x01)
					break;
				BL_AES_MEMCPY(fp + -64, fp + -72, 0x08);
				BL_AES_MEMCPY(fp + -56, s4_73, 0x08);
				struct Eq_65767 * s4_107;
				s2_105 = BL_AesEncrypt(s6_109, s7_110, out s3_106, out s4_107, out s5_108, out s6_109, out s7_110, out s8_111, out s10);
				BL_AES_MEMCPY(fp + -72, fp + -64, 0x08);
				BL_AES_MEMCPY(s4_107, fp + -56, 0x08);
				++s1_136;
			}
			s3_106 = (word32) s3_106.u0 + s8_111 & 0x00FF;
		}
		BL_AES_MEMCPY(s2_105, fp + -72, 0x08);
		s0Out = dwArgCC;
		s2Out = s2_105;
		s3Out = s3_106;
		s5Out = s5_108;
		s10Out = s10;
		return dwLoc08;
	}
}

// 2301F918: Register (ptr32 Eq_65767) BL_AesUnWrap(Register Eq_2 a0, Register ui32 a1, Register uint32 a2, Register (ptr32 Eq_65767) a3, Register (ptr32 Eq_65767) a5, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      KeyMgmtSta_ApplyKEK
struct Eq_65767 * BL_AesUnWrap(Eq_2 a0, ui32 a1, uint32 a2, struct Eq_65767 * a3, struct Eq_65767 * a5, ptr32 & s9Out, ptr32 & s10Out)
{
	if (a2 == 0x00)
	{
		s9Out = s9;
		s10Out = s10;
		return a3;
	}
	else
	{
		BL_AES_MEMSET(fp + -472, 0x00, 0x08);
		BL_AES_MEMSET(fp + -464, 0x00, 0x10);
		BL_AES_MEMCPY(fp + -472, a3, 0x08);
		BL_AES_MEMCPY(a5, &a3->dw0008, a2 << 0x03);
		ptr32 s3_129;
		int32 s2_128;
		struct Eq_65767 * s1_126;
		rijndael_set_key(fp + -448, a0, a1 << 0x06, null, out s1_126, out s2_128, out s3_129);
		word32 s6_132;
		for (s6_132 = 0x06; s6_132 != 0x00; s6_132 += ~0x00)
		{
			int32 s4_159 = s2_128;
			struct Eq_65767 * s5_104 = s1_126;
			while (s4_159 > 0x00)
			{
				BL_AES_MEMCPY(fp + -464, fp + -472, 0x08);
				BL_AES_MEMCPY(fp + -456, s5_104, 0x08);
				word32 s4_130;
				struct Eq_65767 * s5_131;
				s1_126 = rijndael_decrypt(fp + -464, fp + -464, dwLoc01A4, dwLocFC, dwLoc98, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s9, out s10);
				BL_AES_MEMCPY(fp + -472, fp + -464, 0x08);
				BL_AES_MEMCPY(s5_131, fp + -456, 0x08);
				s5_104 = (struct Eq_65767 *) ((char *) s5_131 - 8);
				s4_159 = s4_130 + ~0x00;
			}
		}
		ptr32 a0_171 = s3_129;
		if (s3_129 == 0x00)
			a0_171 = 0x230CB940;
		struct Eq_65767 * a3_179;
		BL_AES_MEMCMP(a0_171, fp + -472, 0x08, out a3_179);
		s9Out = s9;
		s10Out = s10;
		return a3_179;
	}
}

// 2301FA44: void Bl_hmac_md5(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3)
// Called from:
//      ComputeEAPOL_MIC
void Bl_hmac_md5(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3)
{
	Eq_2 s1_26 = a2;
	Eq_2 s3_28 = a3;
	if (a3 > 64)
	{
		word32 s2_399;
		word32 s3_400;
		word32 s4_401;
		word32 s1_397;
		word32 a5_398;
		wpa_MD5Update(ra, a2, a3, wpa_MD5Init(fp + -584), dwLoc0234, dwLoc0208, dwLoc01B8, dwLoc0128, out s1_397, out a5_398, out s2_399, out s3_400, out s4_401);
		word32 s1_402;
		word32 s2_403;
		word32 s3_404;
		ra = wpa_MD5Final(ra, fp + -584, dwLoc0228, dwLoc01D8, dwLoc0148, out s1_402, out s2_403, out s3_404);
		s3_28.u0 = 0x10;
		s1_26 = fp + -0x0118;
	}
	word32 a5_390;
	word32 a2_387;
	word32 a3_388;
	word32 a4_389;
	word32 t1_384;
	word32 a0_385;
	word32 a1_386;
	Eq_2 ra_92 = memset(ra, fp + -432, 0x00, 64, out t1_384, out a0_385, out a1_386, out a2_387, out a3_388, out a4_389, out a5_390);
	word32 a7_396;
	word32 a3_393;
	word32 a5_394;
	word32 a6_395;
	word32 a1_391;
	word32 a2_392;
	struct Eq_92157 * a4_100;
	memcpy(fp + -432, s1_26, s3_28, out a1_391, out a2_392, out a3_393, out a4_100, out a5_394, out a6_395, out a7_396);
	do
	{
		struct Eq_92230 * a5_120 = a4_100->ptr0000;
		a4_100 = a4_100 ^ 0x36363636;
		a5_120->ptr1000 = a4_100;
	} while ((char *) a5_120 + 4 != fp + -368);
	struct Eq_92179 * a5_138;
	word32 s4_408;
	word32 s1_405;
	word32 s2_406;
	word32 s3_407;
	wpa_MD5Update(ra_92, fp + -432, 64, wpa_MD5Init(fp + -368), dwLoc0234, dwLoc0208, dwLoc01B8, dwLoc0128, out s1_405, out a5_138, out s2_406, out s3_407, out s4_408);
	Eq_2 s2_170;
	word32 s4_412;
	word32 s3_411;
	word32 a5_410;
	word32 s1_409;
	wpa_MD5Update(ra_92, a0, a1, a5_138, dwLoc0234, dwLoc0208, dwLoc01B8, dwLoc0128, out s1_409, out a5_410, out s2_170, out s3_411, out s4_412);
	Eq_2 s1_192;
	ptr32 s2_193;
	Eq_2 s3_194;
	word32 a5_419;
	word32 a3_417;
	word32 a4_418;
	word32 a1_415;
	word32 a2_416;
	word32 a0_414;
	word32 t1_413;
	Eq_2 ra_212 = memset(wpa_MD5Final(ra_92, s2_170, dwLoc0228, dwLoc01D8, dwLoc0148, out s1_192, out s2_193, out s3_194), fp + -432, 0x00, 64, out t1_413, out a0_414, out a1_415, out a2_416, out a3_417, out a4_418, out a5_419);
	word32 a7_425;
	word32 a4_423;
	word32 a6_424;
	word32 a2_421;
	word32 a3_422;
	word32 a1_420;
	struct Eq_92309 * a5_219;
	memcpy(fp + -432, s1_192, s3_194, out a1_420, out a2_421, out a3_422, out a4_423, out a5_219, out a6_424, out a7_425);
	do
	{
		struct Eq_92321 * s0_235 = a5_219->ptr0000;
		a5_219 = a5_219 ^ 0x5C5C5C5C;
		s0_235->ptr1000 = a5_219;
	} while ((char *) s0_235 + 4 != s2_193);
	struct Eq_92179 * a5_253;
	Eq_2 s4_260;
	word32 s2_427;
	word32 s3_428;
	word32 s1_426;
	wpa_MD5Update(ra_212, fp + -432, 64, wpa_MD5Init((char *) s0_235 + 4), dwLoc0234, dwLoc0208, dwLoc01B8, dwLoc0128, out s1_426, out a5_253, out s2_427, out s3_428, out s4_260);
	word32 s1_429;
	word32 a5_430;
	word32 s2_431;
	word32 s3_432;
	word32 s4_433;
	word32 s1_434;
	word32 s2_435;
	word32 s3_436;
	wpa_MD5Final(ra_212, wpa_MD5Update(ra_212, s4_260, 0x10, a5_253, dwLoc0234, dwLoc0208, dwLoc01B8, dwLoc0128, out s1_429, out a5_430, out s2_431, out s3_432, out s4_433), dwLoc0228, dwLoc01D8, dwLoc0148, out s1_434, out s2_435, out s3_436);
}

// 2301FB64: Register Eq_2 Bl_hmac_sha1(Register Eq_2 ra, Register int32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6)
// Called from:
//      ComputeEAPOL_MIC
//      Bl_PRF
Eq_2 Bl_hmac_sha1(Eq_2 ra, int32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6)
{
	Eq_2 s2_36 = a3;
	Eq_2 s1_38 = a4;
	if (a4 > 64)
	{
		Bl_SHA1Init(fp + -364);
		word32 a1_417;
		word32 a2_418;
		word32 s3_419;
		Bl_SHA1Update(fp + -364, a3, a4, dwLoc98, out a1_417, out a2_418, out s2_36, out s3_419);
		word32 s1_420;
		ra = Bl_SHA1Final(ra, fp + -364, s2_36, out s1_420);
		s1_38.u0 = 0x14;
	}
	word32 t1_404;
	word32 a4_409;
	word32 a5_410;
	word32 a0_405;
	word32 a1_406;
	word32 a2_407;
	word32 a3_408;
	Eq_2 ra_91 = memset(ra, fp + -448, 0x00, 64, out t1_404, out a0_405, out a1_406, out a2_407, out a3_408, out a4_409, out a5_410);
	word32 a4_413;
	word32 a5_414;
	word32 a6_415;
	word32 a7_416;
	word32 a1_411;
	word32 a2_412;
	struct Eq_92454 ** a3_104;
	memcpy(fp + -448, s2_36, s1_38, out a1_411, out a2_412, out a3_104, out a4_413, out a5_414, out a6_415, out a7_416);
	do
	{
		struct Eq_92454 * a5_119 = *a3_104;
		a5_119->dw1000 = a3_104 ^ 0x36363636;
		int32 a3_124 = a5_119->dw0004;
		a5_119->dw1004 = a3_124 ^ 0x36363636;
		a3_104 = a3_124 ^ 0x36363636;
	} while (&a5_119->dw0004 + 1 != fp + -384);
	Bl_SHA1Init(fp + -364);
	word32 s3_421;
	Eq_2 a2_136;
	Eq_2 a1_144;
	Eq_2 s2_142;
	Bl_SHA1Update(fp + -364, fp + -448, 64, dwLoc98, out a1_144, out a2_136, out s2_142, out s3_421);
	int32 s3_154 = 0x00;
	while (s3_154 < a2)
		Bl_SHA1Update(fp + -364, a1_144, a2_136, dwLoc98, out a1_144, out a2_136, out s2_142, out s3_154);
	Eq_2 s1_197;
	word32 a2_425;
	word32 a3_426;
	word32 a4_427;
	word32 a5_428;
	word32 t1_422;
	word32 a0_423;
	word32 a1_424;
	Eq_2 ra_210 = memset(Bl_SHA1Final(ra_91, fp + -364, fp + -384, out s1_197), fp + -448, 0x00, 64, out t1_422, out a0_423, out a1_424, out a2_425, out a3_426, out a4_427, out a5_428);
	word32 a6_433;
	word32 a7_434;
	word32 a1_429;
	word32 a2_430;
	word32 a3_431;
	word32 a5_432;
	struct Eq_92550 ** a4_217;
	memcpy(fp + -448, s2_142, s1_197, out a1_429, out a2_430, out a3_431, out a4_217, out a5_432, out a6_433, out a7_434);
	do
	{
		struct Eq_92550 * s0_234 = *a4_217;
		s0_234->dw1000 = a4_217 ^ 0x5C5C5C5C;
		int32 a4_239 = s0_234->dw0004;
		s0_234->dw1004 = a4_239 ^ 0x5C5C5C5C;
		a4_217 = a4_239 ^ 0x5C5C5C5C;
	} while (&s0_234->dw0004 + 1 != fp + -384);
	Bl_SHA1Init(fp + -364);
	word32 s2_437;
	word32 s2_441;
	word32 s3_442;
	word32 s3_438;
	word32 a1_439;
	word32 a2_440;
	word32 a1_435;
	word32 a2_436;
	Eq_2 s0_274 = Bl_SHA1Update(fp + -364, Bl_SHA1Update(fp + -364, fp + -448, 64, dwLoc98, out a1_435, out a2_436, out s2_437, out s3_438), 0x14, dwLoc98, out a1_439, out a2_440, out s2_441, out s3_442);
	word32 s1_443;
	Bl_SHA1Final(ra_210, fp + -364, s0_274, out s1_443);
	word32 a1_444;
	word32 a6_448;
	word32 a4_447;
	word32 a7_449;
	word32 a2_445;
	word32 a3_446;
	Eq_2 a5_317;
	memcpy(a5, s0_274, a6, out a1_444, out a2_445, out a3_446, out a4_447, out a5_317, out a6_448, out a7_449);
	return a5_317;
}

// 2301FCCC: Register Eq_2 Bl_PRF(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_66826 a7, Stack word32 dwArg34, Register out Eq_2 s0Out, Register out Eq_66826 s1Out, Register out Eq_2 s4Out)
// Called from:
//      KeyMgmt_DerivePTK
//      GenerateGTK_internal
Eq_2 Bl_PRF(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_66826 a7, word32 dwArg34, union Eq_2 & s0Out, union Eq_66826 & s1Out, union Eq_2 & s4Out)
{
	int32 a5_116;
	Eq_2 s0_140 = a3;
	word32 t1_267;
	word32 a0_268;
	word32 a1_269;
	word32 a2_270;
	word32 a3_271;
	word32 a4_272;
	word32 a5_273;
	Eq_2 ra_53 = memset(ra, fp + -0x00A8, 0x00, 0x0078, out t1_267, out a0_268, out a1_269, out a2_270, out a3_271, out a4_272, out a5_273);
	if (a2 != 0x00)
	{
		word32 a1_280;
		word32 a2_281;
		word32 a3_282;
		word32 a4_283;
		word32 a5_284;
		word32 a6_285;
		word32 a7_286;
		memcpy(fp + -0x00A8, a2, a3, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284, out a6_285, out a7_286);
		(word32) a3 + (fp + -48) + 0x0F88 = (ptr32) 0x00;
		word32 a1_287;
		word32 a2_288;
		word32 a3_289;
		word32 a4_290;
		word32 a6_291;
		word32 a7_292;
		memcpy(fp + -0x00A8 + ((word32) a3 + 1), a4, a5, out a1_287, out a2_288, out a3_289, out a4_290, out a5_116, out a6_291, out a7_292);
		s0_140 = (word32) a5 + ((word32) a3 + 1);
	}
	else
	{
		word32 a1_274;
		word32 a2_275;
		word32 a3_276;
		word32 a4_277;
		word32 a6_278;
		word32 a7_279;
		memcpy(fp + -0x00A8, a4, a5, out a1_274, out a2_275, out a3_276, out a4_277, out a5_116, out a6_278, out a7_279);
	}
	0x00 = dwArg34;
	(fp + -48 + a5_116)->b0F88 = 0x00;
	int32 s6_121 = (word32) a7 + 19 ^ 0x14;
	word32 s7_123 = 0x00;
	int32 s5_124 = ~0x13;
	while (true)
	{
		word32 a5_131 = (word32) a7 + (s5_124 + 0x00);
		if (s5_124 >= s6_121)
			break;
		int32 s0_135 = (int32) (byte) a5_131;
		if ((int32) (byte) a5_131 > 0x14)
			s0_135 = 0x14;
		int32 s0_139 = s0_135 << 24;
		word32 a5_165 = Bl_hmac_sha1(ra_53, 0x01, a0, a1, (word32) a6 + s7_123, s0_139 >> 24);
		0x00 = dwArg34;
		struct Eq_92751 * a5_180 = a5_165 + ~0x00 + (fp + -48);
		a5_180->b0F88 = (byte) ((word32) a5_180->bFFFFFF88 + 0x01);
		s0_140 = s0_139 >> 24;
		s7_123 += s0_139 >> 24;
		++s5_124;
	}
	s0Out = s0_140;
	s1Out = a7;
	s4Out = a6;
	return ra_53;
}

