pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0001.c
// 2301FDBC: Register Eq_2 wpa_MD5Transform(Register Eq_2 ra, Register (ptr32 Eq_92778) s0, Register Eq_2 s1, Register (ptr32 Eq_92778) a0, Register Eq_2 a1, Stack word32 dwArg3C, Stack int32 dwArgB8, Stack word32 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_92787 s2Out, Register out Eq_92788 s3Out, Register out ptr32 s4Out)
// Called from:
//      wpa_MD5Update
Eq_2 wpa_MD5Transform(Eq_2 ra, struct Eq_92778 * s0, Eq_2 s1, struct Eq_92778 * a0, Eq_2 a1, word32 dwArg3C, int32 dwArgB8, word32 dwArg0148, ptr32 & s0Out, ptr32 & s1Out, union Eq_92787 & s2Out, union Eq_92788 & s3Out, ptr32 & s4Out)
{
	int32 s8_31 = *a1;
	int32 s9_32 = a0->dw0008;
	int32 s10_33 = a0->dw000C;
	int32 a6_36 = a0->dw0004;
	uint32 a5_44 = ((s9_32 ^ s10_33) & a6_36 ^ s10_33) + (a0->dw0000 + (s8_31 + 3614090360));
	ui32 a5_51 = (a5_44 >> 25 | a5_44 << 0x07) + a6_36;
	struct Eq_92824 * a1_42 = *((word32) s1 + 4);
	uint32 a3_57 = ((a6_36 ^ s9_32) & a5_51 ^ s9_32) + (((word32) s1 - 0x173848AA) + s10_33);
	int32 t3_55 = a1_42->dw0008;
	ui32 a3_64 = (a3_57 >> 20 | a3_57 << 0x0C) + a5_51;
	uint32 a2_69 = ((a6_36 ^ a5_51) & a3_64 ^ a6_36) + ((t3_55 + 0x242070DB) + s9_32);
	Eq_92788 s3_70 = a1_42->t000C;
	ui32 a2_78 = (a2_69 << 0x0011 | a2_69 >> 0x0F) + a3_64;
	uint32 a4_83 = ((a5_51 ^ a3_64) & a2_78 ^ a5_51) + (((word32) s3_70.u0 - 0x3E423112) + a6_36);
	int32 t5_84 = a1_42->dw0010;
	ui32 a4_91 = (a4_83 << 22 | a4_83 >> 0x0A) + a2_78;
	uint32 a5_96 = ((a3_64 ^ a2_78) & a4_91 ^ a3_64) + ((t5_84 + ~0x0A83F050) + a5_51);
	int32 s5_97 = a1_42->dw0014;
	int32 a5_104 = (a5_96 >> 25 | a5_96 << 0x07) + a4_91;
	uint32 a3_109 = ((a2_78 ^ a4_91) & a5_104 ^ a2_78) + ((s5_97 + 1200080426) + a3_64);
	int32 t0_110 = a1_42->dw0018;
	ui32 a3_117 = (a3_109 >> 20 | a3_109 << 0x0C) + a5_104;
	uint32 a2_122 = ((a4_91 ^ a5_104) & a3_117 ^ a4_91) + ((t0_110 + 0xA8304613) + a2_78);
	int32 s7_123 = a1_42->dw001C;
	ui32 a2_130 = (a2_122 << 0x0011 | a2_122 >> 0x0F) + a3_117;
	uint32 a4_135 = ((a5_104 ^ a3_117) & a2_130 ^ a5_104) + ((s7_123 + 4249261313) + a4_91);
	ui32 a4_143 = (a4_135 << 22 | a4_135 >> 0x0A) + a2_130;
	Eq_2 a0_136 = s0->t0020;
	uint32 a5_148 = (char *) &s0->t0020 + 0x698098B8 + a5_104 + ((a3_117 ^ a2_130) & a4_143 ^ a3_117);
	Eq_2 t1_149 = *((word32) a0_136 + 36);
	ui32 a5_156 = (a5_148 >> 25 | a5_148 << 0x07) + a4_143;
	uint32 a3_161 = ((a2_130 ^ a4_143) & a5_156 ^ a2_130) + (((word32) t1_149 - 1958414417) + a3_117);
	Eq_2 s2_162 = *((word32) a0_136 + 40);
	ui32 a3_169 = (a3_161 >> 20 | a3_161 << 0x0C) + a5_156;
	uint32 a2_174 = ((a4_143 ^ a5_156) & a3_169 ^ a4_143) + (((word32) s2_162 - 0x0A00044F) + a2_130);
	Eq_2 t4_175 = *((word32) a0_136 + 44);
	ui32 a2_182 = (a2_174 << 0x0011 | a2_174 >> 0x0F) + a3_169;
	uint32 a4_187 = ((a5_156 ^ a3_169) & a2_182 ^ a5_156) + (((word32) t4_175 - 1990404162) + a4_143);
	Eq_2 s4_188 = *((word32) a0_136 + 48);
	ui32 a4_195 = (a4_187 << 22 | a4_187 >> 0x0A) + a2_182;
	uint32 a5_200 = ((a3_169 ^ a2_182) & a4_195 ^ a3_169) + (((word32) s4_188 + 0x6B901122) + a5_156);
	Eq_2 t6_201 = *((word32) a0_136 + 52);
	int32 a5_208 = (a5_200 >> 25 | a5_200 << 0x07) + a4_195;
	uint32 a3_213 = ((a2_182 ^ a4_195) & a5_208 ^ a2_182) + (((word32) t6_201 - 40341101) + a3_169);
	Eq_2 s6_214 = *((word32) a0_136 + 56);
	ui32 a3_221 = (a3_213 >> 20 | a3_213 << 0x0C) + a5_208;
	uint32 a2_226 = ((a4_195 ^ a5_208) & a3_221 ^ a4_195) + (((word32) s6_214 - 1502002290) + a2_182);
	Eq_2 t2_227 = *((word32) a0_136 + 60);
	ui32 a2_234 = (a2_226 << 0x0011 | a2_226 >> 0x0F) + a3_221;
	uint32 a4_239 = ((a5_208 ^ a3_221) & a2_234 ^ a5_208) + (((word32) t2_227 + 1236535329) + a4_195);
	ui32 a4_245 = (a4_239 << 22 | a4_239 >> 0x0A) + a2_234;
	uint32 a5_251 = ((a2_234 ^ a4_245) & a3_221 ^ a2_234) + (((word32) s1 - 0x09E1DA9E) + a5_208);
	ui32 a5_257 = (a5_251 >> 27 | a5_251 << 0x05) + a4_245;
	uint32 a3_263 = ((a4_245 ^ a5_257) & a2_234 ^ a4_245) + ((t0_110 + 0xC040B340) + a3_221);
	ui32 a3_269 = (a3_263 >> 23 | a3_263 << 0x09) + a5_257;
	uint32 a2_275 = ((a5_257 ^ a3_269) & a4_245 ^ a5_257) + (((word32) t4_175 + 643717713) + a2_234);
	ui32 a2_281 = (a2_275 >> 18 | a2_275 << 0x0E) + a3_269;
	uint32 a4_287 = ((a3_269 ^ a2_281) & a5_257 ^ a3_269) + ((s8_31 + 3921069994) + a4_245);
	ui32 a4_293 = (a4_287 << 20 | a4_287 >> 0x0C) + a2_281;
	uint32 a5_299 = ((a2_281 ^ a4_293) & a3_269 ^ a2_281) + ((s5_97 + 0xD62F105D) + a5_257);
	ui32 a5_305 = (a5_299 >> 27 | a5_299 << 0x05) + a4_293;
	uint32 a3_311 = ((a4_293 ^ a5_305) & a2_281 ^ a4_293) + (((word32) s2_162 + 0x02441453) + a3_269);
	ui32 a3_317 = (a3_311 >> 23 | a3_311 << 0x09) + a5_305;
	uint32 a2_323 = ((a5_305 ^ a3_317) & a4_293 ^ a5_305) + (((word32) t2_227 - 660478335) + a2_281);
	ui32 a2_329 = (a2_323 >> 18 | a2_323 << 0x0E) + a3_317;
	uint32 a4_335 = ((a3_317 ^ a2_329) & a5_305 ^ a3_317) + ((t5_84 + 3889429448) + a4_293);
	int32 a4_341 = (a4_335 << 20 | a4_335 >> 0x0C) + a2_329;
	uint32 a5_347 = ((a2_329 ^ a4_341) & a3_317 ^ a2_329) + (((word32) t1_149 + 568446438) + a5_305);
	ui32 a5_353 = (a5_347 >> 27 | a5_347 << 0x05) + a4_341;
	uint32 a3_359 = ((a4_341 ^ a5_353) & a2_329 ^ a4_341) + (((word32) s6_214 - 1019803690) + a3_317);
	ui32 a3_365 = (a3_359 >> 23 | a3_359 << 0x09) + a5_353;
	uint32 a2_371 = ((a5_353 ^ a3_365) & a4_341 ^ a5_353) + (((word32) s3_70.u0 - 187363961) + a2_329);
	ui32 a2_377 = (a2_371 >> 18 | a2_371 << 0x0E) + a3_365;
	uint32 a4_383 = (char *) &s0->t0020 + 1163531469 + a4_341 + ((a3_365 ^ a2_377) & a5_353 ^ a3_365);
	ui32 a4_389 = (a4_383 << 20 | a4_383 >> 0x0C) + a2_377;
	uint32 a5_395 = ((a2_377 ^ a4_389) & a3_365 ^ a2_377) + (((word32) t6_201 - 1444681467) + a5_353);
	ui32 a5_401 = (a5_395 >> 27 | a5_395 << 0x05) + a4_389;
	uint32 a3_407 = ((a4_389 ^ a5_401) & a2_377 ^ a4_389) + ((t3_55 + 4243563512) + a3_365);
	int32 a3_413 = (a3_407 >> 23 | a3_407 << 0x09) + a5_401;
	uint32 a1_419 = ((a5_401 ^ a3_413) & a4_389 ^ a5_401) + (a2_377 + (s7_123 + 0x676F02D9));
	ui32 a1_424 = (a1_419 >> 18 | a1_419 << 0x0E) + a3_413;
	ui32 a2_426 = a3_413 ^ a1_424;
	uint32 a4_431 = (a5_401 & a2_426 ^ a3_413) + (((word32) s4_188 - 0x72D5B376) + a4_389);
	ui32 a4_437 = (a4_431 << 20 | a4_431 >> 0x0C) + a1_424;
	uint32 a5_441 = a5_401 + (s5_97 + ~0x0005C6BD) + (a2_426 ^ a4_437);
	int32 a5_448 = (a5_441 >> 28 | a5_441 << 0x04) + a4_437;
	uint32 a3_452 = (char *) s0 - 0x788E097F + a3_413 + ((a1_424 ^ a4_437) ^ a5_448);
	ui32 a3_459 = (a3_452 >> 21 | a3_452 << 11) + a5_448;
	uint32 a1_463 = (a4_437 ^ a5_448 ^ a3_459) + (((word32) t4_175 + 0x6D9D6122) + a1_424);
	ui32 a1_470 = (a1_463 >> 16 | a1_463 << 0x10) + a3_459;
	uint32 a4_474 = (a5_448 ^ a3_459 ^ a1_470) + (((word32) s6_214 - 35309556) + a4_437);
	ui32 a4_481 = (a4_474 << 23 | a4_474 >> 0x09) + a1_470;
	uint32 a5_485 = (a3_459 ^ a1_470 ^ a4_481) + (((word32) s1 - 0x5B4115BC) + a5_448);
	ui32 a5_492 = (a5_485 >> 28 | a5_485 << 0x04) + a4_481;
	uint32 a2_496 = (a1_470 ^ a4_481 ^ a5_492) + (a3_459 + (t5_84 + 1272893353));
	ui32 a2_503 = (a2_496 >> 21 | a2_496 << 11) + a5_492;
	uint32 a3_507 = (a4_481 ^ a5_492 ^ a2_503) + (a1_470 + (s7_123 + ~0x0944B49F));
	ui32 a3_514 = (a3_507 >> 16 | a3_507 << 0x10) + a2_503;
	uint32 a4_518 = (a5_492 ^ a2_503 ^ a3_514) + (((word32) s2_162 - 0x41404390) + a4_481);
	ui32 a4_525 = (a4_518 << 23 | a4_518 >> 0x09) + a3_514;
	uint32 a1_529 = (a2_503 ^ a3_514 ^ a4_525) + (a5_492 + ((word32) t6_201 + 681279174));
	ui32 a1_536 = (a1_529 >> 28 | a1_529 << 0x04) + a4_525;
	uint32 a5_540 = (a3_514 ^ a4_525 ^ a1_536) + (a2_503 + (s8_31 + 3936430074));
	ui32 a5_547 = (a5_540 >> 21 | a5_540 << 11) + a1_536;
	uint32 a3_551 = (a4_525 ^ a1_536 ^ a5_547) + (((word32) s3_70.u0 - 722521979) + a3_514);
	ui32 a3_558 = (a3_551 >> 16 | a3_551 << 0x10) + a5_547;
	uint32 a2_562 = (a1_536 ^ a5_547 ^ a3_558) + (a4_525 + (t0_110 + 0x04881D05));
	ui32 a2_569 = (a2_562 << 23 | a2_562 >> 0x09) + a3_558;
	uint32 a4_573 = (a5_547 ^ a3_558 ^ a2_569) + (a1_536 + ((word32) t1_149 - 0x262B2FC7));
	ui32 a4_580 = (a4_573 >> 28 | a4_573 << 0x04) + a2_569;
	uint32 a1_584 = (a3_558 ^ a2_569 ^ a4_580) + (a5_547 + ((word32) s4_188 - 0x1924661B));
	ui32 a1_591 = (a1_584 >> 21 | a1_584 << 11) + a4_580;
	uint32 a3_595 = (a2_569 ^ a4_580 ^ a1_591) + (((word32) t2_227 + 530742520) + a3_558);
	ui32 a3_602 = (a3_595 >> 16 | a3_595 << 0x10) + a1_591;
	uint32 a5_606 = (a4_580 ^ a1_591 ^ a3_602) + (a2_569 + (t3_55 + 0xC4AC5665));
	ui32 a5_613 = (a5_606 << 23 | a5_606 >> 0x09) + a3_602;
	uint32 a4_618 = ((~a1_591 | a5_613) ^ a3_602) + ((s8_31 + 0xF4292244) + a4_580);
	ui32 a4_625 = (a4_618 >> 26 | a4_618 << 0x06) + a5_613;
	uint32 a1_630 = ((~a3_602 | a4_625) ^ a5_613) + ((s7_123 + 1126891415) + a1_591);
	ui32 a1_637 = (a1_630 >> 22 | a1_630 << 0x0A) + a4_625;
	uint32 a3_642 = ((~a5_613 | a1_637) ^ a4_625) + (((word32) s6_214 - 1416354905) + a3_602);
	ui32 a3_649 = (a3_642 >> 0x0011 | a3_642 << 0x0F) + a1_637;
	uint32 a2_654 = ((~a4_625 | a3_649) ^ a1_637) + (a5_613 + (s5_97 + 0xFC93A039));
	int32 a2_661 = (a2_654 << 21 | a2_654 >> 11) + a3_649;
	uint32 a5_666 = ((~a1_637 | a2_661) ^ a3_649) + (a4_625 + ((word32) s4_188 + 0x655B59C3));
	ui32 a5_673 = (a5_666 >> 26 | a5_666 << 0x06) + a2_661;
	uint32 a4_678 = ((~a3_649 | a5_673) ^ a2_661) + (a1_637 + ((word32) s3_70.u0 - 0x70F3336E));
	ui32 a4_685 = (a4_678 >> 22 | a4_678 << 0x0A) + a5_673;
	Eq_92787 s2_686 = (word32) s2_162 - 1051523 + a3_649;
	uint32 a3_690 = (word32) s2_686.u0 + ((~a2_661 | a4_685) ^ a5_673);
	ui32 a3_697 = (a3_690 >> 0x0011 | a3_690 << 0x0F) + a4_685;
	ptr32 s1_698 = (word32) s1 - 0x7A7BA22F + a2_661;
	uint32 a2_702 = ((~a5_673 | a3_697) ^ a4_685) + s1_698;
	ui32 a2_709 = (a2_702 << 21 | a2_702 >> 11) + a3_697;
	uint32 s0_714 = (char *) &s0->t0020 + 1873313327 + a5_673 + ((~a4_685 | a2_709) ^ a3_697);
	ui32 s0_721 = (s0_714 >> 26 | s0_714 << 0x06) + a2_709;
	uint32 t2_726 = ((~a3_697 | s0_721) ^ a2_709) + (a4_685 + ((word32) t2_227 - 30611744));
	ui32 t2_733 = (t2_726 >> 22 | t2_726 << 0x0A) + s0_721;
	uint32 a1_738 = ((~a2_709 | t2_733) ^ s0_721) + (a3_697 + (t0_110 + 0xA3014314));
	ui32 a1_745 = (a1_738 >> 0x0011 | a1_738 << 0x0F) + t2_733;
	uint32 a2_750 = ((~s0_721 | a1_745) ^ t2_733) + (((word32) t6_201 + 0x4E0811A1) + a2_709);
	ui32 a2_757 = (a2_750 << 21 | a2_750 >> 11) + a1_745;
	uint32 a5_762 = ((~t2_733 | a2_757) ^ a1_745) + (s0_721 + (t5_84 + 4149444226));
	ui32 a5_769 = (a5_762 >> 26 | a5_762 << 0x06) + a2_757;
	uint32 a4_774 = ((~a1_745 | a5_769) ^ a2_757) + (t2_733 + ((word32) t4_175 - 1120210379));
	ui32 a4_781 = (a4_774 >> 22 | a4_774 << 0x0A) + a5_769;
	a0->dw0000 = a5_769 + a0->dw0000;
	uint32 a3_786 = ((~a2_757 | a4_781) ^ a5_769) + (a1_745 + (t3_55 + 718787259));
	a0->dw0008 = s9_32 + ((a3_786 >> 0x0011 | a3_786 << 0x0F) + a4_781);
	a0->dw000C = s10_33 + a4_781;
	0x00 = dwArg0148;
	0x00 = dwArg3C;
	a0->dw0004 = dwArgB8;
	word32 t1_860;
	word32 a0_861;
	word32 a1_862;
	word32 a2_863;
	word32 a3_864;
	word32 a4_865;
	word32 a5_866;
	Eq_2 ra_830 = memset(ra, a0_136, 0x00, 64, out t1_860, out a0_861, out a1_862, out a2_863, out a3_864, out a4_865, out a5_866);
	s0Out = dwLoc04;
	s1Out = s1_698;
	s2Out = s2_686;
	s3Out = s3_70;
	s4Out = dwArg98;
	return ra_830;
}

